/********************/基础知识/************************************************************/
（2）
作用域运算符（::）：它是运算符中等级最高的，用于指定变量或函数，可以避免重名。

全局作用域符号：	当全局变量在局部函数中与其中某个变量重名，那么就可以用::来区分。
类作用域符号：		它的前面一般是类名称，后面一般是该类的成员名称，C++为了避免不同的类有名称相同的成员而采用作用域的方式进行区分。
命名空间作用域符号：是作用域限定符或者称作用域运算符或者作用域操作符（scope operator），例如命名空间


（3）
回调函数：通过函数指针调用的函数，它作为参数传递给另一个函数
通常用于事件处理、异步编程和处理各种操作系统和框架的API。
异步编程：指在代码执行时不会阻塞程序运行的方式。
事件驱动：指程序的执行是由外部事件触发而不是顺序执行的方式。


（4）
句柄（Handle）是一种代表内核对象的标识符。每个句柄都指向一个内核对象，例如线程、进程、文件、窗口、事件等。
句柄可以被用来访问和操作内核对象，例如读取文件、发送消息给窗口、等待线程结束等等。
类似于文件描述符，是一个整数。

（5）
单例模式：保证整个系统中一个类只有一个对象的实例，实现这种功能的方式就叫单例模式。

（6）
模块化编程

（7）RAII






