/********************/基础知识/************************************************************/
（1）
左值与右值：左值指既能够出现在等号左边，也能出现在等号右边的变量；右值则是只能出现在等号右边的变量。


（2）
作用域运算符（::）：它是运算符中等级最高的，用于指定变量或函数，可以避免重名。

全局作用域符号：	当全局变量在局部函数中与其中某个变量重名，那么就可以用::来区分。
类作用域符号：		它的前面一般是类名称，后面一般是该类的成员名称，C++为了避免不同的类有名称相同的成员而采用作用域的方式进行区分。
命名空间作用域符号：是作用域限定符或者称作用域运算符或者作用域操作符（scope operator），例如命名空间


（3）
回调函数：通过函数指针调用的函数，它作为参数传递给另一个函数
通常用于事件处理、异步编程和处理各种操作系统和框架的API。
异步编程：指在代码执行时不会阻塞程序运行的方式。
事件驱动：指程序的执行是由外部事件触发而不是顺序执行的方式。


（4）
句柄（Handle）是一种代表内核对象的标识符。每个句柄都指向一个内核对象，例如线程、进程、文件、窗口、事件等。
句柄可以被用来访问和操作内核对象，例如读取文件、发送消息给窗口、等待线程结束等等。
类似于文件描述符，是一个整数。

（5）
单例模式：保证整个系统中一个类只有一个对象的实例，实现这种功能的方式就叫单例模式。

（6）
模块化编程


（7）
运算符优先级
1		括号、成员
2		强转、前缀、自增减

3		乘除取余
4		算术加减

6		左右移位
7		比大小
8		等于不等于

9		位与
10		位异或
11		位或
12		与
13		或

14		三目
15		赋值
16		逗号

//口诀
括号和成员
强转前缀自加减
乘除取余 算术加减
左右移位比大小
等于不等于
位与异或或与或
三目赋值和逗号

//python中，非与或在比大小后面



（8）内存分布（高地址到低地址）

栈区：向下增长，由编译器自动分配释放，存放局部变量、形参、返回值

堆区：向上增长，由程序员分配和释放，malloc()、free()

全局(静态)区：包括.bss段 和.data段，存放全局变量和静态变量
未初始化 或 初始化为0 的 全局变量 和 静态变量 存放在.bss段。
已初始化的 全局变量 和 静态变量 存放在.data段。

常量区：存放字符串、数字、const修饰的全局变量。

代码区：存放程序执行的代码，其值不能修改（若修改则会出现错误）。
字符串常量和define定义的常量也有可能存放在代码区。

映射区：存储动态链接库以及调用mmap函数的文件映射


（9）不可访问区域
不可访问区域：例如定义一个指针p, int* p = NULL; 之后不能对p进行使用，因为p的地址为NULL，即0x0000 0000, 该地址属于保留区即不可访问区。
不可访问内存：是指一组没有任何可访问指针指向的由计算机程序进行动态分配的内存块。就是内存泄漏。


（10）段错误
段错误不属于语法错误，编译器不会提示，出现的原因一般是非法操作内存（访问不可访问区域， 访问越界，内存溢出。。。）
解决办法：在关键位置，添加打印语句，找出错误的代码行


（11）
gcc 常见参数编译选项
- E 预处理
- S 编译
- c 汇编
- o 指定生成
- l 指明使用的库对象 - lm 指明数学库
- L 指明使用的库位置
- I 指明头文件所在位置
- Wall  严格编译


(12)二级指针
二级指针是一级指针的指针，存放一级指针的地址。
二级指针q是指针p的地址，*q是a的地址，**q是a的值，&q是q自己的地址。
int a = 10;
int* p = &a;
int* q = &p;


（13）简述C++从代码到可执行二进制文件的过程
预处理、编译、汇编、链接
预编译：这个过程主要的处理操作如下：
（1）将所有的#define删除，并且展开所有的宏定义
（2）处理所有的条件预编译指令，如#if、#ifdef
（3）处理#include预编译指令，将被包含的文件插入到该预编译指令的位置。
（4）过滤所有的注释
（5）添加行号和文件名标识
编译：这个过程主要的处理操作如下：
（1）词法分析：将源代码的字符序列分割成一系列的记号。
（2）语法分析：对记号进行语法分析，产生语法树。
（3）语义分析：判断表达式是否有意义。
（4）代码优化：
（5）目标代码生成：生成汇编代码。
（6）目标代码优化
汇编：这个过程主要是将汇编代码转变成机器可以执行的指令。
链接：将不同的源文件产生的目标文件进行链接，从而形成一个可以执行的程序
