/*************************/音视频概念/***************************************************************************/
//图像参数
1. 像素："Pixel" 图像的最小单位。每个像素都有 3 个通道。即RGB，或4通道RGBA。
2. 位深：每个像素点颜色使用的位数。
3. Stride：内存中每行像素占用的空间, 不一定是图像的宽度。

//视频参数
1. 分辨率：视频面积大小（像素px）；
2. 帧率：每秒的帧数量fps；
3. 码率：每秒的数据量bps（b = bit）。（码率 = 视频大小 / 视频时长）（能支撑的同时在线观看视频人数 = 带宽大小 / 码率）
视频文件大小[Byte] = （ 视频编码率[bit] + 音频编码率[bit] ）/ 8 * 时长[s]

//音频参数
1. 采样率：每秒从模拟信号中采集转换成数字信号的音频点数量Hz；	比特率(音频) = 采样率 x 采用位数 x 声道数
2. 声道数：同时采集声音的通道数量，常见有单声道和双声道（立体声道）；
3. 位宽：也叫采样位宽，指保存单个声音样本点的比特位数，通常是16bit。

//解码格式（即原始数据格式）
视频（图像颜色编码格式）：YUV、RGB
音频（编码格式）：PCM（脉冲调制编码）

//编码格式（即压缩数据的算法）
视频：H264（也叫AVG）、H265
音频：AAC、Opus、G711、MP3

//编解码方式
硬编解码：通过硬件实现编解码，减轻CPU计算的负担，如GPU等
软编解码：如 H264、H265、MPEG - 4等编解码算法，更消耗CPU

//封装格式
视频：mp4、mov、3gp、mkv、avi、flv、ps、ts等
音频：mp3、mwv、wma、midi、aac、cda、mov等

//其它
*muxer（复用器）和demuxer（解复用器）或称封装器与解封装器
*H264 + AAC封装为FLV或MP4是最为流行的模式
转码：一种封装格式转换成另一种封装格式，对码流进行先解码再编码。
封装格式转换（remux）：一种封装格式转换成另外一种封装格式，仅对码流重新打包，不涉及编解码。



//音视频处理流程

1. 采集。				从客户端的摄像头、麦克风和本地原始文件等，获得基础的音视频数据；

2. 预处理。			对音视频进行修剪操作。可以在这里进行美颜、裁剪、AI识别处理、声音A3处理等操作；

3. 编码。				原始文件或经处理后的文件一般都比较大，此时就需要进行压缩、转码之类的操作，减少文件提交，然后再进行传输；

4. 解码。				压缩数据传输完之后，就需要解码成原始文件一样的数据才能使用。
用来解码的工具就是解码器了，不过通常编码器和解码器是一块的，统称为编解码器codec；

5. 渲染与展示。		接收到原始数据文件之后，就可以通过硬件或者软件进行渲染与展示了，硬件例如显示器、音响等，软件有SurfaceView；

6. 文件封装 / 解封装。	在传输前将音频数据和视频数据合在一起，称为文件封装。存放音视频的容器叫封装容器，文件类型叫封装格式；

7. 网络协议打包。		音视频文件在网络中传输的时候，一般都会有一个特定的协议，也就是流媒体协议。
流媒体协议会将音视频数据文件打包成协议包，通过网络协议端口发送出去，接收方接收到网络包之后，要通过网络协议解开协议包，才能获得音视频数据文件。


	数据（解协议）						协议层：http, rtmp, file...
	||
	封装格式数据（解封装）				封装格式层：mkv, mp4, flv, avi, mp3...
	||
	音 / 视频码流数据（解码）			编解码层：h264, h265, mpeg2, aac...
	||
	音频采样数据 / 视频像素数据			像素层：yuv420p, yuv422p, rgb24, pcm...



/*************************/视频帧/***************************************************************************/
视频帧就是视频的一张图片
1. I帧（帧内编码帧）即关键帧，记录了一个完整的图像，可以被直接解码显示，两个I帧中间的一组帧称之为一个GOP。
2. P帧（帧间预测编码帧），不记录画面，记录的是本帧与前一帧的差异，压缩比有20左右。P帧不能直接解码，需要先解码前序的 I帧 或 B帧，来生成一张完整的图片。
3. B帧（双向预测编码帧）是记录了本帧与前一个I / P帧和后一个I / P帧的差异，压缩比有50左右。需要参考其前一个 I帧 或 P帧 及其后面的一个 P帧 来生成一张完整的图片。
在直播中，基本上不会出现B帧，因为B帧是需要解析了前后两个帧之后做对比产生的，如果使用B帧，会因为大量解析的时间增加不少延迟
4. 剩下的还有SI和SP帧，这俩是用于切换码流使用，一般不常见。

GOP（group of picture）：是画面组，就是一个I帧与下一个I帧之间的帧组合。
GOP 一般有两个数字，如 M = 3，N = 12，M 制定 I 帧与 P 帧之间的距离，N 指定两个 I 帧之间的距离。那么现在的 GOP 结构是	I BBP BBP BBP BB I
GOP越长：使用数据量越小，解析时间越长。

IDR：一个序列的第一帧叫做 IDR帧（Instantaneous Decoding Refresh，立即解码刷新），本质上是一个I帧。


//DTS与PTS
DTS（Decode Time Stamp）：解码时间戳。DTS主要是标识内存中的bit流什么时候开始送入解码器进行解码。
PTS（Presentation Time Stamp）：显示时间戳。PTS主要用于度量解码后的视频什么时候被显示出来。


//视频清晰度
视频清晰度：一个视频的画质与视频的码率、分辨率、压缩比、帧率、GOP长度有关。只有他们达到了最佳平衡，才能呈现最佳的画质。
分辨率越高->数据越大->需要的码率越高，如果码率不足则视频会卡顿
码率不足->提高压缩比->数据量减小->分辨率减小



/*************************/流媒体协议/***************************************************************************/
//流媒体传输协议
1. RTP（Real - time Transport Protocol 实时传输协议）			：基于UDP，定义简单且性能好，但是需要额外的信令协议。
2. RTCP（Real - time Transport Control Protocol 实时传输控制协议）：基于UDP，为RTP媒体流提供信道外控制。RTCP本身并不传输数据，但和RTP一起协作将多媒体数据打包和发送。
3. RTMP（Real Time Messaging Protocol 实时消息传送协议）	：基于TCP，性价比高，是目前直播推流的标准使用协议
4. RTSP（Real Time Streaming Protocol   实时流传输协议）		：基于TCP，HTTP与RTSP相比，HTTP传送HTML，而RTSP传送的是多媒体数据。
RTSP不会发送媒体数据，只完成服务器和客户端之间的信令交互，RTP协议负责媒体数据传输，RTCP负责RTP数据包的监视和反馈。
RTP和RTCP没有规定传输层的类型，可用选择TCP或UDP，RTSP的传输层则是要求基于TCP。

//流媒体应用协议
1. HTTP - FLV：基于TCP，使用HTTP传输FLV流，分发性能强，适用于CDN分发；
2. HLS（HTTP Live Streaming http直播流）					：基于TCP七层协议，被HTML5写入标准支持，延时大，但是兼容H5；
3. CDN：CDN架构设计比较复杂。包含源站、缓存服务器、智能DNS、客户端等几个主要组成部分。

//WebRTC信令协议
WebRTC信令协议有：SDP、ICE、NAT、STUN、TURN。当然，WebRTC的网络传输协议也有用到上面提及的流媒体传输协议。
信令：用来通信连接的两侧做状态同步使用。



/*************************/网络抖动/***************************************************************************/
网络传输的指标：
1. 丢包率：(本端接收到的数据包 / 对端发送的数据包) * 100 % ；
2. 延时：对端接收时间T1 - 本端发送数据时间T0，一般用RTT来评估延时，即往返延时，本端发送数据，到对端接收数据并确认接收的耗时；
3. 带宽：网口允许收发数据量的大小，单位bps，发送速率：实际收发的数据量的大小，单位bps。带宽可以理解成最大发送速率；

网络抖动就是实际发（收）的数据没有发（收），判断是否抖动就是看丢包率是否增加、 RTT是否增加、发送速率是否降低。


JitterBuffer就是为了减少网络抖动给音视频传输带来的影响而产生的，jitterBuffer是传输过程中的一个缓冲区，连接着解码器和网络协议栈。
JitterBuffer会有一的延迟音视频传输时间，将数据先缓存在缓冲区中，并且也会将之前缓存的数据发送到接收端，
我就把他理解成我们在网上看电视的时候的视频缓存，这样的话，即使出现了偶尔的网络抖动，也不会影响到用户的体验。

JitterBuffer带来的好处就是：
1. 降低了网络轻微抖动打来的卡顿；
2. 平衡编解码器和网络协议栈的数据供求量；
3. 动态调整数据的收发量，在一定范围内控制数据收发平衡性。



/*************************/弱网优化/***************************************************************************/
弱网优化的策略包括如下：

1. 播放器Buffer
2. 丢帧策略(优先丢P帧，其次I帧，最后音频)
3. 自适应码率算法
4. 双向链路优化
5. 音频FEC冗余算法(20 % 丢包率）



/*************************/音视频开源库/***************************************************************************/
1、多媒体处理
多媒体处理包括：FFmpeg、libav、Gstreamer。其中FFmpeg是目前最常用的音视频处理库，包括封装格式、编解码、滤镜、图像缩放、音频重采样等模块。

2、流媒体传输
流媒体传输包括WebRTC、live555。其中WebRTC是目前最常用的RTC库，比较著名的模块有JitterBuffer、NetEQ、pacer、网络带宽估计。

3、播放器
播放器包括：ijkplayer、exoplayer、vlc。其中ijkplayer是B站开源的跨平台播放器，exoplayer是Google开源的Android平台播放器，vlc属于VideoLAN非盈利组织所开源。

4、编解码
常用的编解码包括：aac、mp3、opus、vp9、x264、av1。其中aac一般用于点播、短视频，opus用于RTC直播。vp9是Google开源的编码器，VideoLAN有提供x264编码器，av1是AOMedia(开放媒体联盟)开源的新一代视频编码器。

5、音频处理
音频处理的开源库包括：sox、soundtouch、speex。其中sox称为音频处理界的瑞士军刀，可以做各种音效、提供各种滤波器。soundtouch用于变速变调、变速不变调。speex严格意义上讲，它是一个编码器，但是它有丰富的音频处理模块：PLC(丢包隐藏)、VAD(静音检测)、DTX(非连续传输)、AEC(回声消除)、NS(噪声抑制)。

6、流媒体服务器
流媒体服务器主流的有：SRS、janus。其中SRS是一款简单高效的视频服务器，支持RTMP、WebRTC、HLS、HTTP - FLV、SRT。而janus是MeetEcho公司开源的基于WebRTC的流媒体服务器，严格意义上讲它是一个网关。

7、音视频分析
做音视频开发绕不开分析工具，掌握使用分析工具至关重要。常用的音视频分析工具包括但不限于：Mp4Parser、VideoEye、Audacity。其中Mp4Parser用于分析mp4格式及其结构。VideoEye是雷神开源的基于Windows平台分析视频码流工具(在此致敬雷神的开源精神)。Audacity是一款开源的音频编辑器，可用于添加各种音效、分析音频波形图。

8、视频渲染
视频渲染相关开源库有：GPUImage、Grafika、LearnOpenGL。其中GPUImage可用于添加各种滤镜特效。Grafika是Google一位工程师开源的基于Android平台渲染示例库。LearnOpenGL主要是配套其网站的学习OpenGL教程。








MPEG（Moving Picture Experts Group），即动态图像专家组，主要用于视频压缩。
JPEG（Joint Photographic Experts Group），即联合图像专家组，是一种用于连续色调静止图像的压缩标准。

