/********************/作用域运算符/************************************************************/
作用域运算符（::）：优先级最高的运算符，用于指定变量或函数，可以避免重名。

类作用域符号			//类名::类成员。用于区分不同类中的同名成员。或是访问类的静态成员。
命名空间作用域符号	//命名空间::成员名。指定成员所属的命名空间，从而避免命名冲突。



/********************/句柄/************************************************************/
句柄（Handle）是一种代表资源对象的标识符。每个句柄都指向一个资源对象，例如线程、进程、文件、窗口、事件等。
句柄可以被用来访问和操作资源对象，例如读取文件、发送消息给窗口、等待线程结束等等。

例如：文件描述符、网络套接字、各种对象指针...



/********************/缓冲区/************************************************************/
缓冲区(Buffer)就是在内存中预留指定大小的存储空间用来对输入输出(IO)的数据作临时存储，这部分预留的内存空间就叫做缓冲区。

// I/O缓冲区大小
一般为512字节，定义在stdio.h中
#define BUFSIZ  512

//刷新缓冲区条件
无缓冲：立即生效，不经过缓冲区
行缓冲：换行符（\n）、调用std::endl或flush()、缓冲区满、程序正常结束（关闭流）
全缓冲：调用flush()、缓冲区满、程序正常结束（关闭流）



/********************/输入输出流/************************************************************/
#include <iostream>

//流对象
std::cin	标准输入				行缓冲				从键盘读取用户输入			//输入到stdin
std::cout	标准输出				行缓冲 / 全缓冲		向终端输出一般消息			//输出到stdout
std::endl	换行并刷新缓冲区		强制刷新				结束一行输出并立即显示
std::cerr	标准错误				无缓冲				输出错误信息，立即显示		//输出到stderr
std::clog	标准错误				全缓冲				输出日志或调试信息			//输出到stderr


流对象的优势：能够自动识别不同的数据类型，如下
int a;
double f;
string s;

//一次性输出多种不同类型的数据
std::cout << 100 << 3.14 << "abcd" << std::endl;		//标准输出流（endl用于在行末添加一个换行符：end line）
//一次性输入多种不同类型的数据
std::cin >> a >> f >> s;								//标准输入流




