/********************/作用域运算符/************************************************************/
作用域运算符（::）：它是运算符中等级最高的，用于指定变量或函数，可以避免重名。

全局作用域符号：	  当全局变量在局部函数中与其中某个变量重名，那么就可以用::来区分。
类作用域符号：		  它的前面一般是类名称，后面一般是该类的成员名称，C++为了避免不同的类有名称相同的成员而采用作用域的方式进行区分。
命名空间作用域符号：是作用域限定符或者称作用域运算符或者作用域操作符（scope operator），例如命名空间



/********************/输入输出流/************************************************************/
#include <iostream>

std::cin      标准输入, 可以自动识别是输入的数据类型。
std::cout    标准输出，类似printf
std::endl    换行


使用流对象的优势在于，不需要关心操作数据的类型，流对象会自动识别不同的数据类型，也可以一次性快速处理，如下：
int a;
double f;
string s;

//一次性输出多种不同类型的数据
std::cout << 100 << 3.14 << "abcd" << std::endl;		//标准输出流（endl用于在行末添加一个换行符：end line）
//一次性输入多种不同类型的数据
std::cin >> a >> f >> s;							//标准输入流

cerr的用法与cout是一样的，区别是cerr输出的时候不经过缓冲区直接输出，而cout需要经过行缓冲区。


//句柄
句柄（Handle）是一种代表资源对象的标识符。每个句柄都指向一个资源对象，例如线程、进程、文件、窗口、事件等。
句柄可以被用来访问和操作资源对象，例如读取文件、发送消息给窗口、等待线程结束等等。

例如：文件描述符、网络套接字、各种对象指针...

