/********************/作用域运算符/************************************************************/
作用域运算符（::）：它是运算符中等级最高的，用于指定变量或函数，可以避免重名。

全局作用域符号：	  当全局变量在局部函数中与其中某个变量重名，那么就可以用::来区分。
类作用域符号：	  类名::类成员。C++中用于区分不同类中的同名成员。
命名空间作用域符号：命名空间::成员名。指定成员所属的命名空间，从而避免命名冲突。



/********************/句柄/************************************************************/
句柄（Handle）是一种代表资源对象的标识符。每个句柄都指向一个资源对象，例如线程、进程、文件、窗口、事件等。
句柄可以被用来访问和操作资源对象，例如读取文件、发送消息给窗口、等待线程结束等等。

例如：文件描述符、网络套接字、各种对象指针...



/********************/缓冲区/************************************************************/
缓冲区(Buffer)就是在内存中预留指定大小的存储空间用来对输入 / 输出(I / O)的数据作临时存储，这部分预留的内存空间就叫做缓冲区。

//全缓冲区
在填满I / O缓冲区后再进行实际的I / O操作。对于驻留在磁盘上的文件通常由标准I / O库实施全缓冲。
调用fflush函数冲洗一个流。冲洗意味着将缓冲区的内容写到磁盘上。

//行缓冲
当在输入和输出遇到换行符(\n)时，将缓冲区中的数据刷新到目标设备。

//无缓冲
标准I / O不对字符进行缓冲处理



/********************/输入输出流/************************************************************/
#include <iostream>

std::cin      标准输入, 可以自动识别是输入的数据类型。
std::cout    标准输出，类似printf
std::endl    换行


使用流对象的优势在于，不需要关心操作数据的类型，流对象会自动识别不同的数据类型，也可以一次性快速处理，如下：
int a;
double f;
string s;

//一次性输出多种不同类型的数据
std::cout << 100 << 3.14 << "abcd" << std::endl;		//标准输出流（endl用于在行末添加一个换行符：end line）
//一次性输入多种不同类型的数据
std::cin >> a >> f >> s;							//标准输入流

cerr的用法与cout是一样的，区别是cerr输出的时候不经过缓冲区直接输出，而cout需要经过行缓冲区。



