/******************************/YUV与RGB/******************************************************************************************/
YUV：将亮度信息（Y）与色彩信息（UV）分离，没有UV信息一样可以显示完整的图像，只不过是黑白的，这样的设计很好地解决了彩色电视机与黑白电视的兼容问题。

YUV格式：
打包（Packeted）格式：将每个像素点的Y、U、V分量交叉排列并以像素点为单元连续地存放在同一数组中，通常几个相邻的像素组成一个宏像素（macro-pixel）。
平面（planar）格式：使用三个数组分开连续地存放Y、U、V三个分量，即Y、U、V分别存放在各自的数组中。

YUV采样表示法：
YUV444：表示色度频道没有下采样，即一个分量对应着一个U分量和一个V分量
YUV422：表示2:1的水平下采样，没有垂直下采样，即每两个Y分量共用一个U分量和一个V分量
YUV420：表示2:1的水平下采样，2:1的垂直下采样，即每四个Y分量共用一个U分量和一个V分量



//RGB和YUV转换公式
1. BT.601标准[1]——标清数字电视（SDTV)				Y = 0.299R + 0.587G + 0.114B
2. BT.709标准[2]——高清数字电视（HDTV)				Y = 0.2126R + 0.7152G + 0.0722B
3. BT.2020标准[3]——超高清数字电视（UHDTV)			Y = 0.2627R + 0.6780G + 0.0593B

BT601标准：
8bit位深情况下
*TV range是16-235(Y)、16-240(UV)，也叫Limited Range
*PC range是0-255，也叫Full Range
*而RGB没有range之分，全是0-255

BT601 TV range转换公式
YUV(256级别)可以从8位RGB直接计算：
Y = 0.299*R + 0.587*G + 0.114*B
U = -0.169*R - 0.331*G + 0.5*B 
V = 0.5*R - 0.419*G - 0.081*B

反过来，RGB也可以直接从YUV(256级别)计算：
R = Y + 1.402(Y-128)
G = Y - 0.34414(U-128) - 0.71414(U-128)
B = Y + 1772(V-128)

YUV->RGB时，如果值小于0取0，大于255取255。


【问题】YUV->RGB为什么解码出错显示绿屏？
因为解码失败时YUV分量都填为0值，然后根据公式：
R = 1.402 *(-128) = -126.598
G = -0.34414*(-128)-0.71414*(-128)=44.04992+91.40992=135.45984
B = 1.772*(-128)=-126.228

RGB值范围为[0, 255]，所以最终的值为：
R = 0
G = 135.45984
B = 0
此时只有G分量有值所以为绿色。





