/********************/命名空间/************************************************************/

调用方法：

（1）命名空间名称 :: 空间中的成员
std::cout << "hello" << std::endl;

（2） using namespace + 命名空间名称
----在当前.cpp文件中，使用命名空间的成员不再需要名称和作用域符号
----在当前.cpp文件中，不要再出现同名的成员
cout << "hello" << endl;


/********************/自定义命名空间/************************************************************/
namespace 空间名称 {
    成员变量
    成员函数
};

注意事项:
(1)命名空间在全局声明时，一定要注意不可有同名变量或函数同时被全局声明，否则调用会产生歧义。
(2)如果有全局函数或者全局变量与命名空间中的变量函数重名，那么可以通过 :: + 变量名/函数名 来调用。


/********************/匿名空间/************************************************************/
匿名空间：匿名空间中的所有成员相当于 static 修饰的全局变量和函数，成为静态数据不能被其它文件所调用。 static 不能修饰 class 类。

namespace {
    成员变量
    成员函数
}

编译器会编译成 namespace __UNION_NAME__ {}
                using namespace __UNION_NAME__;
编译器会为匿名空间加上名称并做全局声明。
如果同时定义了多个匿名空间，编译器会将他们集合在一起，再声明__UNION_NAME__。


/********************/不连续的命名空间/************************************************************/


命名空间可以定义在几个不同的部分中，一个命名空间的各个组成部分可以分散在多个文件中。

所以，如果命名空间中的某个组成部分需要请求定义在另一个文件中的名称，则仍然需要声明该名称。
下面的命名空间定义可以是定义一个新的命名空间，也可以是为已有的命名空间增加新的元素：
namespace namespace_name {
    // 代码声明
}


/********************/嵌套的命名空间/************************************************************/
namespace Space1 {
    // 代码声明
    namespace Space2 {
        // 代码声明
    }
}

如上所示，命名空间可以嵌套，您可以在一个命名空间中定义另一个命名空间。
您可以通过使用::运算符来访问嵌套的命名空间中的成员：

// 访问 Space2 中的成员
using namespace Space1::Space2;

// 访问 Space1 中的成员
using namespace Space1;

在上面的语句中，如果使用的是 Space1，那么在该范围内 Space2 中的元素也是可用的。



/********************/命名空间实例/************************************************************/
#include <iostream>
using namespace std;               //声明全局的命名空间---扩展std命名空间的作用域为当前.cpp文件

// 第一个命名空间
namespace Space1 
{
    void func() 
    {
        std::cout << "Space1" << std::endl;
    }
}

// 第二个命名空间
namespace Space2 
{
    void func() 
    {
        std::cout << "Space2" << std::endl;
    }
}

int main()
{
    cout << "helloworld" << endl;

    Space1::func();            // 调用第一个命名空间中的函数

    Space2::func();           // 调用第二个命名空间中的函数

    return 0;
}



/********************/匿名空间实例/************************************************************/
#include <iostream>

using namespace std;

//匿名空间中的成员相当于被static修饰过的全局变量与函数
//匿名空间中的成员仅限当前模块中调用
namespace {
    int num;
    void func() {
        cout << "func()  num=" << num << endl;
    }
}

int main()
{
    num = 100;          //无需声明作用域可直接调用
    func();             //无需声明作用域可直接调用

}