/******************************/PCM/******************************************************************************************/
PCM(Pulse Code Modulation，脉冲编码调制)音频数据是未经压缩的音频采样数据裸流，它是由模拟信号经过采样、量化、编码转换成的标准数字音频数据
单独的PCM编码文件是不能直接播放的，这种文件通常称为PCM裸流。PCM裸流经过封装后，就可以正常播放了。

常见的无损音频格式有WAV、FLAC和APE。且FLAC和APE是WAV的编码压缩格式。


描述PCM数据的6个参数：
Sample Rate				采样频率。8kHz(电话)、44.1kHz(CD)、48kHz(DVD)。
Sample Size				量化位数。通常该值为16 - bit。
Number of Channels		通道个数。常见的音频有立体声(stereo)和单声道(mono)两种类型，立体声包含左声道和右声道。另外还有环绕立体声等其它不太常用的类型。
Sign						表示样本数据是否是有符号位，比如用一字节表示的样本数据，有符号的话表示范围为 - 128 ~127，无符号是0 ~255。
Byte Ordering				字节序。字节序是little - endian还是big - endian。通常均为little - endian。字节序说明见第4节。
Integer Or Floating Point	整形或浮点型。大多数格式的PCM样本数据使用整形表示，而在一些对精度要求高的应用方面，使用浮点类型表示PCM样本数据。


最常见的WAV格式文是在PCM裸流的基础上加上44字节的文件头构成的，此时PCM的采样率是8KHz，量化位数是16位，当采用8位的量化位数时，文件头的长度可以达到58位。比如说Windows下自带的那个录音机录下的WAV，文件头有58个字节。


/******************************/音频帧/******************************************************************************************/
帧可以指每帧采样数播放的时间，mp3 48k，1152个采样点，每帧为24ms；aac则每帧为1024个采样点。攒够一帧数据才送去做编码。
帧也可以指压缩后每帧的数据长度。

每帧持续时间（秒） = 每帧采样点数 / 采样频率（HZ）


交错模式：数字音频信号的存储方式。数据以连续帧的方式存放，即首先记录帧1的左声道样本和右声道样本，再开始帧2的记录。
非交错模式：首先记录的是一个周期内所有帧的左声道样本，再记录所有右声道样本。






