/********************/堆空间/************************************************************/
C++ 程序中的内存分为两个部分：

栈：在函数内部声明的所有变量都将占用栈内存。
堆：这是程序中未使用的内存，在程序运行时可用于动态分配内存。

分配堆空间： new 作用相当于 malloc()。 new 不只是分配了内存，它还创建了对象，并调用构造函数。
释放堆空间： delete 作用相当于 free()。 delete 会调用析构函数。

new  数据类型		------申请单个数据类型大小的堆空间，具体堆空间大小由系统根据类型来申请
new  数据类型[N]	------申请N个数据类型大小的堆空间，如果有带参构造函数则可以 new 数据类型[N]{{arg, arg},{arg, arg}...} 方式传入参数。
new  数据类型(data)	------申请单个数据类型大小的堆空间并传递参数(若数据类型为类类型，则参数传递给它的构造函数)

delete  指针(堆空间首地址)	----- 释放单个数据类型的堆空间内存
delete[]  指针				----- 释放N个数据类型的堆空间内存，释放大小可由系统自行确定


区别 :
(1)malloc和free都是函数, new 和 delete 是关键字
(2)malloc返回值为void*, new 会根据数据类型来确定返回值。
(3)malloc和free不会调用类的构造与析构， new 会调用构造, delete 会调用析构。

C++中函数返回值为指针时，不会发生隐式类型转换。


/********************/实例/************************************************************/
#include <iostream>
#include <cstdlib>

using namespace std;


void func1()
{
	int* p1 = new int;				//申请一个int类型大小的堆空间
	*p1 = 10;						//为这个堆空间赋值
	cout << "*p1=" << *p1 << endl;
	delete p1;					//释放堆空间
}


void func2()
{
	int* p2 = new int[3];			//申请 3个 int类型的堆空间

	for (int i = 0; i < 3; i++)
		*(p2 + i) = i * 1;

	for (int i = 0; i < 3; i++)
		cout << "p2[" << i << "]=" << p2[i] << endl;

	delete[]p2;					//释放从指针p开始的堆空间数组，大小由系统自行识别
}


void func3()
{
	int* p3 = new int(99);		//申请1个int型堆空间，同时对该int型进行赋值
	cout << "*p3=" << *p3 << endl;
	delete p3;
}


void func4()
{
	//int *p = malloc(100);		//报错，c++中函数返回值没有隐式类型转换
	int* p4 = (int*)malloc(4);
	free(p4);

	char* p5 = new char('A');
	delete p5;
}


int main()
{
	func1();
	func2();
	func3();
	func4();
}