/********************/引用/************************************************************/

作用: 给变量起别名
语法: 数据类型 & 别名 = 原名

例如:
	int a = 10;
	int& b = a;				//从此之后，b是变量a的别名，a和b代表同一块内存。
	int& c = b;				//c表示对b所指变量的引用，而非对b的引用，bc都是a的别名，abc代表同一个int大小的内存。
	const int& d = 100;		//对常量取引用时，需要加上const关键字进行修饰


//引用作为函数参数
	指针作参数：传入地址，函数中创建指针指向此地址
	引用作参数：传入变量，函数中直接使用此变量的别名

//引用作函数返回值：
引用作为函数返回值时，返回的是一个变量，因此函数可以作为左值运算。
但由于函数结束是会释放栈空间，因此要求返回的变量内存不会在函数结束时释放：静态变量, 全局变量, 堆空间变量


//特点
（1）& 符号的前面如果有数据类型，则表示引用；如果没有数据类型，则是取址符。
（2）引用本质是指针常量，不可改变其指向，但可以改变指向的内容。
（3）引用传参属于地址传递，不申请新的内存空间，避免了数据的拷贝操作，提高运行效率。
（4）引用是给变量起别名，C++特有。而 typedef 是给数据类型起别名。
（5）引用定义时必须初始化，例如 int& r; 是错误的。同一个变量允许多个引用。初始化完成后不会再改变指向的内存空间。


//引用与指针的区别
1、引用定义时必须初始化，指针则不需要;	
2、引用不能改变指向，指针可以改变指向；
3、引用不占用内存空间，指针占用内存空间；
4、引用效率更高(直接操作地址)，指针是间接操作内存地址；
5、引用更安全，指针更灵活。



/********************/引用作返回值实例/************************************************************/
#include <iostream>
using namespace std;

int& function(void)
{
	static int a = 30;
	cout << "a=" << a << endl;

	return a;
}

int main(void)
{
	function() = 20;				//输出a=30
	function();					//输出a=20（静态变量只能被初始化一次）
}


