/********************/引用/************************************************************/

引用的作用 : 给变量起别名
语法 : 数据类型 & 别名 = 原名

例如 :
	int a = 10;
	int& b = a;		从此之后，b是变量a的别名，a和b代表同一块内存。
	int& c = b;		c表示对b所指变量的引用，而非对b的引用，bc都是a的别名，abc代表同一个int大小的内存。

在C语言中， typedef 是给数据类型起别名。而引用就是给变量起别名，C++特有。
本质：引用的本质在C++内部实现就是一个指针常量，不可以改变指向，但是可以改变该地址当中的数据。

其它用法：
（1）引用作为函数参数
	指针作参数：传入地址，函数中创建指针指向此地址
	引用作参数：传入变量，函数中直接使用此变量的别名
（2）引用作函数返回值：引用作为函数返回值时，返回的是一个变量，因此函数可以作为左值运算。
					   但由于函数结束是会释放栈空间，因此要求返回的变量内存不会在函数结束时释放：静态变量, 全局变量, 堆空间变量


引用的特点及注意事项：
（1）引用必须是指向一段内存，不可对常量取引用，例如 int& r = 100; 是错误的，因为引用的本质是取别名，而常量是匿名的。
（2）引用定义时必须初始化，初始完成后不会再改变指向的内存空间。不可单独定义引用，例如 int& r; 是错误的。同一个变量允许多个引用。
（3）在引用常量时，需要加上const关键字进行修饰，例如 const int& a = 12。不可以对常量进行修改，只有读权限，并没有写权限.
（4）&符号的前面如果有数据类型，则表示引用；如果没有数据类型，则是取址符。
（5）引用本质上，是内核空间中，被const修饰的指针。但该指针在应用层不可直接调用，只能够以引用的形式表现出来。
（6）引用传参时，可以不申请新的内存空间，提高运行效率（引用不占内存空间）。


引用与指针的区别

1.引用在定义时必须初始化，指针则不需要;	
2.引用初始化之后不能引用其他空间，指针可以指向其他的空间；
3.引用不占用内存空间，指针占用内存空间；
4.引用效率更高(直接操作地址)，指针是间接操作内存地址；
5.引用更加安全，指针可以进行偏移；
6.指针相对于引用而言，更加灵活，指针更通用于C语言与C++；



/********************/引用实例/************************************************************/
#include <iostream>

using namespace std;


void func(int& n) 
{
	cout << n << endl;
}

int main(void)
{
	int a = 10;
	cout << "a=" << a << endl;		//输出a=10

	int& b = a;
	cout << "b=" << b << endl;
	
	b = 20;
	cout << "a=" << a << endl;		//输出a=20

	const int& c = 30;				//对常量30的引用需要加上const修饰
	//c = 40;						//错误，无法改变常量的值
	cout << "c=" << c << endl;
	b = c;
	cout << "a=" << a << endl;		//输出a=30


	//func(100);					//错误，因为100是数值，而int& n初始化是要有内存的，需要传入变量。
	func(a);
}



/********************/引用作参数和返回值实例/************************************************************/
#include <iostream>

using namespace std;


void func(int& n)
{
	cout << n << endl;
}

int& function(void)
{
	static int b = 30;
	cout << "b=" << b << endl;

	return b;
}

int main(void)
{
	int a = 10;
	cout << "a=" << a << endl;		//输出a=10


	//func(100);					//错误，因为100是数值，而int& n初始化是要有内存的，需要传入变量。
	func(a);

	function() = 20;				//输出b=30
	function();						//输出b=20（静态变量只能被初始化一次）
}



/********************/三种传递方式实例/************************************************************/
#include <iostream>

using namespace std;

//值传递-----值传递不会影响到实参
void swap1(int a, int b)
{
	//a = a^b;
	//b = a^b;
	//a = a^b;

	int temp = a;
	a = b;
	b = temp;
}

//地址传递----地址传递会影响到实参
void swap2(int* a, int* b)
{
	int temp = *a;
	*a = *b;
	*b = temp;
}

//引用传递----会影响到实参
void swap3(int& a, int& b)
{
	int temp = a;
	a = b;
	b = temp;
}

int main()
{
	int x = 100;
	int y = 999;

	//swap1(x,y);
	//swap2(&x,&y);
	swap3(x, y);
	cout << "x=" << x << "  y=" << y << endl;
}


