/********************/重载/************************************************************/
C++ 允许在同一作用域中的某个函数和运算符指定多个定义，分别称为函数重载和运算符重载。


重载声明：指一个与之前已经在该作用域内声明过的函数或方法具有相同名称的声明，但是它们的参数列表和定义（实现）不相同。

当您调用一个重载函数或重载运算符时，编译器通过把您所使用的参数类型与定义中的参数类型进行比较，决定选用最合适的定义。
选择最合适的重载函数或重载运算符的过程，称为重载决策。


/********************/函数重载/************************************************************/
函数重载：在同一个作用域下，函数名相同，参数类型、参数个数、参数顺序任意一个不同的函数。

返回值不能够作为重载条件。

函数重载要求在同一个作用域下调用函数，有且仅有一个符合条件，如果有多个符合条件，则发生歧义。

注意事项：
引用不发生重载，而是作为函数调用时的判断条件（类似占位参数）。

实例：
void func(int) { ; }        //定义一个函数
void func(int&) { ; }       //错误，引用不发生重载
int  func(int) { ; }        //错误，返回值不能作为重载条件



/********************/实例/************************************************************/

#include <iostream>

using namespace std;


class printData
{
public:
    void print(int i) {
        cout << "整数为: " << i << endl;
    }

    void print(int i, int j) {
        cout << "整数一为: " << i << "整数二为: " << j << endl;
    }

    void print(char c[]) {
        cout << "字符串为: " << c << endl;
    }

};

int main(void)
{
    printData pd;

    // 输出一个整数
    pd.print(5);
    // 输出两个整数
    pd.print(1, 2);
    // 输出一个字符串
    char c[] = "Hello C++";
    pd.print(c);


    return 0;
}

