/********************/默认参数/************************************************************/

在C++中，函数的形参列表中的形参是可以默认有值的，当调用函数且该参数位置没有传参时，会使用默认数值来参与运算。
* 连续性：如果某个位置参数有默认值, 那么此参数之后的参数，也必须都要有默认值（或者说默认参数从右向左连续）。
* 定义与声明：如果函数声明有默认值，那么函数定义时就不能有默认参数。
* 重载函数：默认参数添加以后，不能有相同的重载函数，否则会发生歧义。



/********************/占位参数/************************************************************/
函数中允许占位参数存在

占位参数：只有类型名, 没有变量名，用于重载，不参与运算。

好处：兼容老版本的C++, 在运算符重载时分辨前缀++/--和后缀++/--

占位参数同样可以赋默认数值，同样可以作为函数重载和运算符重载的条件。



/********************/默认参数实例/************************************************************/
#include <iostream>

using namespace std;


int func(int a, int b = 100, int c = 200)	//默认参数从右往左连续
{
	return a + b + c;
}

int main(void)
{
	int sum = func(10, 20);				//传参a=10，b=20，c使用默认参数200
	cout << "sum=" << sum << endl;		//输出sum=230
}



/********************/占位参数实例/************************************************************/
#include <iostream>

using namespace std;


void func(int a, int)
{
	cout << "void func(int a,int)" << endl;
}

void func(int a, char)
{
	cout << "void func(int a,char)" << endl;
}

int main()
{
	func(100, 200);
	func(100, 'a');
}
