/********************/类与对象/************************************************************/

内容：
1.类与对象
2.标签语句
3.类的体积
4.类访问修饰符



类与对象：
具有相同属性的对象，我们可以抽象称之为类，人属于人类，车属于车类。
在C++中，把一切事物都看成是对象。对象是类的实例化。类是把具有相同属性和方法的数据集合在一起，是一个抽象化的概念。
把类看成是自定义的数据类型。对象就是这个自定义数据类型的变量。
方法：类中的函数称为方法。



标签语句：
格式：标识符 + 冒号

使用 goto + 标签 就可以跳到标签处执行。
case 就是一种标签,case 关键字和它对应的值一起，称为 case 标签。
类中的 public 、 private 、 protected 也是标签，称为成员访问标签。



类的体积：
(1)类的体积运算与结构体相同，根据当前最大的成员属性进行字节对齐。
(2)类的函数不占类的体积，类的函数存在于代码段中。
(3)类中没有任何成员属性，那么该类的体积为1字节。这个1字节是系统补上去的，没有任何意义。
   是为了在创建对象以后，给这个对象一个标识，防止此处内存被申请。


/********************/类访问修饰符/************************************************************/

一个类可以有多个类访问修饰符 public 、 protected 或 private 来标记区域

默认情况下，类中的所有成员都是不对外开放的，类外无法访问（赋值、调用等）。对外开放必须在封装时设置为 public 。

    public:     公有权限----对外开放
    protected:  保护权限----不对外开放, 对继承的派生类开放
    private:    私有权限----不对外开放, 也不对继承的派生类开放

    实际操作中，我们一般会在私有区域定义数据，在公有区域定义相关的函数，以便在类的外部也可以调用这些函数。

    对象调用成员与结构体变量相同，如果是成员变量，则使用".", 如果是成员指针，则使用"->"。
    类与对象的关系和操作方式，与结构体和结构体变量的关系相似，操作方法也是一样。


    练习 : 假设有一个圆柱体的类，成员属性有圆心和半径和高度，成员方法有求面积，求体积。请设计出这样的类。


