/********************/类与对象/************************************************************/

面向对象：面向对象是种编程思想，把一切东西看成一个对象，这个对象拥有自己的属性，和操作这些属性变量的函数，我们把这些包装成一个类(class)。


//面向对象和面向过程
面向过程（Procedural Programming）				强调“以函数为中心”，一步一步操作数据，以过程（函数调用）来驱动程序。
面向对象（Object - Oriented Programming, OOP）	强调“以对象为中心”，封装数据和操作，模拟现实世界事物，通过对象之间交互完成任务。


//标签语句
使用 goto + 标签 就可以跳到标签处执行。
case 就是一种标签,case 关键字和它对应的值一起，称为 case 标签。
类中的 public 、 private 、 protected 也是标签，称为成员访问标签。


//类的体积
（1）类的体积运算与结构体相同，根据当前最大的成员属性进行字节对齐。
（2）类的函数不占类的体积，存在于代码段中。
（3）类中没有任何成员属性，那么该类的体积为1字节。这个1字节是系统补上去的，没有任何意义。
	是为了在创建对象以后，给这个对象一个标识，防止此处内存被申请。



/********************/类访问修饰符/************************************************************/

一个类可以有多个类访问修饰符 public 、 protected 或 private 来标记区域

默认情况下，类中的所有成员都是不对外开放的，类外无法访问（赋值、调用等）。对外开放必须在封装时设置为 public 。

    public:     公有权限----对外开放
    protected:  保护权限----不对外开放, 对继承的派生类开放
    private:    私有权限----不对外开放, 也不对继承的派生类开放

    实际操作中，我们一般会在私有区域定义数据，在公有区域定义相关的函数，以便在类的外部也可以调用这些函数。



/********************/封装与抽象/************************************************************/
C++ 三大特性 : 封装，继承，多态

封装：对象的属性和实现细节被隐藏，只对外公开接口，控制对属性读取和修改的访问级别。它有助于提高代码的可重用性、可维护性和安全性。

数据封装：封装是把“属性 + 方法”装进一个类里，并保护它们不被滥用。
数据抽象：抽象是隐藏复杂实现，只暴露必要功能接口。


//定义类，若不指定权限，则默认为private
class 类名
{
访问权限:
	成员属性
	成员方法
};

//定义对象
类名 + 对象名



/********************/实例/************************************************************/
#include <iostream>

using namespace std;


//创建人的类
class Person
{
public:
	int height;			//身高

	void setage(int _age)	//在类的里面称为方法，在类外称为函数
	{
		age = _age;
	}
	void show() {
		eating();
		running();
	}

protected:
	int age;	//年龄

	void eating() {
		cout << "吃饭" << endl;
	}

private:
	void running() {
		cout << "跑步" << endl;
	}
};

int main()
{
	Person jack;			//创建实体对象

	jack.height = 170;
	//jack.age = 18;		//受到保护，无法赋值
	jack.setage(18);

	//jack.eating();			//受到保护，无法调用
	jack.show();



	Person* rose = new Person();	

	rose->height = 160;
	rose->setage(14);		//通过类的公有函数对类的私有成员进行操作
	rose->show();
}



