/********************/参数列表初始化/************************************************************/

参数列表初始化：在类的构造函数调用之前，初始化成员属性。

//语法规则
构造函数(参数列表) : 成员属性1(表达式1), 成员属性2(表达式2) ...	
{

}

*成员属性可以换成父类名，表示调用父类构造函数，并传入参数。
*如果父类是无参构造或有参构造都有默认参数，则无需使用列表初始化会自动调用。


//使用初始化列表来初始化字段：
Person(double len) : X(a), Y(b)
{
	cout << "构造函数, X = " << a << endl;
}


//必须使用参数列表初始化的场合
（1）成员属性为引用时；
（2）成员属性被 const 修饰时；
（3）成员属性是对象，且对象没有无参构造函数时；
（4）父类没有无参构造函数，或有参构造的参数并不都有默认参数时，必须使用列表初始化传入参数，供父类先进行构造。



/********************/实例/************************************************************/
#include <iostream>

using namespace std;


class Name {
public:
	Name(const char* str) {

	}
};


class Person {
public:
	Person(int _age, int _data) :num(_data), a(100), b("jack")
	{
		cout << "Person(int _age)   age=" << age << endl;
	}

	int age;
	int& num;		//成员属性为引用时必须参数列表初始化
	const int a;		//成员属性被const修饰时，必须参数列表初始化
	Name  b;			//成员属性是对象，且对象没有无参构造函数时，必须参数列表初始化
};


int main()
{
	int data = 100;

	Person A(20, data);
}


