/********************/构造析构函数/************************************************************/

1.构造函数：创建类的对象时被自动调用，用来初始化类的成员属性
类名() {}
（1）函数名与类名相同
（2）在类的对象被创建时自动调用
（3）没有返回值，也不添加 void 关键字 
（4）可以有参数，因此可以重载


2.析构函数：在类的对象被销毁时，释放资源（类的成员属性）
~类名() {}
（1）函数名与类名相同，但名称前加"~"
（2）在类的对象销毁时自动调用
（3）没有返回值，也不添加 void 关键字
（4）没有参数，因此不可以重载

注意 :
(1)如果类没有编写构造与析构，那么编译器会在编译时自动添加无参构造和析构函数。
(2)如果类中有编写有参构造，那么编译器不会在编译时添加无参构造。
(3)当使用 new 创建N个对象时, 从下标0开始创建，当 delete 析构多个对象时，从下标N-1开始析构。


3.拷贝构造函数
类名(){}
它是构造函数中的一种。
它在创建对象时，是使用同一类中现有的对象来初始化新创建的对象。
如果类带有指针变量，并有动态内存分配，则它必须有一个拷贝构造函数。

浅拷贝 : 在拷贝构造函数中，直接传递数值，默认拷贝构造都是浅拷贝。
深拷贝 : 在拷贝堆空间数据时，申请新的堆空间，再拷贝堆空间数据。

*如果类没有编写拷贝构造，编译器会自动定义拷贝构造，默认浅拷贝。
*如果类中有堆空间数据，那么浅拷贝只会拷贝堆空间的首地址。在销毁对象时，也会直接释放掉堆空间，其它指向该堆空间的成员指针在调用时会出现段错误。

由于我们使用了系统所提供的浅拷贝函数，会做浅拷贝操作， Person P2(P); ，P 与 P2会执行同样的一个析构函数，
又由于栈中的数据是先进后出，所以先析构了P2当中的数据，然后析构P，这样就会导致，同样的一块内存空间被释放了两次。
从而出现内存被重复释放的问题。为了解决浅拷贝的内存重复释放问题所以出现了深拷贝。


拷贝构造应用范围 :
（1）在定义对象时直接赋值：Person P = A;
（2）在定义对象时通过构造函数拷贝：Person P(A);
（3）函数参数为类的对象时，也会调用拷贝构造。
（4）函数返回值为对象的引用时，外部赋值运算也是拷贝构造。


*函数形参为类类型时会调用构造和析构函数，若是引用则不会调用，如：
void test(Person& q){}


成员对象为类对象时，构造与析构的调用顺序：
①先调用成员对象的构造，再调用类的构造;
②先调用类的析构，再调用成员对象的析构。



/********************/带参构造函数实例/************************************************************/
#include <iostream>

using namespace std;


class Person {
public:
	//带参构造函数
	Person(int _age)
	{
		age = _age;
	}
private:
	int age;
};


int main()
{

	//Person A;			//调用无参构造函数

	Person A(100);		//定义对象的同时为构造函数传入参数

}



/********************/拷贝构造函数实例/************************************************************/

#include <iostream>
using namespace std;

//构造函数是创建时的初始化，析构函数是结束时的数据清理。
//如果我们不提供构造和析构，编译器也会使用编译器所提供的构造函数与析构函数进行空实现。

class Person
{
public:
	int get_age(void)
	{
		return *ptr;
	}

	Person(int age);            //普通构造函数
	Person(Person& P);			//拷贝构造函数
	~Person();                  //析构函数

private:
	int* ptr;
	int height;
};


//类的方法可以在类外定义，但要在类内声明
//类的构造函数
Person::Person(int age)
{
	cout << "调用构造函数" << endl;
	ptr = new int;				// 为指针分配内存
	*ptr = age;
}

//拷贝构造函数：参数一定是引用,为了防止再次调用拷贝构造
Person::Person(Person& P)		//为了整个程序的安全，参数类型可以加上const，防止对引用类型参数值的意外修改。（提示这是一个输入参数）
{
	cout << "调用拷贝构造函数" << endl;
	height = P.height;			//直接传递数值
	ptr = new int;				//申请新堆空间（申请了内存，因此为深拷贝）
	*ptr = *P.ptr;				//再拷贝值（指向新申请的内存）
}

//类的析构函数
Person::~Person(void)
{
	cout << "释放内存" << endl;
	delete ptr;
}


void func(Person P)			//此处形参的创建调用了拷贝构造函数
{
	cout << "age 大小 : " << P.get_age() << endl;
}


int main()
{
	Person A(10);

	Person B = A;		//调用拷贝构造（定义对象时直接赋值）
	Person C(A);		//调用拷贝构造（定义对象时通过构造函数拷贝）
	func(A);			//调用拷贝构造（函数形参为类的对象）
	
}


