/********************/mysql相关概念/************************************************************/
MySQL 由于其体积小、速度快、总体拥有成本低，可处理上千万条记录的大型数据库，
尤其是开放源码这一特点，使得很多互联网公司、中小型网站选择了MySQL作为网站数据库


DB：数据库(Database)
即存储数据的"仓库"，其本质是一个文件系统，它保存了一系列有组织的数据。

DBMS：数据库管理系统(Database Management System)
是一种操纵和管理数据库的大型软件，用于建立、使用和维护数据库，对数据库进行统一管理和控制。
用户通过数据库管理系统访问数据库中表内的数据。mysql就是DBMS。

SQL：结构化查询语言(Structured Query Language)
专门用来与数据库通信的语言。


/************************************************************/
//关系型数据库
关系型数据库(RDBMS)：最古老的数据库类型，关系型数据库模型是把复杂的数据结构归结为简单的二元关系（即二维表格形式）。
关系型数据库以 行(row) 和 列(column) 的形式存储数据，以便于用户理解。这一系列的行和列被称为 表(table) ，一组表组成了一个库(database)。

优势
复杂查询 可以用SQL语句方便的在一个表以及多个表之间做非常复杂的数据查询。
事务支持 使得对于安全性能很高的数据访问要求得以实现。

//非关系型数据库
非关系型数据库(非RDBMS)：可看成传统关系型数据库的功能 阉割版本，基于键值对存储数据，不需要经过SQL层的解析，性能非常高。同时，通过减少不常用的功能，进一步提高性能。

键值型数据库：通过 Key - Value 键值的方式来存储数据，Key 作为唯一的标识符，优点是查找速度快，在这方面明显优于关系型数据库，
缺点是无法像关系型数据库一样使用条件过滤（比如 WHERE），键值型数据库典型的使用场景是作为 内存缓存 。 Redis 是最流行的键值型数据库。

文档型数据库：可存放并获取文档，可以是XML、JSON等格式。在数据库中文档作为处理信息的基本单位，一个文档就相当于一条记录。
文档数据库所存放的文档，就相当于键值数据库所存放的“值”。MongoDB是最流行的文档型数据库。

搜索引擎数据库：虽然关系型数据库采用了索引提升检索效率，但是针对全文索引效率却较低。
搜索引擎数据库是应用在搜索引擎领域的数据存储形式，由于搜索引擎会爬取大量的数据，并以特定的格式进行存储，
这样在检索的时候才能保证性能最优。核心原理是“倒排索引”。
典型产品：Solr、Elasticsearch、Splunk 等。

列式数据库：列式数据库是相对于行式存储的数据库，Oracle、MySQL、SQL Server 等数据库都是采用的行式存储（Row - based），
而列式数据库是将数据按照列存储到数据库中，这样做的好处是可以大量降低系统的I / O，适合于分布式文件系统，不足在于功能相对有限。
典型产品：HBase等。

图形数据库：图形数据库顾名思义，就是一种存储图形关系的数据库。利用了图这种数据结构存储了实体（对象）之间的关系。
最典型的例子就是社交网络中人与人的关系，数据模型主要是以节点和边（关系）来实现，特点在于能高效地解决复杂的关系问题。
典型产品：Neo4J、InfoGrid等。

//NoSQL
NoSQL 对 SQL 做出了很好的补充，比如实际开发中，有很多业务需求，其实并不需要完整的关系型数据
库功能，非关系型数据库的功能就足够使用了。这种情况下，使用 性能更高 、 成本更低 的非关系型数据
库当然是更明智的选择。比如：日志收集、排行榜、定时器等。


/************************************************************/
E - R（entity - relationship，实体 - 联系）模型中有三个主要概念是： 实体集 、 属性 、 联系集 。
一个实体集（class）对应于数据库中的一个表（table），
一个实体（instance）则对应于数据库表中的一行（row），也称为一条记录（record）。
一个属性（attribute）对应于数据库表中的一列（column），也称为一个字段（field）。

ORM思想(Object Relational Mapping)体现：
数据库中的一个表 < --->Java或Python中的一个类
	表中的一条记录 < --->类中的一个对象（或实体）
	表中的一个列 < --->类中的一个字段、属性(field)
	
表与表记录之间的关系：一对一、一对多、多对多、自关联


/********************/mysql简单示例/************************************************************/
管理员身份运行cmd命令行

启动mysql指令：net start MySQL程序名
关闭mysql指令：net stop MySQL程序名

进入mysql命令行指令：mysql -u root -p


//mysql命令（需要加分号";"，以下省略）
source 文件全路径名								//导入现有数据表
show databases									//显示所有数据库
create database 数据库名						//创建数据库
use 数据库名									//选择操作的数据库
create table 表名(字段名 类型, 字段名 类型...)	//创建表
insert into 表名 values(字段1值, 字段2值...)	//添加一条记录（字符串需要添加单引号''）
select * from 表名								//查看表中所有记录
show create table 表名							//查看表的创建信息
show create table 数据库名						//查看数据库的创建信息
drop table 表名									//删除表				
drop database 数据库名							//删除数据库


//5.7版本中文乱码问题
方法一：
步骤1：查看编码命令
show variables like 'character_%';
show variables like 'collation_%';

步骤2：修改mysql的数据目录下的my.ini配置文件
[mysql] #大概在63行左右，在其下添加
...
default - character - set = utf8 #默认字符集
[mysqld] # 大概在76行左右，在其下添加
...
character - set - server = utf8
collation - server = utf8_general_ci
注意：建议修改配置文件使用notepad++等高级文本编辑器，使用记事本等软件打开修改后
可能会导致文件编码修改为"含BOM头"的编码，从而服务重启失败。

步骤3：重启服务


方法二：
mysql > alter database 数据库名 charset utf8;


