/********************/SQL语法分类/************************************************************/
DDL（Data Definition Languages 数据定义语言），这些语句定义了不同的数据库、表、视图、索引等数据库对象，还可以用来创建、删除、修改数据库和数据表的结构。
主要的语句关键字包括 CREATE 、 DROP 、 ALTER 、 RENAME 、 TRUNCATE 等。

DML（Data Manipulation Language 数据操作语言），用于添加、删除、更新和查询数据库记录，并检查数据完整性。
主要的语句关键字包括 INSERT 、 DELETE 、 UPDATE 、 SELECT 等。

DCL（Data Control Language 数据控制语言），用于定义数据库、表、字段、用户的访问权限和安全级别以及数据提交、撤销等操作。
主要的语句关键字包括 GRANT 、 REVOKE 、 COMMIT 、 ROLLBACK 、 SAVEPOINT 等。

因为查询语句使用的非常的频繁，所以很多人把查询语句单拎出来一类：DQL（数据查询语言）。
还有单独将 COMMIT 、 ROLLBACK 取出来称为TCL （Transaction Control Language，事务控制语言）。



/********************/SQL规则规范/************************************************************/
//基本规则
1、SQL 可以写在一行或者多行。为了提高可读性，各子句分行写，必要时使用缩进
2、每条命令以";"或"\g"或"\G"结束
3、关键字不能被缩写也不能分行
4、关于标点符号：英文半角；括号引号需成对; 字符串和日期时间数据可使用单引号''表示。列的别名可使用双引号""，且不建议省略as。


//SQL大小写规范
1、MySQL 在 Windows 环境下是大小写不敏感的
2、MySQL 在 Linux 环境下是大小写敏感的：
（1）数据库名、表名、表的别名、变量名是严格区分大小写的
（2）关键字、函数名、列名(或字段名)、列的别名(字段的别名) 是忽略大小写的。

推荐的书写规范：
数据库名、表名、表别名、字段名、字段别名等都小写
SQL 关键字、函数名、绑定变量等都大写

//注释
单行注释：#注释文字(MySQL特有的方式)
单行注释：-- 注释文字(--后面必须包含一个空格。)
多行注释：/* 注释文字 */

//命名规则
同一个MySQL软件中，数据库不能同名；
同一个库中，表不能重名；同一个表中，字段不能重名必须保证字段没有和保留字、数据库系统或常用方法冲突。
如果坚持使用，请在SQL语句中使用`（着重号）引起来。
保持字段名和类型的一致性，在命名字段并为其指定数据类型的时候一定要保证一致性。



/********************/SELECT 查询语句/************************************************************/

SELECT 字段1, 字段2, ... FROM 表名				//查询语句格式，字段表示记录需要显示的字段名

//伪表 DUAL
SELECT 表达式 FROM DUAL							//DUAL是伪表，代表不需要表，也可与FROM一同省略。如 SELECT 1+1 或 SELECT 1+1 FROM DUAL。

//星号*
SELECT * FROM 表名								//"*"代表所有字段

//别名 AS
SELECT 字段1 AS 别名1, 字段2 别名2, 字段3 "别名3" FROM 表名		//给字段1、字段2、字段3起别名。AS全称alias，可省略。别名可用""标注。

//去重 DISTINCT
SELECT DISTINCT 字段 FROM 表名					//DISTINCT 关键字表示去除该字段重复的记录
SELECT DISTINCT 字段1, 字段2 FROM 表名			//DISTINCT 关键字会去除字段1和字段2同时重复的记录

//空值 null
空值null，是未填写的值。null不等同于0，''，'null'
空值null参与运算，结果一定也为空值null
SELECT IFNULL(字段, 0) FROM 表名				//表示如果字段为空值，则使用0来代替

//反引号`
当表名、字段名等与系统关键字冲突时，使用该数据表或字段需要加上反引号``。如 SELECT * FROM `order`;

//查询常数
SELECT 常数(数字或字符串) 字段 FROM 表名		//查询后在相应位置添加常数字段（不作为查询的字段）

//显示表结构 DISCRIBE/DISC
DISCRIBE 表名									//DISCRIBE/DISC 关键字表示显示表中字段的详细信息

//过滤条件 WHERE
SELECT * FROM 表名 WHERE 字段名 运算符 值		//表示筛选满足某字段值符合条件的记录。WHERE紧跟FROM后面

//排序 ORDER BY
SELECT * FROM 表名 ORDER BY 字段名 排序方式							//对查询到的记录按目标字段进行对应排序操作。升序：ASC（即ascend），降序：DESC（即descend）。

//二级排序
SELECT * FROM 表名 ORDER BY 字段名1 排序方式,字段名2 排序方式		//当排序的字段1值相同时，按字段2的值排序。（多级排序类推）

//分页 LIMIT
SELECT* FROM 表名 LIMIT 偏移量,每页记录数							//对查询到的记录进行分页。偏移量可省去，默认为0。（该关键字在其它数据库中可能有所不同）

//分页 LIMIT...OFFSET... （MySQL8.0新特性）
SELECT* FROM 表名 LIMIT 每页记录数 OFFSET 偏移量					//对查询到的记录进行分页。

//过滤、排序、分页顺序
SELECT* FROM 表名 WHERE 条件 ORDER BY 字段 排序方式 LIMIT 偏移量, 每页记录数		//按照 WHERE...ORDER BY...LIMIT 顺序声明



/********************/运算符/************************************************************/
//算术运算符
加法  +
减法  -
乘法  *
除法  /	 DIV
取余  %  MOD

数字字符运算时会转换为数值，其它则无法转换作为0来处理。
乘除运算后结果均为浮点数。
null参与运算结果为null。


//比较运算符
结果为真返回1，结果为假返回0，其它情况返回NULL。

=			等于				如果两边都是字符串，则比较其ASCII编码；如果两边有一个为NULL，则结果为NULL
<=>			安全等于			如果比较值为null，即null=null，则返回值为1。在字段前添加NOT关键字可以起到安全不等于的作用，也可以括起来加!符号
<>或!=		不等于				如果两边有一个为NULL，则结果为NULL。
<			小于
<=			小于等于
>			大于
>=			大于等于

IS NULL			判断为空					A IS NULL	 （相当于A<=>NULL）
IS NOT NULL		判断不为空					A IS NOT NULL（相当于!=NULL）
LEAST			返回最小值					LEAST(A, B, C)
GREATEST		返回最大值					GREATEST(A, B, C)
BETWEEN AND		返回两值之间的值			BETWEEN A AND B（包含边界值）
ISNULL			判断为空					ISNULL(A)	（相当于函数形式的IS NULL）
IN				返回集合范围内的值			IN(A, B, C)
NOT IN			返回不在集合范围内的值		NOT IN(A, B, C)
LIKE			返回符合模糊匹配规则的值	LIKE '%a%'	（返回包含字符'a'的值，通配符'%'代表任意个字符，'_'代表一个字符，\是转义字符）
REGEXP			返回符合正则表达式规则的值
RLIKE			返回符合正则表达式规则的值


//逻辑运算符
NOT 或 ！		逻辑非
AND 或 &&		逻辑与（优先级高于逻辑或）
OR  或 ||		逻辑或
XOR				逻辑异或（一真一假才为真，真真假假都为假）（筛选前后一个满足条件一个不满足条件的记录）


//位运算符
&			按位与（位AND）
|			按位或（位OR）
^			按位异或（位XOR）
~			按位取反
>>			按位右移
<<			按位左移

		

/********************/多表查询/************************************************************/



