/********************/this 指针/************************************************************/

this 指针：用来访问当前对象的地址

this 指针是所有成员函数的隐含参数。在成员函数内部，用来指向当前的对象。每一个成员方法都有 this 指针。

特点：
（1）在构造函数中，当形参与成员属性同名，通过 this 指针进行分辨。
（2）在需要返回当前类对象的成员函数，使用 return *this 来实现。
（3） this 指针不占内存空间。



/********************/空指针/************************************************************/

类类型空指针调用类的成员：

指向类的空指针在不使用对象的成员属性时，可以直接调用 static 修饰的成员属性和成员方法。

空指针调用方法比较少见，使用过程中尽量使用 类名 + 作用域 符号来访问 static 成员。



/********************/空指针 实例/************************************************************/
#include <iostream>

using namespace std;


class Person {
public:
	void show() {
		cout << "Person::show()" << endl;
	}
	void show2() {
		cout << "Person::show2() a=" << a << endl;
	}
	static void show3() {
		cout << "Person::show3() b=" << b << endl;
	}
	int a;
	static int b;
};

int Person::b = 100;


int main()
{
	Person* p = NULL;

	p->show();				//调用的函数没有使用到任何应用层内存
	//p->show2();				//p指向空内存，没有任何数据，因此无法输出a的值
	p->show3();

	cout << p->b << endl;	//因为b在全局段，被类的所有对象公有，因此可以直接输出b的值。

}

