/********************/参数列表初始化/************************************************************/

参数列表初始化：在类的构造函数调用之前，初始化成员属性。

语法规则：
构造函数(参数列表) : 成员属性1(数值1), 成员属性2(数值2) ...
{

}


//使用初始化列表来初始化字段：
Person(double len) : X(a), Y(b)
{
	cout << "构造函数, X = " << a << endl;
}

//上面的语法等同于如下语法：
Person(double len)
{
	X = a;
	Y = b;
	cout << "构造函数, X = " << a << endl;
}


必须使用参数列表初始化的场合：
（1）成员属性为引用时必须参数列表初始化；
（2）成员属性被 const 修饰时，必须参数列表初始化；
（3）成员属性是对象，且对象没有无参构造函数时，必须参数列表初始化。

类的成员无法在定义的同时初始化，构造函数是对已经定义完成的成员进行初始化。
因此，凡是需要在定义时初始化的成员，都是必须参数列表初始化的。



/********************/实例/************************************************************/
#include <iostream>

using namespace std;


class Name {
public:
	Name(const char* str) {

	}
};


class Person {
public:
	Person(int _age, int _data) :num(_data), a(100), b("jack")
	{
		cout << "Person(int _age)   age=" << age << endl;
	}

	int age;
	int& num;		//成员属性为引用时必须参数列表初始化
	const int a;	//成员属性被const修饰时，必须参数列表初始化
	Name  b;		//成员属性是对象，且对象没有无参构造函数时，必须参数列表初始化
};


int main()
{
	int data = 100;

	Person A(20, data);

}


