/********************/explicit 关键字/************************************************************/
explicit 关键字
//修饰构造函数或转换函数
以阻止它进行不希望的隐式类型转换。
当你有一个类，并且这个类有一个或多个接受单一参数的构造函数时，
C++会允许在某些情况下自动执行这些构造函数，以进行隐式类型转换。

这可能不是你想要的行为，因为它可能导致代码难以理解和维护，以及意外的行为。

class Foo {
public:
	explicit Foo(int value) : value_(value) {}

private:
	int value_;
};

Foo f = 42; // 错误：不能从int隐式转换到Foo
Foo f(42); // 正确：显式地调用构造函数


* explicit(bool)： explicit 指定符可以与常量表达式一同使用。当且仅当该常量表达式求值为 true 才为显式。 （C++20）
因为有时候需要根据参数具体类型来决定是否支持隐式调用。


/********************/匿名对象/************************************************************/

匿名对象在创建对象时，不给与名称。那么这个对象会在当前语句结束时被销毁。
目的：节省栈空间资源


实例：
Person B = Person();
//先创建匿名对象，然后把匿名对象的内存命名成B。结束时，因为内存有了名字，所以不会被释放
	


/********************/实例/************************************************************/
#include <iostream>

using namespace std;


class Person {
public:
	Person() 
	{
		cout << "Person() 构造函数" << endl;
	}

/*	Person(Person& p)
	{
			cout << "Person(Person &p) 拷贝构造" << endl;
	}
*/
	~Person() 
	{
		cout << "~Person() 析构函数" << endl;
	}
};

int main()
{
	Person();					//创建匿名对象，在语句结束时被销毁

	cout << "------------" << endl;

	Person A = Person();		//先创建匿名对象，然后把匿名对象的内存命名成A。语句结束时，因为内存有了名字，所以不会被释放
							//不会且无法调用拷贝构造，因为没有实体对象，无法传入引用。
	cout << "------------" << endl;

}






