/********************/using 关键字/************************************************************/
using 关键字有多种用法

//1、打开命名空间
using namespace + 命名空间名称


//2、定义别名
using uint_t = unsigned int;				等价于: typedef unsigned int uint_t

同时 using 可以用于定义模板的别名，而 typedef 不能，如下：

template <typename Val>
using str_map_t = std::map<std::string, Val>;
// ...
str_map_t<int> map1;

定义函数指针：
typedef void(*func_t)(int, int);
using func_t = void(*)(int, int);


//3、在派生类中引用基类成员
class Base
{
public:
	int x = 10;
};

class Derived : public Base
{
public:
	using Base::Base;		//引用构造函数（C++11，见继承构造函数）
	using Base::x;			//只能引用非私有成员
};

int main()
{
	Derived D;
	D.Base::x = 100;		//访问基类成员时需要使用作用域::符号
	D.x = 200;			//引用的成员在派生类中仍然能复制一份

	return 0;
}



/********************/inline 关键字/************************************************************/
//内联函数

内联函数在编译时，编译器会把该函数的代码副本放置在每个调用该函数的地方。

优点 : 当函数体比较小的时候，内联该函数可以令目标代码更加高效。对于存取函数以及其它函数体比较短，性能关键的函数，鼓励使用内联。


//类的内联函数
如果一个函数在类定义中被定义，它会自动地成为内联函数，即使没有使用 inline 说明符。
然而，如果函数是在类定义外部定义的，那么它就不能自动成为内联函数，除非在类定义中显式地使用 inline 关键字。


//实例
inline int Max(int x, int y)
{
	return (x > y) ? x : y;
}

int main()
{
	cout << "Max (20,10): " << Max(20, 10) << endl;
	cout << "Max (0,200): " << Max(0, 200) << endl;
	return 0;
}


//注意
1、内联函数最好不要超过10行。
2、谨慎对待析构函数，析构函数往往比其表面看起来要更长，因为有隐含的成员和基类析构函数被调用。
3、虚函数和递归函数不应该声明成内联函数（即使声明为内联的也不会被编译器内联）。
4、内联那些包含循环或 switch 语句的函数常常是得不偿失(除非在大多数情况下, 这些循环或 switch 语句从不被执行)。
5、在实际编程中，编译器可能会自动选择是否内联函数，因此 inline 关键字通常被视为一种建议，而不是强制。


/************************************************************/
内联命名空间（C++11）
/************************************************************/
内联静态成员变量（C++17）
class X
{
public:
	static const int num{ 5 };				//常量静态成员变量可以在声明时定义赋值
	static int a;						//非常量静态成员变量需要在类外赋值，且赋值语句不能写在头文件中，否则可能被重复包含调用
	inline static int b = 20;				//inline 声明的静态成员变量无上述问题
};

int a = 10;


