/********************/匿名对象/************************************************************/

匿名对象在创建对象时，不给与名称。那么这个对象会在当前语句结束时被销毁。
目的：节省栈空间资源


实例：
Person B = Person();
//先创建匿名对象，然后把匿名对象的内存命名成B。结束时，因为内存有了名字，所以不会被释放
	


/********************/实例/************************************************************/
#include <iostream>

using namespace std;


class Person {
public:
	Person() 
	{
		cout << "Person() 构造函数" << endl;
	}

/*	Person(Person& p)
	{
			cout << "Person(Person &p) 拷贝构造" << endl;
	}
*/
	~Person() 
	{
		cout << "~Person() 析构函数" << endl;
	}
};

int main()
{
	Person();					//创建匿名对象，在语句结束时被销毁

	cout << "------------" << endl;

	Person A = Person();		//先创建匿名对象，然后把匿名对象的内存命名成A。语句结束时，因为内存有了名字，所以不会被释放
							//不会且无法调用拷贝构造，因为没有实体对象，无法传入引用。
	cout << "------------" << endl;

}