/********************/匿名对象/************************************************************/

匿名对象在创建对象时，不给与名称。那么这个对象会在当前语句结束时被销毁。
目的：节省栈空间资源


实例：
Person B = Person();
//先创建匿名对象，然后把匿名对象的内存命名成B。结束时，因为内存有了名字，所以不会被释放
	


/********************/实例/************************************************************/
#include <iostream>

using namespace std;


class Person {
public:
	Person() 
	{
		cout << "Person() 构造函数" << endl;
	}

/*	Person(Person& p)
	{
			cout << "Person(Person &p) 拷贝构造" << endl;
	}
*/
	~Person() 
	{
		cout << "~Person() 析构函数" << endl;
	}
};

int main()
{
	Person();					//创建匿名对象，在语句结束时被销毁

	cout << "------------" << endl;

	Person A = Person();		//先创建匿名对象，然后把匿名对象的内存命名成A。语句结束时，因为内存有了名字，所以不会被释放
							//不会且无法调用拷贝构造，因为没有实体对象，无法传入引用。
	cout << "------------" << endl;

}



/********************/内联函数/************************************************************/
inline 关键字

内联函数在编译时，编译器会把该函数的代码副本放置在每个调用该函数的地方。

优点 : 当函数体比较小的时候，内联该函数可以令目标代码更加高效。对于存取函数以及其它函数体比较短，性能关键的函数，鼓励使用内联。


//类的内联函数
如果一个函数在类定义中被定义，它会自动地成为内联函数，即使没有使用 inline 说明符。
然而，如果函数是在类定义外部定义的，那么它就不能自动成为内联函数，除非在类定义中显式地使用 inline 关键字。


//实例
inline int Max(int x, int y)
{
	return (x > y) ? x : y;
}

int main()
{
	cout << "Max (20,10): " << Max(20, 10) << endl;
	cout << "Max (0,200): " << Max(0, 200) << endl;
	return 0;
}


//注意
1、内联函数最好不要超过10行。
2、谨慎对待析构函数，析构函数往往比其表面看起来要更长，因为有隐含的成员和基类析构函数被调用。
3、虚函数和递归函数不应该声明成内联函数（即使声明为内联的也不会被编译器内联）。
4、内联那些包含循环或 switch 语句的函数常常是得不偿失(除非在大多数情况下, 这些循环或 switch 语句从不被执行)。
5、在实际编程中，编译器可能会自动选择是否内联函数，因此 inline 关键字通常被视为一种建议，而不是强制。






