/********************/继承/************************************************************/
继承：在某一个类的基础上，通过不同的权限派生出一个新的类。这个新的类会包含原基础类的所有成员，并且赋予不同的访问权限。

作用：减少代码量

基础类被称为基类，也被称为父类。
新类被称为派生类，也被称为子类。


权限： public, private, protected

语法规则:
class 派生类类名 : 继承方式  基类类名

继承权限：
（1） public 继承下，所有成员权限不变；
（2） protected 继承下，基类的公有成员变成保护权限；
（3） private 继承下, 基类的公有和保护成员变成私有权限；
（4）不管哪种继承权限，基类的私有成员复制到派生类中会被隐藏起来，无法访问（但在内存中是存在的）；
（5）若没有指定继承权限，则默认为 private 继承。


//继承中构造与析构的调用
①先调用基类构造函数，再调用派生类构造函数。
②先调用派生类的析构函数，再调用基类的析构函数。

*当基类构造函数没有无参构造函数时，必须参数列表初始化基类构造。



/********************/派生类/************************************************************/
一个派生类继承了所有的基类方法
//下列情况除外
* 基类的构造函数、析构函数和拷贝构造函数。
* 基类的重载运算符。
* 基类的友元函数。


派生类可以访问基类中所有的非私有成员。因此基类成员如果不想被派生类的成员函数访问，则应在基类中声明为 private 。


//派生类中调用基类继承的成员方式
（1） public 成员：类内和类外都可以访问。
（2） protected 成员： protected 属性可以在派生类中的方法中访问。
（3） private 成员：基类中继承来的私有成员，虽不可见，但能通过基类继承来的公有成员方法调用。
（4）非 private 成员：如果派生类中没有同名成员，那么派生类对象可以直接访问基类成员。
（5）非 private 成员：当派生类有与基类同名的成员时，那么它继承的来自基类的同名成员（包括所有重载函数）会被隐藏（也称覆盖），
	 此时必须通过基类类名加作用域的方法访问。


//static 修饰成员
static 修饰的成员被类的所有对象公用。
如果派生类中没有同名 static 成员属性，那么他们公用同一块 static 内存空间。
如果派生类中有同名 static 成员属性，那么他们不是公用同一块 static 内存空间。

*一般情况下，不要在派生类中定义与已有的 static 成员同名的成员，防止调用时出错。


/********************/多继承/************************************************************/
多继承：一个派生类可以同时有多个基类，它继承了

class 派生类类名 : 继承方式 基类1, 继承方式 基类2 ...
{
	<派生类类体>
};

多继承时，基类构造的调用顺序与创建派生类时声明的基类顺序相同, 析构时与声明的基类顺序完全相反。

构造调用顺序：基类1-- 基类2-- 基类N-- 派生类
析构调用顺序：派生类-- 基类N-- 基类2-- 基类1


多继承时多个基类出现同名成员，会产生歧义，只能通过类名 + 作用域的方式访问成员。


/********************/虚继承/************************************************************/
菱形继承 : 多继承时的多个基类有来自同一个基类的成员，那么这个成员会产生二义性。

解决办法：虚继承
虚基类：虚继承的基类

class 派生类名 : virtual 继承方式 基类名
{
	<派生类类体>
};


//虚继承原理
虚继承时，编译器会在派生类对象的内存布局中添加一个指向虚基表的指针，即虚基指针。
虚基指针指向虚基表。
虚基表中存放的是虚基类与本类的偏移地址，以及虚基类到共有基类元素之间的偏移量。通过偏移地址可以找到虚基类成员。
也就是说，他们的虚基指针最终指向同一个虚基类，当他们进行派生时，虚基指针会被继承，因此也是指向那个虚基类。


//特点
1、虚指针和虚基指针会被继承。
2、当发生多继承时，数据会照常拷贝，但在访问时会按照虚基指针的指向访问基类的成员。
3、当发生多继承时，虚继承的基类构造函数只会调用一次。



/********************/虚继承实例/************************************************************/
#include <iostream>

using namespace std;

class Base {
public:
	int num;
};

//虚继承
class DataA :virtual public Base {
public:
	//创建虚指针
};

class DataB :virtual public Base {
public:
	//创建虚指针
};

class Total :public DataA, public DataB {
public:
};

int main()
{
	Total P;
	cout << "sizeof(DataA)=" << sizeof(DataA) << endl;

	cout << sizeof(Total) << endl;

	P.num = 1;

	cout << "&P.DataA::Base::num = " << &P.DataA::Base::num << endl;
	cout << "&P.DataB::Base::num = " << &P.DataB::Base::num << endl;
}


