/********************/多态/************************************************************/
多态为不同的实体提供统一的接口。多态性可以简单的概括为 "一个接口，多种方法"，字面意思为多种形态.


//静态多态：在程序编译时确定运行的对象。也被称为静态联编。
函数重载，运算符重载，模板。

//动态多态：在程序运行过程中确定运行的对象。也被称为动态联编。
虚函数，重写。


//多态的存在的三个必要条件
1、必须要有基类与派生类。
2、必须要有继承。
3、必须要有方法的重写。



/********************/虚函数和重写/************************************************************/
//虚函数
概念：虚函数是在基类中使用关键字 virtual 声明的成员函数，用于被继承时重写。
作用：允许基类指针访问派生类函数。

//重写
概念：派生类中定义与基类完全一模一样的函数（返回值、函数名、参数相同，函数体不同），称为重写。
注意：此时若想访问基类虚函数则需要使用作用域符号。


//虚函数的原理
基类中创建虚函数以后，基类会创建一个虚指针指向虚表，并在虚表中创建一个函数指针指向虚函数。
派生类会继承这个虚指针，和基类的虚指针指向同一个虚表。
当派生类对基类的虚函数进行重写以后，虚表中会创建一个函数指针指向派生类的虚函数。
当基类的指针或者引用指向派生类对象时，可以通过虚指针，访问到派生类的虚函数。


//注意
（1）虚指针会通过继承一直传递下去，不管多少个虚函数，都只有1个虚函数表的虚指针。
（2）虚函数具有传递性，派生类中重写的虚函数也一定是虚函数。
（3）派生重写不需要加 virtual ，即使加了也不创建新虚指针。
（4）派生类中的重载函数并不是虚函数, 必须是重写的基类虚函数才是虚函数。


//疑问
Q：派生类中的虚指针是否有用？破坏该虚指针派生类还可以访问该虚函数吗？
A：是的，此时派生类访问自己的虚函数也需要通过该虚指针。破坏后将无法正常访问。



/********************/虚函数 实例/************************************************************/
#include <iostream>
using namespace std;

class Parent
{
public:
        virtual void fun() {}

private:
        int a{ 10 };
};


class Child : public Parent
{
public:
        void fun() { cout << "my" << endl; }                   //派生类虚函数无需 virtual 标识。

private:
        int a{ 20 };
};


int main() {
        Parent parent;
        Child* child = new Child;
        int* ptr = (int*)child;
        cout << sizeof(Parent) << endl;         //16
        cout << sizeof(parent) << endl;        //16
        cout << sizeof(Child) << endl;          //24
        cout << sizeof(*child) << endl;         //24

        printf("%p\n", child);
        printf("%p\n", ptr);

        printf("ptr:%d\n", *ptr);                       //虚指针地址上半
        printf("+1：%d\n", *(ptr + 1));           //虚指针地址下半
        printf("+2：%d\n", *(ptr + 2));           //10，Parent
        printf("+3：%d\n", *(ptr + 3));           //字节补齐
        printf("+4：%d\n", *(ptr + 4));           //20，Child
        printf("+5：%d\n", *(ptr + 5));           //字节补齐

        *ptr = 100;                             //破坏派生类中的虚函数指针
        child->fun();                          //派生类的虚函数无法正常调用

        return 0;
}

