/********************/多态/************************************************************/
多态为不同的实体提供统一的接口。多态性可以简单的概括为 "一个接口，多种方法"，字面意思为多种形态.


//静态多态：在程序编译时确定运行的对象。也被称为静态联编。
函数重载，运算符重载，模板。

//动态多态：在程序运行过程中确定运行的对象。也被称为动态联编。
虚函数和纯虚函数的重写。


//多态的存在的三个必要条件
1、必须要有基类与派生类。
2、必须要有继承。
3、必须要有方法的重写。



/********************/虚函数和重写/************************************************************/
//虚函数
概念：虚函数是在基类中使用关键字 virtual 声明的成员函数，用于被继承时重写。
作用：允许基类指针访问派生类函数。

//重写
概念：派生类中定义与基类完全一模一样的函数（返回值、函数名、参数相同，函数体不同），称为重写。
注意：此时若想访问基类虚函数则需要使用作用域符号。


//虚函数的原理
基类中创建虚函数以后，基类会创建一个虚指针指向虚表，并在虚表中创建一个函数指针指向虚函数。
虚表中是函数指针数组，数组里存放的都是虚函数的指针。即使是多个虚函数也是放入同一个虚表，不用另外创建虚指针。
派生类会继承这个虚指针，和基类的虚指针指向同一个虚表。
当派生类对基类的虚函数进行重写以后，虚表中会创建一个函数指针指向派生类的虚函数。
当基类的指针或者引用指向派生类对象时，可以通过虚指针，访问到派生类的虚函数。


//注意
（1）虚指针会通过继承一直传递下去，不管多少个虚函数，都只有1个虚函数表的虚指针。
（2）虚函数具有传递性，派生类中重写的虚函数也一定是虚函数。
（3）派生重写不需要加 virtual ，即使加了也不创建新虚指针。
（4）派生类中的重载函数并不是虚函数, 必须是重写的基类虚函数才是虚函数。


//虚析构
虚析构函数是为了避免内存泄露，而且是当子类中会有指针成员变量时才会使用得到的。
也就说虚析构函数使得在删除指向子类对象的基类指针时可以调用子类的析构函数达到释放子类中堆内存的目的，而防止内存泄露的。

当父类的析构函数声明成虚析构函数的时候，当子类继承父类，父类的指针指向子类时，delete掉父类的指针，先调动子类的析构函数，再调动父类的析构函数。


//疑问
Q：派生类中的虚指针是否有用？破坏该虚指针派生类还可以访问该虚函数吗？
A：是的，此时派生类访问自己的虚函数也需要通过该虚指针。破坏后将无法正常访问。



/********************/虚继承与虚函数/************************************************************/
//虚指针与虚基指针的创建（虚指针与虚基指针都位于类对象内存的起始位置）

基类：虚函数的类编译时产生一个指向虚表的虚指针（虚表中存放的是虚函数指针，指向自己的虚函数）。

派生类①：继承虚函数的类会继承那个虚指针，指向同一个虚表。重写虚函数也会在该虚表中创建虚函数指针，指向重写的虚函数。

派生类②：虚继承的类编译时会产生一个指向虚基表的虚基指针（虚基表中存放的是虚基类与本类的偏移地址，以及虚基表到共有基类元素直间的偏移量。通过偏移地址可以找到虚基类成员）。

派生类③：虚继承一个虚函数的类，会同时产生以上派生类①中的虚指针和派生类②中的虚基指针。



虚基指针（vbptr）：      虚基指针用于处理虚继承的情况，指向虚基表。	//虚继承中派生类生成的是这个
虚基表（vbase table）：虚基类与本类的偏移地址，以及虚基表到共有基类元素直间的偏移量。通过偏移地址可以找到虚基类成员。

虚指针（vptr）：虚指针是用于支持多态的关键部分，指向虚表。 //虚函数生成的是这个
虚表（vtable）：虚函数指针数组。指向自己所有的虚函数与所有派生类的虚函数




/********************/虚函数 实例/************************************************************/
#include <iostream>
using namespace std;

class Parent
{
public:
        virtual void fun() {}

private:
        int a{ 10 };
};


class Child : public Parent
{
public:
        void fun() { cout << "my" << endl; }                   //派生类虚函数无需 virtual 标识。

private:
        int a{ 20 };
};


int main() {
        Parent parent;
        Child* child = new Child;
        int* ptr = (int*)child;
        cout << sizeof(Parent) << endl;         //16
        cout << sizeof(parent) << endl;        //16
        cout << sizeof(Child) << endl;          //24
        cout << sizeof(*child) << endl;         //24

        printf("%p\n", child);
        printf("%p\n", ptr);

        printf("ptr:%d\n", *ptr);                       //虚指针地址上半
        printf("+1：%d\n", *(ptr + 1));           //虚指针地址下半
        printf("+2：%d\n", *(ptr + 2));           //10，Parent
        printf("+3：%d\n", *(ptr + 3));           //字节补齐
        printf("+4：%d\n", *(ptr + 4));           //20，Child
        printf("+5：%d\n", *(ptr + 5));           //字节补齐

        *ptr = 100;                             //破坏派生类中的虚函数指针
        child->fun();                          //派生类的虚函数无法正常调用

        return 0;
}

