/********************/强制类型转换/************************************************************/

C++完全兼容C语言的类型转换语法，同时又新加了更合理的书写形式和更安全的新式类型转换，如下所示（目标类型以 char 为例）：


//旧式转换
(char)a;		// C语言风格类型转换
char(a);		// C++风格类型转换


/************************************************************///新式转换
（1） static_cast<char>(a);

常用的强制类型转换（与旧式转换相近，但提供了更易于查找的语法，并能有效识别不兼容类型。）
static 意味着静态转换，静态的含义是操作的过程只发生在编译阶段，而不是运行阶段，静态转换不涉及类型推理。

//应用场景
①基础数据类型的转换
②派生类的指针或引用转换为基类的指针或引用
③基类的指针或引用转换为派生类的指针或引用（这是不安全的，因为在转换过程中没有运行时检查，应使用 dynamic_cast ）
④在有关联的类型之间进行转换


/************************************************************/
（2） dynamic_cast<char>(a);

主要用于基类向派生类的强制转换（指针或引用），一般用于执行“安全的向下转型（safe downcasting）”。
* 派生类向基类的转换，本身就是安全的，无需使用该函数

转换失败，返回值为 nullptr 。
转换成功，返回值为派生类首地址。

必要条件 : 基类必须有虚函数，以支持 dynamic_cast 能够进行运行时类型信息(RTTI)检查。

优点：安全性检查
缺点：性能开销

//实例
class Base {};
class Derived : public Base {};

Base* basePtr = new Derived;	
Derived* derivedPtr = dynamic_cast<Derived*>(basePtr);	//基类指针转换为派生类指针


/************************************************************/
（3） const_cast<char>(a);

专用于去除指针或引用的 const (只读)属性
旨在去除标识符的cv限定属性（即 const 与 volatile ），只能作用于指针或引用类型

//实例
const int a = 42;
int* b = const_cast<int*>(&a);		// 使用const_cast将const int指针转换为非const int*指针
(*b)++;							// 通过修改b指向地址的值，间接修改a的值


/************************************************************/
（4） reinterpret_cast<char>(a);

主要用于数值、指针、地址等基本数据类型之间的强制转换
注意：这是一个底层的操作，要谨慎使用 reinterpret_cast ，因为它会绕过类型系统的检查，可能导致未定义行为。

//实例：在地址0x123456写入数值100
int* p = reinterpret_cast<int*>(0x123456);			//int *p = (int*)0x123456;
*p = 100;

//实例：将整数的二进制表示转换为浮点数的二进制表示
int a = 1065353216;							// 对应IEEE 754标准中的浮点数1.0
float f = reinterpret_cast<float&>(a);




