/********************/友元函数和友元类/************************************************************/
//引语 
protected 与 private 成员是不允许类外访问的，派生类中也无法访问基类继承的私有成员。
但如果特殊情况需要用到他们，那么可以通过设置友元函数来实现调用。

友元函数：其有权访问类的所有私有(private)成员和保护(protected)成员。不能用 const 修饰。（声明在类内部，定义在类外部，但不属于类的成员函数）
友元类：其整个类及其所有成员函数都是目标类的友元函数，都可以访问目标类中的非公有成员。（声明在类内部，定义在类外部，但不属于类的成员类）

* 友元函数和友元类虽然声明在类内，但却不属于类的成员。因此它没有 this 指针，不受当前类访问修饰符的影响，也不会被继承下去。


关键字 friend
friend + 友元函数 / 友元类

//三种情况
（1）普通函数作友元
（2）其它类的成员函数作当前类的友元函数，声明时需要加上作用域
（3）类作友元


//特点
（1）声明在类内部，定义在类外部，但都不属于类的成员。
（2）友元关系可以调用原本没有权限的类中的成员，降低了封装性，可能导致代码的耦合性增加，应该慎重使用。
（3）友元关系是单向的，不具有交换性。
（4）友元关系不能传递，例如：B是A的友元，C是B的友元，则不能说明C时A的友元。
（5）一个函数可以是多个类的友元函数。
（6）声明友元类可以省略 class 关键字（C++11）
（7） friend 还可用于声明别名和模板参数：（C++11）
template <typename T> 
class R 
{ 
	friend T; 
};



/********************/实例/************************************************************/
#include <iostream>

using namespace std;


class Data
{
	friend void func(Data& P);		//友元函数声明
	friend class Data2;				//友元类声明

public:
	Data(int n)
	{
		num = n;
		num2 = n * 2;
	}
protected:
	int num2;
private:
	int num;
};

//普通函数作友元
// 请注意：func() 不是任何类的成员函数，但因为func()是data的友元函数，它可以直接访问该类的任何成员
void func(Data& P)
{
	//访问时需要加上作用域
	cout << P.num << endl;
	cout << P.num2 << endl;
}

//类作友元
class Data2
{
public:
	void func2(Data& PP)
	{
		cout << PP.num << endl;
		cout << PP.num2 << endl;
	}
};

int main()
{
	Data A(100);		//定义类data的对象A
	Data2 B;			//定义友元类data的对象B

	func(A);			//使用友元函数输出num和num2
	B.func2(A);		//使用友元类中的函数输出num和num2
}


