/********************/继承/************************************************************/
继承：在某一个类的基础上，通过不同的权限派生出一个新的类。这个新的类会包含原基础类的所有成员，并且赋予不同的访问权限。

作用：减少代码量

基础类被称为基类，也被称为父类。
新类被称为派生类，也被称为子类。


权限： public, private, protected

继承权限：
（1） public 继承下，所有成员权限不变；
（2） protected 继承下，基类的公有成员变成保护权限；
（3） private 继承下, 基类的公有和保护成员变成私有权限；
（4）不管哪种继承权限，基类的私有成员复制到派生类中会被隐藏起来，无法访问；
（5）若没有指定继承权限，则默认为 private 继承。

语法规则:
class 派生类类名 : 继承方式  基类类名


继承中构造与析构的调用：
先调用基类构造函数，再调用派生类构造函数。
先调用派生类的析构函数，再调用基类的析构函数。

*基类构造在派生类构造之前，当基类构造函数没有无参构造函数时，必须参数列表初始化基类构造。
*创建一个派生类对象时，会一直找到最开始的基类，然后逐个调用构造函数。析构时会从当前派生类开始，逐个析构所有基类。


/********************/派生类/************************************************************/
一个派生类继承了所有的基类方法，但下列情况除外：
* 基类的构造函数、析构函数和拷贝构造函数。
* 基类的重载运算符。
* 基类的友元函数。

派生类可以访问基类中所有的非私有成员。因此基类成员如果不想被派生类的成员函数访问，则应在基类中声明为 private 。


派生类中调用基类的成员方式：
（1）派生类对象才可以访问基类的保护成员，而派生类类型的指针等不能直接调用基类 protected 的成员方法。
（2）如果派生类中没有同名成员，那么派生类对象可以直接访问基类成员。
（3）如果派生类中有同名成员，那么它继承的来自基类的同名成员会被隐藏（也称覆盖），
	 此时必须通过基类类名加作用域的方法访问，否则将访问到派生类自己的成员。
（4）当基类中的成员方法与派生类的成员方法同名时，会隐藏掉基类中的该成员方法和它的所有重载函数。
（5）基类中的私有成员，可以通过基类的公有成员方法调用。


static 修饰的成员被类的所有对象公用。
如果派生类中没有 static 的同名成员属性，那么他们公用同一块 static 内存空间。
如果派生类中有同名 static 成员属性，那么他们不是公用同一块 static 内存。

一般情况下，不要在派生类中重定义与已有的 static 成员同名的成员，防止调用时出错。


/********************/多继承/************************************************************/
多继承：一个派生类可以同时有多个基类，它继承了

class 派生类类名 : 继承方式 基类1, 继承方式 基类2 ...
{
	<派生类类体>
};

多继承时，基类构造的调用顺序与创建派生类时声明的基类顺序相同, 析构时与声明的基类顺序完全相反。

构造调用顺序：基类1-- 基类2-- 基类N-- 派生类
析构调用顺序：派生类-- 基类N-- 基类2-- 基类1


多继承时多个基类出现同名变量，会产生歧义，只能通过类名 + 作用域的方式访问成员。


/********************/虚继承/************************************************************/
菱形继承 : 多继承时的多个基类有来自同一个基类的成员属性，那么这个成员属性会产生二义性。

解决办法：虚继承

class 派生类名 : virtual 继承权限 基类名
{
	<派生类类体>
};


虚继承原理：
虚继承时，派生类中会创建一个虚指针，该虚指针指向内核中的一张虚表，虚表中会存放派生类的成员属性与成员方法的名称与内存地址。
虚指针会随着派生继续继承下去。
当发生多继承时，如果虚表中存在相同的属性名称与内存地址，则不会再创建新的同名变量。
当多继承的时候，虚继承的基类构造函数只会调用一次。

虚基类：虚继承的基类


/********************/继承实例/************************************************************/
#include <iostream>

using namespace std;


class Base {
public:
	int a;
protected:
	int b;
private:
	int c;
};

//a和b是保护成员，即再次继承情况下，a和b还是可以访问的
class B :protected Base {
public:
	void seta(int n) {
		a = n;
	}

	void setb(int n) {
		b = n;
	}

	/* void setc(int n){
		c = n;
	} */
};

class dataB : public B {
public:
	void setab()
	{
		a = 200;
		b = 300;
	}
};

int main()
{
	cout << "sizeof(B)=" << sizeof(B) << endl;

	B  P;

	//P.a = 100;//a在B中是保护成员，无法直接访问
	P.seta(100);//a可以通过公有成员访问


	//P.b = 100;//b在B中是保护成员，无法直接访问
	P.setb(100);//b可以通过公有成员访问

	//P.c = 100;//c在B中是私有成员，无法直接访问
	//P.setc(100);//c在基类中是私有成员，派生类无法直接访问

	//dataB是公有继承，基类中的成员权限不变
	//可以通过公有方法访问a和b，说明B类中a和b是保护成员
	dataB  Q;
	Q.setab();
}



/********************/多继承实例/************************************************************/
#include <iostream>

using namespace std;

class BaseA {
public:
	int num;
};

class BaseB {
public:
	int num;
};

class Data :public BaseA, public BaseB {
public:
};

int main()
{
	Data P;
	cout << "sizeof(Data)=" << sizeof(Data) << endl;
	//P.num = 100; 直接访问出错，有2个num;

	P.BaseA::num = 100;
	P.BaseB::num = 9;

	cout << "P.BaseA::num = " << P.BaseA::num << endl;
	cout << "P.BaseB::num = " << P.BaseB::num << endl;
}



/********************/虚继承实例/************************************************************/
#include <iostream>

using namespace std;

class Base {
public:
	int num;
};

//虚继承
class DataA :virtual public Base {
public:
	//创建虚指针
};

class DataB :virtual public Base {
public:
	//创建虚指针
};

class Total :public DataA, public DataB {
public:
};

int main()
{
	Total P;
	cout << "sizeof(DataA)=" << sizeof(DataA) << endl;

	cout << sizeof(Total) << endl;

	P.num = 1;

	cout << "&P.DataA::Base::num = " << &P.DataA::Base::num << endl;
	cout << "&P.DataB::Base::num = " << &P.DataB::Base::num << endl;
}
