/********************/多态/************************************************************/
多态为不同的实体提供统一的接口。

//多态性可以简单的概括为 "一个接口，多种方法"，字面意思为多种形态
//程序在运行时才决定调用的函数，当类之间存在层次结构，并且类之间是通过继承关联时，就会用到多态。
//C++ 多态意味着调用成员函数时，会根据调用函数的对象的类型来执行不同的函数。

函数重载：调用时函数名不变，根据参数特征调用了不同的执行体。
运算符重载：调用时运算符不变，根据重载对象调用了不同的执行体。

静态多态：在程序编译时确定运行的对象。也被称为静态联编。
    表现形式--- 函数重载，运算符重载，模板。
动态多态：在程序运行过程中确定运行的对象。也被称为动态联编。
    表现形式--- 虚函数和重写。


    形成多态必须具备三个条件：
    1、必须存在继承关系；
    2、继承关系必须有同名虚函数；
    3、存在基类类型的指针或者引用，通过该指针或引用调用虚函数。


/********************/虚函数和重写/************************************************************/
虚函数：是在基类中使用关键字 virtual 声明的成员函数，用于被继承时重写。
重写：在派生类中对基类虚函数进行重写，派生类中定义与基类完全一模一样的函数
    (返回值相同, 函数名相同, 参数相同, 执行体不同)


动态多态的原理:
基类中创建虚函数以后，基类会创建一个虚指针指向虚表，并在虚表中存放虚函数。
当派生类对基类的虚函数进行重写以后，派生类的虚函数也会被放入虚表。
当基类的指针或者引用指向派生类对象时，可以通过虚指针，访问到派生类的虚函数。


特性 :
（1）虚指针会通过继承一直传递下去，不管多少个虚函数，都只有1个虚函数表的虚指针。也就是说基类的指针可以直接调用子类的虚函数。
（2）虚函数具有传递性，派生类中重写的虚函数也一定是虚函数。
（3）派生类中的重载函数并不是虚函数, 必须是重写的基类虚函数才是虚函数。



/********************/虚函数和重写实例/************************************************************/
#include <iostream>

using namespace std;


class Base {
public:
    //虚函数
    virtual void func() {
        cout << "Base::func()" << endl;
    }
    //创建一个虚指针 vtabel_ptr

    virtual void test() {

    }
};

class Data :public Base {
public:
    //虚函数具有传递性，派生类中重写的虚函数也一定是虚函数
    void func() {
        cout << "Data::func()" << endl;
    }
    void func(int) {
        cout << "void func(int)" << endl;
    }
};

class Num :public Data {
public:
    void func() {
        cout << "Num::func()" << endl; 
    }
};

int main()
{
    Data P;
    P.func();

    Base* a = &P;
    a->func();
    //a->func(100);

    Base& b = P;
    b.func();

    cout << "sizeof(Base)=" << sizeof(Base) << endl;
    cout << "sizeof(Data)=" << sizeof(Data) << endl;


    Num  Q;
    Base* c = &Q;
    c->func();
}

