/********************/TCP/************************************************************/

无论是什么类型的数据，都得转换为二进制的字节码流才能在网络环境中进行传输。

TCP / IP协议规定，网络数据流应采用大端字节序，即低地址高字节。
发送与接收 IP地址 + 端口号 时，需要将 网络字节序 和 本地字节序 进行转换。


//TCP协议的可靠性，表现在以下方面
1、固定数据块：应用数据被分割成TCP认为最适合发送的数据块。(数据报长度保持不变，这和UDP完全不同)。
2、确认响应：  对于一个收到的请求，将发送一个确认。这个确认通常要延迟几分之一秒。
3、超时重传:   当TCP发出一个段后，它启动一个定时器，等待目的端确认收到这个报文段。如果不能及时收到一个确认, 将重发这个报文段。
4、数据包编号：TCP给发送的每一一个包进行编号, 接收方对数据包进行排序, 把有序数据传送给应用层。（TCP报文段作为IP数据报来传输，IP数据报的大刀可能会失序，因此TCP报文段的到达也可能会失序，如果必要，TCP将对收到的数据进行重新排序）。
5、校验和 :    TCP将保持它首部和数据的检验和。这是一个端到端的检验和，目的是检测数据在传输过程中的任何变化。如果收到段的检验和有差错, TCP将丢弃这个报文段和不确认收到此报文段。
6、丢弃重复数据：IP数据报会发生重复，TCP的接收端会丢弃重复的数据。
7、流量控制 :    TCP连接的每一方都有固定大小的缓冲空间, TCP的接收端只允许发送端发送接收端缓冲区能接纳的我数据。当接收方来不及处理发送方的数据, 能提示发送方降低发送的速率, 防止包丢失。TCP使用的流量控制协议是可变大小的滑动窗口协议。
8、拥塞控制 :	 当网络拥塞时, 减少数据的发送。

//TCP基本特征
有连接：通信双方需要事先连接成功，方可传输数据
有确认：一方收到对端的任何数据，都会给另一方发回执确认
保证数据有序、不重复、丢失会重发
如果网络拥堵，会自动调节发送量
采用帧异步的流式通信方式（即通信双方每次的收发数据量不必相等


