/********************/重入/************************************************************/

函数重入，或者叫可重入函数。这个其实是一个动态的概念。
可重入函数是指函数可以由多个任务并发使用，而不必担心数据错误。
意思就是可以被中断的函数，该函数可以在任何时刻中断它，并执行另一块代码， 当执行完毕后，回到原本的代码还可以正常继续运行。

//可重入函数特点：
1、不使用全局变量和静态变量。（因为这些变量在多线程环境中是不安全的，除非使用互斥锁）
2、不返回静态数据。（因为多个线程可能同时调用该函数并获取相同的返回值）
3、不使用文件或硬件级别的I / O。（因为这些操作可能会导致线程阻塞或产生竞争条件）
4、使用互斥锁或其他同步机制。
5、返回值通常是函数的局部变量。
6、不调用动态内存分配和释放的函数，如使用了new, malloc等。



/********************/线程安全/************************************************************/
线程安全是指多个线程在并发执行时，一个对象或方法能正确处理来自多个线程的并发访问。

如果一个类在单线程和多线程环境中都能正确工作，那么这个类就是线程安全的。
线程安全问题大多是由全局变量及静态变量引起的，局部变量逃逸也可能导致线程安全问题。 
若每个线程中对全局变量、静态变量只有读操作，而无写操作，一般来说，这个全局变量是线程安全的；
若有多个线程同时执行写操作，一般都需要考虑线程同步，否则的话就可能影响线程安全。

//线程安全包括以下特性
1、原子性：一个操作是不可中断的，要么全部完成，要么不执行。
2、一致性：多个线程同时访问一个数据，一个线程修改数据后，其他线程看到的结果是一致的。
3、隔离性：一个线程对数据的修改，不会影响到其他线程。
4、持久性：一个线程对数据的修改，对其他线程是可见的，并且会持久化到存储器中。



C++类通常是可重入的，例如下面的计数器类是可重入的：

class Counter
{
public:
	Counter() { n = 0; }

	void increment() { ++n; }
	void decrement() { --n; }
	int value() const { return n; }

private:
	int n;
};

但该类不是线程安全的，因为如果多个线程试图修改数据成员n，结果是未定义的。

这是因为++和--运算符并不总是原子的。它们通常扩展为三条机器指令：
①将变量的值加载到寄存器中。
②递增或递减寄存器的值。
③将寄存器的值存储回主内存。

如果线程A和线程B同时加载变量的旧值，递增它们的寄存器，并将其存储回去，它们最终会相互覆盖，并且变量只会递增一次！



显然，访问必须是序列化的：线程A必须执行步骤1、2、3而不中断（原子地），然后线程B才能执行相同的步骤；反之亦然。
使类线程安全的一种简单方法是使用Mutex保护对数据成员的所有访问：

class Counter
{
public:
	Counter() { n = 0; }

	void increment() { unique_lock lck(&mtx); ++n; }
	void decrement() { unique_lock lck(&mtx); --n; }
	int value() const { unique_lock lck(&mtx); return n; }

private:
	mutable Mutex mtx;
	int n;
};





