/********************/友元函数和友元类/************************************************************/
引语： protected 与 private 成员是不允许类外访问的，派生类中也无法访问基类的私有成员。
	   但如果特殊情况需要用到他们，那么可以通过设置友元函数来实现调用。

友元函数：声明在类内部，定义在类外部，但不属于类的成员函数。其有权访问类的所有私有(private)成员和保护(protected)成员。不能用 const 修饰。

友元类：声明在类内部，定义在类外部，其整个类及其所有成员函数都是目标类的友元函数，都可以访问目标类中的非公有成员。

* 友元函数和友元类虽然声明在类内，但却不属于类的成员。因此它没有 this 指针，不受当前类访问修饰符的影响，也不会被继承下去。


关键字 friend:
friend + 友元函数 / 友元类

三种情况：
（1）普通函数作友元
（2）其它类的成员函数作当前类的友元函数，声明时需要加上作用域
（3）类作友元


特点：
（1）友元函数和友元类可以调用原本没有权限的类中的成员，但破坏了类的封装性。
（2）友元关系是单向的，不具有交换性。
（3）友元关系不能传递，例如：B是A的友元，C是B的友元，则不能说明C时A的友元。
（4）一个函数可以是多个类的友元函数。
（5）友元函数的声明会在头文件的预处理过程中被全部声明完毕。
（6）在实际使用过程中，往往是一个.hpp文件存一个单独的类。
（7）在单独一个.cpp文件中使用时，需要注意类与友元的声明和定义顺序。



/********************/实例/************************************************************/
#include <iostream>

using namespace std;


class Data
{
	friend void func(Data& P);		//友元函数声明
	friend class Data2;				//友元类声明

public:
	Data(int n)
	{
		num = n;
		num2 = n * 2;
	}
protected:
	int num2;
private:
	int num;
};

//普通函数作友元
// 请注意：func() 不是任何类的成员函数，但因为func()是data的友元函数，它可以直接访问该类的任何成员
void func(Data& P)
{
	//访问时需要加上作用域
	cout << P.num << endl;
	cout << P.num2 << endl;
}

//类作友元
class Data2
{
public:
	void func2(Data& PP)
	{
		cout << PP.num << endl;
		cout << PP.num2 << endl;
	}
};

int main()
{
	Data A(100);		//定义类data的对象A
	Data2 B;			//定义友元类data的对象B

	func(A);			//使用友元函数输出num和num2
	B.func2(A);			//使用友元类中的函数输出num和num2
}



/********************/内联函数/************************************************************/

内联函数：在类定义中的定义的函数都是该类的内联函数，即使没有使用 inline 说明符。

内联函数在编译时，编译器会把该函数的代码副本放置在每个调用该函数的地方。

inline int Max(int x, int y)
{
	return (x > y) ? x : y;
}

int main()
{

	cout << "Max (20,10): " << Max(20, 10) << endl;
	cout << "Max (0,200): " << Max(0, 200) << endl;
	cout << "Max (100,1010): " << Max(100, 1010) << endl;
	return 0;
}


内联函数：

Tip： 只有当函数只有 10 行甚至更少时才将其定义为内联函数.

机制: 当函数被声明为内联函数之后, 编译器会将其内联展开, 而不是按通常的函数调用机制进行调用。

优点 : 当函数体比较小的时候, 内联该函数可以令目标代码更加高效.对于存取函数以及其它函数体比较短, 性能关键的函数, 鼓励使用内联.

缺点 : 滥用内联将导致程序变慢.内联可能使目标代码量或增或减, 这取决于内联函数的大小.内联非常短小的存取函数通常会减少代码大小, 但内联一个相当大的函数将戏剧性的增加代码大小.现代处理器由于更好的利用了指令缓存, 小巧的代码往往执行更快。

结论 : 一个较为合理的经验准则是, 不要内联超过 10 行的函数.谨慎对待析构函数, 析构函数往往比其表面看起来要更长, 因为有隐含的成员和基类析构函数被调用!

另一个实用的经验准则 : 内联那些包含循环或 switch 语句的函数常常是得不偿失(除非在大多数情况下, 这些循环或 switch 语句从不被执行).

有些函数即使声明为内联的也不一定会被编译器内联, 这点很重要; 比如虚函数和递归函数就不会被正常内联.
通常, 递归函数不应该声明成内联函数.(递归调用堆栈的展开并不像循环那么简单, 比如递归层数在编译时可能是未知的, 大多数编译器都不支持内联递归函数).虚函数内联的主要原因则是想把它的函数体放在类定义内, 为了图个方便, 抑或是当作文档描述其行为, 比如精短的存取函数.

