/********************/C++标准库/************************************************************/
C++ 标准库可以分为两部分：

① 标准函数库：这个库是由通用的、独立的、不属于任何类的函数组成的。函数库继承自 C 语言。
② 面向对象类库：这个库是类及其相关函数的集合。

C++ 标准库包含了所有的 C 标准库，为了支持类型安全，做了一定的添加和修改。


/********************/标准函数库/************************************************************/
标准函数库分为以下几类：

① 输入 / 输出 I / O
② 字符串和字符处理
③ 数学
④ 时间、日期和本地化
⑤ 动态分配
⑥ 其他
⑦ 宽字符函数


/********************/面向对象类库/************************************************************/
标准的 C++ 面向对象类库定义了大量支持一些常见操作的类，比如输入 / 输出 I / O、字符串处理、数值处理。面向对象类库包含以下内容：

① 标准的 C++ I / O 类
② String 类
③ 数值类
④ STL 容器类
⑤ STL 算法
⑥ STL 函数对象
⑦ STL 迭代器
⑧ STL 分配器
⑨ 本地化库
⑩ 异常处理类
⑪  杂项支持库


/********************/STL标准模板库/************************************************************/
C++官方有提供一些标准的模板库与模板类，用来简化运算。

标准模板库 STL（Standard Template Library），是 C++ 标准库的一部分，不需要单独安装，只需要#include 头文件。


STL是一套功能强大的 C++ 模板类，提供了通用的模板类和模板函数。
这些模板类和函数可以实现多种流行和常用的算法和数据结构，如向量、链表、队列、栈。


STL标准模板库的核心包括以下三个组件：

组件	            描述
容器（Containers）	容器就是一些常用的数据结构体的模板类。如向量、链表、队列、栈。
算法（Algorithms）	算法作用于容器。就是容器类的方法，如初始化、排序、搜索、转换、取首元素等操作。
迭代器（iterators）	迭代器的本质也是一个模板类。迭代器用于遍历容器，相当于指针用于遍历数据结构。指针属于迭代器的一种。


这三个组件都带有丰富的预定义函数，帮助我们通过简单的方式处理复杂的任务。



/********************/STL标准库实例/************************************************************/
下面的程序演示了向量容器（一个 C++ 标准的模板），它与数组十分相似，唯一不同的是，向量在需要扩展大小的时候，会自动处理它自己的存储需求：

#include <iostream>
#include <vector>
using namespace std;

int main()
{
    // 创建一个向量存储 int
    vector<int> vec;
    int i;

    // 显示 vec 的原始大小
    cout << "vector size = " << vec.size() << endl;

    // 推入 5 个值到向量中
    for (i = 0; i < 5; i++) {
        vec.push_back(i);
    }

    // 显示 vec 扩展后的大小
    cout << "extended vector size = " << vec.size() << endl;

    // 访问向量中的 5 个值
    for (i = 0; i < 5; i++) {
        cout << "value of vec [" << i << "] = " << vec[i] << endl;
    }

    // 使用迭代器 iterator 访问值
    vector<int>::iterator v = vec.begin();
    while (v != vec.end()) {
        cout << "value of v = " << *v << endl;
        v++;
    }

    return 0;
}
当上面的代码被编译和执行时，它会产生下列结果：

vector size = 0
extended vector size = 5
value of vec[0] = 0
value of vec[1] = 1
value of vec[2] = 2
value of vec[3] = 3
value of vec[4] = 4
value of v = 0
value of v = 1
value of v = 2
value of v = 3
value of v = 4
关于上面实例中所使用的各种函数，有几点要注意：

push_back() 成员函数在向量的末尾插入值，如果有必要会扩展向量的大小。
size() 函数显示向量的大小。
begin() 函数返回一个指向向量开头的迭代器。
end() 函数返回一个指向向量末尾的迭代器。


