/********************/关键字/************************************************************/
register 关键字 
作用：修饰寄存器变量，将变量存储在寄存器中，以提高访问效率。
如果变量被高频繁使用，编译器也会自动将变量存储在寄存器中。

注意点1：
//用register关键字修饰的变量,尽量不要进行取地址操作
//虽然寄存器也是有地址的,但是该地址是硬件地址,并不是内存地址,
//取地址符是对内存进行操作的,但是寄存器是位于CPU的,并不属于内存.

注意点2：
//并且,用register关键字修饰的变量只是尽量放入寄存器当中,
//并不能保证每次都能成功,因为寄存器的数量是有限的.




volatile 关键字
作用 ：强制访问内存，防止编译器优化。
从外部接收的数据要经过内存，送入CPU的寄存器中，CPU从寄存器中读取数据并处理。
而加入 volatile 关键字后，数据将无需送入寄存器，由CPU直接从内存中读取数据并处理。

使用场景 ：对于数据比较敏感的场合，例如单片机某些模块当中，避免更新数据不及时...



/********************/C++11其它特性/************************************************************/

auto 关键字
C语言的auto关键字在定义时需要指定类型，可不赋值。C++的auto关键字在定义时可不指定类型由编译器自动判断，但必须赋初值。


decltype 关键字
decltype关键字可以用于求表达式的类型
总结：
1.	auto忽略顶层const，decltype保留顶层的const
2.	对引用操作，auto推出原有类型，decltype推出引用类型
3.	对解引用操作，auto推出原有类型，decltype推出引用类型
4.	auto推断会实际执行，decltype不会执行，只做分析



lambda表达式
[捕获] <模板形参>(可选)(C++20) (形参) 说明符(可选) 异常说明 attr->ret requires(可选)(C++20) { 函数体 }

1.[捕获capture] :捕获列表
捕获列表总是出现在lambda函数的开始位置，[]是lambda引出符
编译器根据该引出符判断，接下来是否为lambda函数
捕获列表能够捕捉上下文中的变量以供lambd函数使用
捕获列表由0个或者多个捕获项组成，
如果是多个捕获项中间用逗号隔开
以下是捕获列表的形式：
a.[var] 表示值传递，捕获变量var的值
b.[=]表示值传递
c.[&]或者[&val]表示地址传递或者引用传递
d.[=, &a, &b]表示以引用传递的方式捕获变量a和b的值，
其他的以值传递的方式进捕捉获取
e.[&, a, this]表示值传递的方式捕获a和this
其他的以引用传递的方式进行捕捉获取(包含父作用域)、
备注：父作用域是指包含lambda语句块
2. (形参)
参数列表，可选项，与普通的函数的参数列表是一致，如果不需要参数传递，
可以连括号一起省略
3. Mutable：
Mutable修饰符，默认情况下，lambda函数总是一个const函数
Mutable可以取消常量性，可以lamdba函数修改参数的值
4.->return_type
返回值类型，可选项，用于追踪返回值类型形式的声明，获取返回值类型结果
如果不需要返回值，可以将符号“->”一起省略
5. { 函数体 }
函数体，内容和写法和普通函数一致
6. 异常说明
Exception attr异常属性，可选
综上所述：在lambda表达式中，只有捕获列表和函数体以外，其他都是可选



C++11 新特性：
1、auto智能类型  2、nullptr空地址  3、for遍历容器
4、lambda表达式  5、右值引用
5、override 表示重写基类的虚函数，修饰在虚函数之后
final表示禁止重写基类的虚函数，修饰在虚函数之后

