/********************/register&& volatile 关键字/************************************************************/
register 关键字
作用：修饰寄存器变量，将变量存储在寄存器中，以提高访问效率。
如果变量被高频繁使用，编译器也会自动将变量存储在寄存器中。

注意点1：
//用register关键字修饰的变量,尽量不要进行取地址操作
//虽然寄存器也是有地址的,但是该地址是硬件地址,并不是内存地址,
//取地址符是对内存进行操作的,但是寄存器是位于CPU的,并不属于内存.

注意点2：
//并且,用register关键字修饰的变量只是尽量放入寄存器当中,
//并不能保证每次都能成功,因为寄存器的数量是有限的.


/************************************************************/
volatile 关键字
作用 ：强制访问内存，防止编译器优化。
从外部接收的数据要经过内存，送入CPU的寄存器中，CPU从寄存器中读取数据并处理。
而加入 volatile 关键字后，数据将无需送入寄存器，由CPU直接从内存中读取数据并处理。

使用场景 ：对于数据比较敏感的场合，例如单片机某些模块当中，避免更新数据不及时...



/********************/新基础类型/************************************************************/
long long	    8字节
C99中已有该类型，而C++中到C++11才加入该类型
值后缀LL


//UTF编码类型
char16_t	  2字节
char32_t	  4字节
值前缀u或U



/********************/nullptr/************************************************************/
NULL在C语言中是(void*)0。 void 类型的指针都可以被转化为其他任何指针类型
#define NULL (void*)0

而在C++中是0。由于函数重载的存在，因此不支持如C语言般的隐式转换将 void* 转为其它类型指针
// lmcons.h中定义NULL的源码  
#ifndef NULL  
#ifdef __cplusplus  
#define NULL    0  
#else  
#define NULL    ((void *)0)  
#endif  
#endif


//模拟nullptr的实现
const
class nullptr_t
{
public:
	template<class T>           operator T* () const { return 0; }
	template<class C, class T>  operator T C::* () const { return 0; }
private:
	void operator& () const;
} nullptr_t = {};
#undef NULL  
#define NULL nullptr_t 


/************************************************************/
nullptr 是一个纯右值，而创建的对象是一个左值
std::nullptr_t null1;
cout << &null1 << endl;				//可取地址，是一个左值



/********************/auto&& decltype 关键字/************************************************************/
auto 关键字
C语言的 auto 关键字在定义时需要指定类型，可不赋值。
C++的 auto 关键字在定义时类型由编译器自动判断，但必须赋初值。


在作为函数返回值类型时，还需要指定返回值类型，如：
auto someFunc(int i, double j) -> std::string;				//等价于 std::string someFunc(int i, double j);


在函数模板中，返回类型取决于参数类型，上边这种写法就会有很大作用，因为你很有可能并不知道进行某种操作后自己会得到什么类型，请看下例：
template<typename T, typename V>
auto addWithTwoTypes(T t, V v) -> decltype(t + v)
{
	return t + v;
}


在C++14中，编译器可以直接推断出函数的返回值类型：
auto someFunc(int i, double j)		//自动推断返回类型为std::string
{
	return std::to_string(i + j);
}


auto 的限制
1、 auto 不能在函数的参数中使用。
2、 auto 不能作用于类的非静态成员变量（也就是没有 static 关键字修饰的成员变量）中。
3、 auto 不能用于定义数组
4、 auto 不能用于模板调用时的传入参数

auto 其它用法
1、 用于定义迭代器，减少冗长的代码
2、 用于泛型编程，可以在模板的定义或 Lambda 表达式中使用 auto 关键字
3、 C++20中 auto 可用于函数形参


/************************************************************/
decltype 关键字
decltype 关键字可以用于求表达式的类型.是"declare type"的缩写，译为“声明类型”
decltype(exp) 会推导exp（表达式）的类型并替换掉整个"decltype(exp)"
例如：decltype(10.8) x = 5.5;		//x 被推导成了 double

注意： exp推导结果不能为 void

总结：
1.	auto 忽略顶层const，decltype 保留顶层的const
2.	对引用操作， auto 推出原有类型， decltype 推出引用类型
3.	对解引用操作， auto 推出原有类型， decltype 推出引用类型
4.	auto 推断会实际执行， decltype 不会执行，只做分析



/********************/override && final 关键字/************************************************************/
重载(overload)
重写(override)
隐藏(overwrite)	派生类出现基类同名函数时，参数不同时，基类函数会被隐藏；参数相同时，若为虚函数则是重写，否则也会隐藏。

在重写函数后面加上 override 能使编译器检查函数重写，避免重写函数时在派生类中打错函数名、参数等却难以察觉的问题。

final 关键字：
1、与 override 相反，在虚函数后面加上 final 表明该虚函数不允许被重写。
2、 final 声明类，在类定义的类名后面加上 final 表明该类不允许被继承。



/********************/列表初始化/************************************************************/
C++11可以使用{}进行列表初始化
尤其可以对各种容器进行初始化

int x = { 5 };							//拷贝初始化
int x1{ 8 };								//直接初始化
std::vector<int> x2 = { 1,2,3,4,5 }；
std::vector<int> x3{ 1,2,3,4,5 }；
std::list<int> x4 = { 1,2,3,4,5 }；
std::set<int> x5 = { 1,2,3,4,5 };
std::map<int> x6 = { "a",1 }, { "b",2 }, { "c",3 };

支持列表初始化的前提条件：支持std::initializer_list<>为形参的构造函数，即在构造函数中为其逐个添加赋值


C++20中可进行指定成员初始化，如下
struct Point
{
	int x;
	int y;
};
Point p{ .x = 4, .y = 2 };

但指定初始化有以下要求：
1、必须是一个聚合类型
2、数据成员必须是非静态数据成员
3、数据成员最多只能初始化一次
4、非静态数据成员的初始化必须按声明的顺序进行
5、针对联合体中的数据成员只能初始化一次，不能同时指定
6、不能嵌套指定初始化数据成员
7、一旦使用指定初始化就不能混用其他方法对数据成员初始化了
8、禁止对数组使用指定成员初始化


/************************************************************/
默认初始化
可以在类定义中直接使用等号或{}进行设定默认初值，代替在构造函数中赋值
可以有效减少具有多个带参构造函数时的赋值代码冗余



/********************/委托构造函数/************************************************************/
某个类型的一个构造函数可以委托同类型的另一个构造函数对对象进行初始化，
前者称为委托构造函数，后者称为代理构造函数，
在代理构造函数执行完毕后，再执行委托构造函数的函数体。

语法：即在委托构造函数的列表初始化位置直接传参调用代理构造函数。如下：

class X
{
public:
	X() :X(0, 0.) {}
	X(int a) :X(a, 0.) {}
	X(double b) :X(0, b) {};
	X(int a, double b) :a_(a), b_(b) { CommonInit(); }
private:
	void CommonInit() {}
	int a_;
	double b_;
};


注意：
* 如果在代理构造函数执行完成后，委托构造函数主体抛出异常，则自动调用该类型的析构函数。
* 如果一个构造函数为委托构造函数，那么其初始化列表里就不能对数据成员和基类进行初始化。

重要用法：可以将委托构造函数设计成函数模板，减少构造函数的编写。



/********************/继承构造函数/************************************************************/
当继承基类时，派生类需要编写与基类一致的构造函数，派生类构造函数代码显得多余。
此时可以使用 using 将基类的构造函数引入到派生类中（过去的标准中 using 只能引入普通函数）。代码如下;

class Base
{
public:
	Base() : x_(0), y_(0.) {};
	Base(int x, double y) : x_(x), y_(y) {}
	Base(int x) : x_(x), y_(0.) {}
	Base(double y) : x_(0), y_(y) {}
private:
	int x_;
	double y_;
};

class Derived : public Base
{
public:
	using Base::Base;
};

注意：
* 派生类不会继承基类的默认构造函数和拷贝构造函数
* 继承构造函数不会影响派生类默认构造函数的隐式声明
* 在派生类中声明形参相同的构造函数会禁止继承相应的构造函数
* 派生类继承多个形参相同的构造函数会导致编译失败
* 继承构造函数的基类构造函数不能为私有



/********************/右值引用/************************************************************/
左值引用只能引用左值，如下;
int a = 10;
int& b = a;			//正确，左值引用可以引用左值
int& c = 20;			//报错，左值引用不能引用右值
const int& d = 20;		//正确，常量左值引用可以引用常量

右值引用可以引用右值，如下;
int&& e = 30;			//正确，右值引用可以引用右值
int&& f = a;			//错误，右值引用不能引用左值

右值引用可以延长右值的生命周期

当右值引用作为函数参数时，传入的实参也应为一个右值


/************************************************************/
移动语义
使用右值引用可以实现移动语义：例如拷贝构造时，当被拷贝的对象是一个右值（临时对象）时，能够将右值的资源直接移动到目标对象中，提高效率。

意义：移动语义主要用来解决大对象（如标准库容器）从函数返回时深拷贝代价过大的问题。


/************************************************************/
万能引用
当右值引用作为模板形参时，其既可以是一个左值引用，也可以是一个右值引用，因此称为万能引用。
template<class T>
void bar(T&& t) {}			//t为万能引用

折叠引用规则（不同引用类型叠加后的推导规则）
类模板型		T实际类型		最终类型
T& R			R&
T& R& R&
T& R&& R&
T&& R			R&&
T&& R& R&
T&& R&& R&&

万能引用可以实现 std::forward 的完美转发。


/************************************************************/
左值是指那些在表达式执行结束后依然存在的数据，也就是持久性的数据；
右值是指那些在表达式执行结束后不再存在的数据，也就是临时性的数据。
有一种很简单的方法来区分左值和右值，对表达式取地址，如果编译器不报错就为左值，否则为右值。

左值可以转换为右值，如下 :
1、使用 static_cast<>();
int i = 0;
int&& m = i;						//编译失败
int&& n = static_cast<int&&>(i);		//编译成功
2、使用std::move()
static_cast<std::remove_reference<decltype(arg)>::type&&>(arg)



/********************/内联命名空间与嵌套命名空间简化/************************************************************/
inline namespace 内联命名空间只能作用于子命名空间
当父命名空间使用 inline 定义的子命名空间成员时，可以无需用作用域符号::声明子命名空间直接使用。

嵌套命名空间简化
简化前：
namespace Space1 {
	namespace Space2 {
		namespace Space3 {
			//代码声明
		}
	}
}

简化后：
namespace Space1::Space2::Space3 {
	//代码声明
}



/********************/默认和删除函数/************************************************************/
当自定义带参构造函数或析构函数后，编译器将不会自动添加无参构造和析构函数。
此时可在类中声明 classname() = default;	使编译器仍生成无参构造函数
另外可在类中声明 ~classname() = delete; 使编译器不生成默认析构函数。也可用于其它默认函数，如拷贝运算符"="的重载函数。



/********************/Lambda表达式/************************************************************/
lambda表达式
[捕获] <typename T可选> (形参) 说明符可选 异常说明可选->返回值可选 { 函数体 }

1.[捕获capture] :捕获列表
捕获列表总是出现在lambda函数的开始位置，[]是lambda引出符
编译器根据该引出符判断，接下来是否为lambda函数
捕获列表能够捕捉上下文中的变量以供lambda函数使用
捕获列表由0个或者多个捕获项组成，多个捕获项中间用逗号隔开
以下是捕获列表的形式：
a.[var] 表示值传递，捕获变量var的值
b.[=]表示值传递
c.[&]或者[&val]表示地址传递或者引用传递
d.[=, &a, &b]表示以引用传递的方式捕获变量a和b的值，其他的以值传递的方式进捕捉获取
e.[&, a, this]表示值传递的方式捕获a和this
其他的以引用传递的方式进行捕捉获取(包含父作用域)、
备注：父作用域是指包含lambda语句块

2. (形参)参数列表，可选项，与普通的函数的参数列表是一致，如果不需要参数传递，可以连括号一起省略
3. Mutable			Mutable修饰符，默认情况下，lambda函数总是一个const函数。Mutable可以取消常量性，可以lamdba函数修改参数的值
4.->return_type		返回值类型，如果不需要返回值，可以将符号“->”一起省略
5. { 函数体 }			函数体，内容和写法和普通函数一致
6. 异常说明			Exception attr异常属性，可选

综上所述：在lambda表达式中，只有捕获列表和函数体以外，其他都是可选


示例;
int x = 5;
auto foo = [x](int y)->int { return x * y; };
std::cout << foo(8) << std::endl;


Lambda表达式其它用法：
1、转化为函数指针
2、在stl函数中使用lambda表达式作为stl函数的函数指针参数



/********************/范围 for 循环/************************************************************/
该特性隐藏了迭代器的初始化、比较和更新过程

for (范围声明 : 范围表达式)

范围声明是一个变量的声明，其类型是范围表达式中元素的类型或元素类型的引用。
范围表达式可以是数组或者是对象，对于对象必须满足以下2个条件中的任意一个：
* 对象类型定义了begin和end的成员函数
* 定义了以对象类型为参数的begin和end的普通函数

示例1（遍历容器）：
std::map<int, std::string> mymap{ {1, "hello"}, {2, "world"}, {3, "!"} };

for (const auto& e : mymap)
{
	cout << e.first() << " " << e.second() << endl;
}

示例2（遍历数组）：
int arr[] = { 0,1,2,3,4,5 };

for (auto e : arr)
{
	cout << e << endl;
}

一般来说对复杂对象使用引用，对基础类型使用值，这样可以减少对内存的拷贝。
若在循环过程中不会修改引用对象，可以在范围声明中加上 const 修饰符，以帮助编译器生成更加高效的代码。

C++17标准：begin()和end()返回值类型不必相同
C++20标准：范围声明之前可以执行初始化语句，用";"隔开



/********************/ static_assert 静态断言/************************************************************/
#inclide<assert.h>
void assert(int expression);
assert断言一般在debug时使用，触发时会报错并终止程序，一般用在正确的位置如除数不等于零，保证严格部分的合法性。


static_assert 静态断言可在运行前（即编译时）进行指定的语法检查。断言失败会显示丰富的诊断信息，可以在命名空间，类，或代码块中使用。
static_assert(常量表达式，"自定义字符串");		//C++17标准支持单参数static_assert，省略第二参数



/********************/using 定义别名/************************************************************/
using uint_t = unsigned int;				等价于: typedef unsigned int uint_t

同时using可以用于定义模板的别名，而typedef不能，如下：

template <typename Val>
using str_map_t = std::map<std::string, Val>;
// ...
str_map_t<int> map1;


重定义函数指针：
typedef void(*func_t)(int, int);
using func_t = void(*)(int, int);



/********************/强枚举类型/************************************************************/
枚举类型的弊端：
1、枚举类型可以隐式转换为整型（有符号或无符号）
2、无法指定枚举类型的底层类型，此时可能导致一些问题。如 enum e = { a = 0xff }; 在不同编译器中可能是有符号或无符号。

C++11引入强枚举类型，具有三个特性
1、枚举标识符属于强枚举类型的作用域，使用时需要指定作用域
2、枚举类型不会隐式转换为整型
3、能指定强枚举类型的底层类型，底层类型默认为 int 类型

语法：在 enum 后添加关键字 class 即可，使用":"指定底层类型。
enum class School { student, teacher, headmaster };
enum class E : unsigned int { e1 = 1, e2 = 2, e3 = 0xfffffff0 };			//指定底层类型

C++17开始可以对有底层类型的枚举类型对象进行列表初始化，如下;
enum class Color
{
	Red,
	Green,
	Blue
};
int main()
{
	Color c{ 5 };			//编译成功
	Color c1 = 5;			//编译失败
	Color c2 = { 5 };		//编译失败
	Color c3(5);			//编译失败
}

C++20可以使用 using 关键字打开强枚举类型的命名空间使用，如 using class Color;



/********************/聚合类（Aggregate Class）/************************************************************/
聚合类需满足条件
1、无自定义构造函数
2、无 private 或 protected 的数据成员，静态除外
3、无虚函数
4、基类类型必须为 public			//C++11新增条件
5、不能是虚继承				//C++11新增条件


定义Aggregate Classes(聚合类)的意图：
1、用户可以直接访问成员变量
2、可以用特殊的初始化语法



/********************/noexcept/************************************************************/
当语义移动时发生异常，容器可能只移动了一部分，此时新旧两个容器对象都不完整。C++11中引入 noexcept 关键字解决该问题。

noexcept 作为说明符，添加在函数末尾，可以将函数声明为不应抛出异常的函数。若是抛出异常，将自动调用 terminate 函数终止函数。

noexcept 作为运算符，语法: noexcept(表达式)。将返回 true 或 false 表示该表达式是否可以抛出异常。



/********************/thread_local 关键字/************************************************************/
thread_local 关键字用于声明线程局部存储对象。被声明的变量类似于静态变量，但具有线程属性。
该关键字可以解决 全局变量和静态变量 在多线程程序中存在的问题：
例如：errno 原本是一个静态变量，当线程1出现错误时，errno获取信息，此时线程2也出现错误信息，将也会修改errno的信息。因此难以准确获取错误信息。
而C++11之后errno改为线程局部存储变量，便无此问题。

线程局部变量只会被初始化一次，通常在线程销毁时被释放。
线程局部变量定义了变量的生命周期但没有限制访问，因此可以将该变量地址传递给其它线程，在该变量生命周期内可以访问。

static int sv;
thread_local int tv;

int main()
{
	constexpr int* sp = &sv;				//编译成功，sv的地址在编译时确定
	constexpr int* tp = &tv;				//编译失败，tv的地址在运行时确定
}




/********************/constexpr 常量表达式/************************************************************/
int x1 = 42;
const int x2 = x1;				//定义和初始化成功

int x3 = 42;
constexpr int x4 = x3;			//编译失败，x2无法用x1初始化

constexpr int square(int x)		//常量表达式的返回值可以在编译阶段就计算处理，该函数称为常量表达式函数
{
	return x * x;
}

常量表达式函数的规则：C++11
1、函数必须返回一个值，所以它的返回值类型不能是 void
2、函数体必须只有一条语句:  return expr，其中expr必须也是一个常量表达式
3、函数使用前必须有定义
4、函数必须使用 constexpr 声明

常量表达式函数的新规则：C++14
1、函数体允许声明变量，除了没有初始化的变量、 static 变量和 thread_local 变量
2、函数允许出现 if  和 switch 语句，不能使用 go 语句
3、函数允许所有的循环语句，包括 for 、 while 、 do - while
4、函数可以修改生命周期和常量表达式相同的对象
5、函数的返回值可以声明为 void
6、 constexpr 修饰的成员函数不再具有 const 属性

C++17标准：
1、Lambda表达式在条件允许的情况下都会隐式声明为 constexpr
2、 if constexpr (常量表达式)，条件结果一旦确定，编译器将只编译符合条件的代码块。
3、字符串视图：引入了字符串视图类型，用于高效地处理字符串的查看而不进行复制操作，提高性能。

C++20标准：
1、允许常量表达式中使用虚函数 : constexpr virtual int f() const { return 1; }
2、允许在 constexpr 函数中出现 try - catch
3、允许在 constexpr 中更改联合类型的有效成员
4、允许 dynamic_cast 和 typeid 出现在常量表达式中


常量表达式构造函数的规则：
1、构造函数必须使用 constexpr 修饰
2、构造函数初始化列表里必须是常量表达式
3、构造函数的函数体必须为空;

class X
{
public:
	constexpr X() : x1(5) {}
	constexpr X(int i) : x1(i) {}
	constexpr int get() const
	{
		return x1;
	}
private:
	int x1;
};

constexpr X x;
char buffer[x.get()] = { 0 };



/********************/C++11其它特性/************************************************************/
智能指针：引入了 shared_ptr 、unique_ptr 和 weak_ptr 等智能指针类型，提供了更安全和自动化的内存管理。
多线程支持：引入了线程库、原子操作和互斥量等多线程编程的支持，方便编写并发程序。
标准库增强：新的容器类（如unordered_map、array、tuple）、新的算法（如move和emplace）、正则表达式支持
引用限定符：所谓引用限定符，就是在成员函数的后面添加 "&" 或者 "&&"，从而限制调用者的类型（左值还是右值）。
非受限联合体：任何非引用类型都可以成为联合体的数据成员，此时必须提供联合体的构造和析构函数（即使内容为空），这种联合体也被称为非受限联合体。过去只能使用基本类型作为其成员。
默认模板参数： template <typename T = int>
原生字符串：可以在字符串双引号前加"R"，将字符串用小括号包含，则字符串中无需使用转义字符，所见即所得。

C++14其它特性：
1、可以使用以0b作为前缀的二进制数表示整型变量。
2、使用单引号作为整数分隔符，对所有进制整数都有效。
3、初始化列表的返回值：在函数中可以使用初始化列表作为返回值。
4、变量模板：类似于函数模板，可以定义变量模板，使得变量的类型可以根据模板参数自动推断。

C++17其它特性：
1、可以使用以0x作为前缀的十六进制表示浮点数变量。
2、标准库增强：新的容器类（如string_view和optional）、新的算法（如transform_reduce和clamp）、文件系统库等。

C++20其它特性：
1、概念（Concepts）：引入了概念，用于对模板参数进行约束和限定，提供了更清晰和可读性强的模板编程方式。
2、范围的改进：引入了ranges命名空间，提供了丰富的范围操作函数和算法，使得处理容器和范围更加方便和高效。
3、协程：引入了协程机制，使得异步编程更加简洁和直观，可以通过协程关键字和异步操作符来实现协作式的并发。
4、模块：引入了模块化编程的概念，允许将代码划分为逻辑模块，提供了更快的编译速度和更好的代码组织。
5、强制执行：引入了强制执行的机制，用于在函数调用前和调用后对条件进行检查，提供了更强的程序健壮性。
6、标准库的改进：标准库进行了扩展和改进，包括新的容器类（如span和bitset）、新的算法（如std::ranges中的算法）、日期和时间库等。



/********************/ if 和 switch 初始化/************************************************************/C++17
if (init; condition)				//init部分可以进行变量的定义和赋值
{
	//代码块
}

switch (init; condition)
{
	//代码块
}



/********************/结构化绑定/************************************************************/C++17
1、返回多个值（元组）
auto return_multiple_values()
{
	return std::make_tuple(11, 7);
}

int main()
{
	auto [x, y] = return_multiple_values();
	std::cout << "x=" << x << "y=" << y << std::endl;
}

2、绑定到结构体
3、绑定到元组和类元组对象



/********************/inline 扩展/************************************************************/C++17
内联静态成员变量
class X
{
public:
	static const int num{ 5 };				//常量静态成员变量可以在声明时定义赋值
	static int a;						//非常量静态成员变量需要在类外赋值，且赋值语句不能写在头文件中，否则可能被重复包含调用
	inline static int b = 20;				//inline 声明的静态成员变量无上述问题
};

int a = 10;



/********************/三向比较/************************************************************/C++20
bool b = 7 <= > 11 < 0;					//b == true
bool b = 7 <= > 11 < 100;				//编译失败，<=>的返回值只能与0和自身类型比较

返回三种结果:
strong_ordering：表示两个操作数（类型等）相同，可以相互替换
weak_ordering：表示两个操作数（类型等）不同，无法相互替换
partial_ordering

std::strong_ordering::less：如果 a 小于 b，则返回该值；
std::strong_ordering::equal：如果 a 等于 b，则返回该值；
std::strong_ordering::greater：如果 a 大于 b，则返回该值。

std::weak_ordering::less
std::weak_ordering::equal
std::weak_ordering:::greater

std::partial_ordering::less
std::partial_ordering::equal
std::partial_ordering::greater
std::partial_ordering::unordered：表示两个操作数没有任何关系


int main()
{
	int a = 1;
	int b = 2;

	std::strong_ordering result = a <= > b;

	if (result == std::strong_ordering::less)
	{
		std::cout << "a < b" << std::endl;
	}
	else if (result == std::strong_ordering::equal)
	{
		std::cout << "a == b" << std::endl;
	}
	else if (result == std::strong_ordering::greater)
	{
		std::cout << "a > b" << std::endl;
	}
}


/********************/ consteval&& constinit 关键字/************************************************************/C++20
consteval：声明函数必须在编译期就执行计算，否则将会报错。


constinit：检查常量初始化
1、对于具有静态存储持续时间的变量声明上，它要求变量具有常量初始化程序
constinit int x = 11;							//编译成功，全局变量具有静态存储持续
int main()
{
	constinit static int y = 42;				//编译成功，静态变量具有静态存储持续
	constinit static int z = 7;					//编译失败，局部变量是动态分配的
}

2、要求变量具有常量初始化程序
const char* f() { return "hello"; }
constexpr const char* g() { return "cpp"; }
constinit const char* str1 = f();				//编译错误，f()不是一个常量初始化程序
constinit const char* str2 = g();				//编译成功

