/********************/重入/************************************************************/

函数重入，或者叫可重入函数。这个其实是一个动态的概念。
可重入函数是指函数可以由多个任务并发使用，而不必担心数据错误。
意思就是可以被中断的函数，该函数可以在任何时刻中断它，并执行另一块代码， 当执行完毕后，回到原本的代码还可以正常继续运行。

只要是多任务的系统，就存在一个函数执行中被打断，转入OS调度，去执行另一段代码，执行完后再回来执行这个函数。
如果函数使用了系统资源，比如全局变量等，如果被打断的话，就可能会出问题，这种就是不可重入函数。
这类函数是不能运行在多任务环境的。满足下列条件的多数函数，都是不可重入函数：

函数体内使用了静态数据数据结构
调用了动态内存分配和释放的函数，如使用了new, malloc等
函数体内调用了I / O操作。
举一个例子如下代码，使用了全局变量，则这个函数就是一个不可重入的函数。

int  c;
void  swap(int* a, int* b)
{
	c = *a;
	*a = *b;
	*b = c;
}

为什么满足上面条件的函数，大多是不可重入的函数？
在多任务的环境中，中断前后不是都要保存和恢复上下文吗？怎么会出现函数经过中断后变的不可重入了？
原因是，中断确认保存了一些上下文，但仅限于函数返回值地址，CPU寄存器等等少量的栈信息，而函数内部使用的全局变量，buffer等数据区不会被保护。所以放中断发生后，再返回执行，这些数据的值是不确定的，不安全的。
因此可重入函数对应的就是多任务环境下安全的函数。
基于此，编写可重入函数，遵循下面规则：
1、不使用（返回）静态的数据、全局变量（除非用信号量互斥）。
2、不调用动态内存分配、释放的函数。
3、不调用任何不可重入的函数（如标准 I / O 函数）


参考文章：
https://zhuanlan.zhihu.com/p/352218464


C++类通常是可重入的，原因很简单，因为它们只访问自己的成员数据。任何线程都可以调用可重入类的实例上的成员函数，只要没有其他线程可以同时调用该类的同一实例上的成员函数。例如，下面的计数器类是可重入的：
班级计数器。
class Counter
{
public:
	Counter() { n = 0; }

	void increment() { ++n; }
	void decrement() { --n; }
	int value() const { return n; }

private:
	int n;
};

该类不是线程安全的，因为如果多个线程试图修改数据成员n，结果是未定义的。
这是因为++和--运算符并不总是原子的。事实上，它们通常扩展为三条机器指令：
将变量的值加载到寄存器中。
递增或递减寄存器的值。
将寄存器的值存储回主内存。

如果线程A和线程B同时加载变量的旧值，递增它们的寄存器，并将其存储回去，它们最终会相互覆盖，并且变量只会递增一次！


线程安全。
显然，访问必须是序列化的：线程A必须执行步骤1、2、3而不中断(原子地)，然后线程B才能执行相同的步骤；反之亦然。
使类线程安全的一种简单方法是使用QMutex保护对数据成员的所有访问：

class Counter
{
public:
	Counter() { n = 0; }

	void increment() { QMutexLocker locker(&mutex); ++n; }
	void decrement() { QMutexLocker locker(&mutex); --n; }
	int value() const { QMutexLocker locker(&mutex); return n; }

private:
	mutable QMutex mutex;
	int n;
};


QMutexLocker类自动在其构造函数中锁定互斥体，并在函数末尾调用析构函数时将其解锁。
锁定互斥锁可确保来自不同线程的访问将被序列化。互斥体数据成员是用可变限定符声明的，
因为我们需要锁定和解锁value()中的互斥体，这是一个常量函数。

关于Qt类的注记。
许多Qt类是可重入的，但它们并不是线程安全的，因为使它们线程安全会产生重复锁定和解锁QMutex的额外开销。
例如，QString是可重入的，但不是线程安全的。您可以从多个线程同时安全地访问不同的QString实例，
但不能同时从多个线程安全地访问同一个QString实例(除非您自己使用QMutex来保护访问)。
一些Qt类和函数是线程安全的。
这些主要是与线程相关的类(例如，QMutex)和基本函数(例如，QCoreApplication：：PosteEvent())。
注意：多线程领域中的术语并不完全标准化。POSIX使用与其C API稍有不同的可重入和线程安全的定义。
在Qt中使用其他面向对象的C++类库时，请确保理解其定义。