/********************/IO模型/************************************************************/
所谓服务器IO模型，指的是当一个服务端网络程序需要同时处理多个套接字时，采取什么策略去妥善处理它们。

服务端IO模型包括：非阻塞轮询，多任务并发，异步信号，多路复用

//非阻塞轮询
将所有的套接字都设置为非阻塞，就不用担心对端迟迟不发出数据导致本端卡死的问题，
但非阻塞套接字也无法妥善地告知本端程序对端数据究竟何时到达，以至于本端仍需要不断地尝试读取对端数据，这就是非阻塞带来的 轮询 模式。
缺点：在程序运行期间，系统CPU单核利用率达100%，说明程序一直在做无用的循环，白白浪费系统资源，因此轮询的IO方式一般是不被采用的。

//阻塞与非阻塞区别
阻塞 :
函数本身不具备阻塞性，而且因为函数中存在的套接字导致的阻塞性
在默认情况下，在Linux环境中建立的套接字都是具备有阻塞性的 
程序运行到某一位置，需要外界输入软件资源或获取到其他资源才能继续运行下去，称为阻塞模式。

非阻塞 :
给套接字描述符添加一个非阻塞属性      缺点：占用cpu的资源, 损耗大
由于文件添加非阻塞属性，会一直寻找套接字数据是否到达读取位置。
程序对于需要外界输入软件资源的函数不再等待，如果有数据就接收，没数据也继续运行下去。


//多任务并发
就是多线程。


//异步信号驱动
所谓信号驱动，即用信号 SIGIO 来驱使服务器妥善处理多个远端套接字。
思路：每当远端有数据到达，那么就在本端触发信号，然后利用信号的异步特性来处理这些远端信息。

也就是将文件描述符的输入输出(Input / Output)交给信号，每次接收到数据，都是在信号响应函数中运行。
如果有某个文件IO的数据特别重要，重要到需要打断当前进程的运行来优先执行，那么就是用信号异步IO。


由于不管套接字收到何种数据，内核一律触发 SIGIO，因此这种看似很理想的方式，却不适用于 TCP 协议，
因为在 TCP 中，当客户端来连接请求、普通数据、数据回执，甚至是断开请求、断开请求的回执等等情况，都触发一样的信号，
这就使得服务端光凭这一个信号无法知道下一步要做什么，因此信号驱动的服务器模型，一般只适用于UDP协议。

要让 UDP 服务端工作在信号触发模式下，需要依次做如下步骤：
1、设置信号 SIGIO 的响应函数
2、设定信号 SIGIO 的属主进程
3、设定套接字工作在信号模式下


//多路复用
所谓多路复用，指的是通过某个特定的接口（如 select()、poll()、epoll()等），来同时监听多路阻塞IO，
这就达到既无需多进程多线程，又可以同时处理多个阻塞套接字的目的。

就是预先将需要监听的套接字加入到一个集合，然后在规定的时间进行一个无限等待
如果在规定的时间里面，集合里面的套接字没有数据变化，则说明接收数据已经超时, 进入到下一次等待
一旦进入文件描述符的集合数据就会变化，进入来的数据就会接收成功
没有进入文件描述符集合的将剔除集合之外，进入到下一次的等待


对于某套接字 sockfd，其就绪状态有三种：读就绪、写就绪、异常就绪

