/********************/左值与右值/************************************************************/
左值：既能够出现在等号左边，也能出现在等号右边的变量；
右值：只能出现在等号右边的变量。

左值 = 右值，左值与右值的数据类型要匹配，将右值数据赋值给左值对象。



/********************/数据类型/************************************************************/
基本数据类型				占用空间（字节）	格式控制符
char			字符型		1				%c
int			整型			4				%d
short int		短整型		2				%hd
long int		长整型		4/8				%ld
long long int	长长整型		8				%lld
float			单精度浮点型	4				%f
double		双精度浮点型	8				%lf


非基本数据类型
*pointer		指针类型		4/8				%p
void			空类型
bool			布尔类型
__int32		可移植数据类型

构造数据类型
array int arr[5]	数组类型
struct		结构体类型
union		联合体（共用体）
enum		枚举类型 

补充数据类型
unsigned （无符号） 
signed     （有符号）


//注意
1、在没有unsigned的修饰下，编译器，默认数据类型是有符号的，将最高位作为符号位（1表示负数，0表示正数）
2、 long 和 unsigned long 在32位中是4个字节，在64位中是8个字节
3、 * pointer指针类型 在32位中是4个字节，在64位中是8个字节


//实例：以下均以%d格式输出，即：printf("%d\n", a);
char a1 = 127;				//输出127
char a2 = 234;				//输出-22
unsigned char b1 = 127;		//输出127
unsigned char b2 = 234;		//输出234	

char a = 127;				//输出127
char b = 128;				//输出-128
char c = -127;				//输出-127
char d = -128;				//输出-128
char e = -129;				//输出127


//强制类型转换
*C语言中，定点整数是用补码形式存储的。
有符号数转同类型无符号数：若是负数，负号会被解释为数据。如: short->unsigned short [1001(-1) -> 1001(9)]
长整数转短整数：高位截断，保留低位。如: int->short [1001 0001 0000 0001->0000 0001]
短整数转长整数：高位数据位填充0(正数)/1(负数)，同补码移位。如 : short->int[1001 0001->1111 1111 1001 0001]

无损
char->int->long->double
float->double

有损
int->float 可能损失精度
float->int 可能溢出和损失精度


//浮点数
浮点数：小数点位置会有浮动，可以表示更大范围的数据，但会丢失精度。
浮点数在计算机中以 阶码(阶符+数值) + 尾数(数符+数值) 形式储存。（尾数*2^阶码）
阶码：常用补码或移码表示的定点整数
尾数：常用原码或补码表示的定点小数

规格化：尾数算数左移1位，阶码减1。直到尾数最高位是有效值(左规)(1xxx)。右规同理(用于处理溢出)。
*补码表示的尾数规格化时，尾数最高位要与符号位相反。1.0xxx或0.1xxx



/********************/原码反码和补码/************************************************************/
数据存储的形式，都是以二进制的补码形式存放。
原码符号位不能参与运算，补码可以。

正数：原码 == 反码 == 补码
负数：原码是其本身；反码为符号位保持不变，数值位取反；补码，在反码的基础上，最低位加1。（原码补码快速转换：从右往左找到第一个1，1左边的数值位全部取反）

5	原码0000 0101		反码0000 0101		补码0000 0101
-5	原码1000 0101		反码1111 1010		补码1111 1011

补码取补码(取反加1)得到原码。
正数取反(非取反码)加1，得到其负数的补码；负数取反(非取反码)加1，得到其绝对值。

//补码的意义
(1)在有符号数中，+0和-0是不同的：00000001B和10000001B，这在实际应用中可能会带来混淆和复杂性。在补码系统中，+0和-0的表示是相同的（都是全0），从而解决了这个问题。
(2)计算a-b可以转化为计算a加上-b的补码，从而实现了加法和减法的统一处理(符号位也参与运算)。
(3)扩大负数的表示范围
(4)硬件实现简单
(5)易于进行溢出检测


//移码
定义：移码就是阶码的具体数值。
移码=真值-偏置值
偏置值=2^(n-1) n为数据位位数
移码：补码的符号位取反。

当阶码全为0（即其真值-127）时，尾数不全为0，表示非规格化小数 0.xxxx*2^(-126)，即牺牲精度来表示更多的位数。
当阶码全为0（即其真值-127）时，尾数全为0，表示真值+-0
当阶码全为1时，尾数全为0，表示无穷大+-∞
当阶码全为1时，尾数不全为0，表示非数值"NaN"(Not a Number)


//IEEE 754标准
偏置值=2^(n-1)-1
类型						符号		阶码		尾数		总位数
单精度浮点数(float)		1		8		23		32
双精度浮点数(double)		1		11		52		64



//最大值和最小值
原码：-(2^n-1) ≤ x ≤ 2^n-1
反码：-(2^n-1) ≤ x ≤ 2^n-1
补码：    -2^n ≤ x ≤ 2^n-1
移码：    -2^n ≤ x ≤ 2^n-1
无符号整数： 0 ≤ x ≤ 2^(n+1)-1


//整数减法
减去一个数就是加上它的负数，也就是加负数的补码。
有符号数，符号位参与运算。
100 - 50
（100 + （127 - 50 + 1）） - 128			//*127：因为取反后的最大数为1111111，即127。
（100 + （128 - 50）） - 128				//*-128：溢出
（100 + 78） - 128
178 - 128
50
*-128表示进位溢出，即%128。使用位非和溢出代替了减法操作。
*补码的负数=补码的补码：连同符号位一起按位取反并+1。


//小数
小数的原码、反码、补码转换与整数相同

//小数最大值最小值
原码：-(1-2^(-n)) ≤ x ≤ 1-2^(-n)
反码：-(1-2^(-n)) ≤ x ≤ 1-2^(-n)
补码：         -1 ≤ x ≤ 1-2^(-n)

//算数移位
正数都补0
负数
原码补0
反码补1
补码左移补0，右移补1

//原码一位乘法
符号位单独处理
数值位取绝对值进行乘法计算


//浮点数计算
步骤：			1.11*2^5 + 0.01*2^3
1、对阶			1.11*2^5 + 0.0001*2^5		//阶数小的向阶数大的对齐
2、尾数加减		1.1101*2^5
3、规格化		使最高位为有效值(1)
4、舍入			保留有效位，多余的进一或舍弃
5、判溢出		判断阶码是否溢出(尾数溢出未必整体溢出，也许可以通过三四两步来拯救)。上溢则抛出异常(中断)，下溢则按机器0处理。

