/********************/左值与右值/************************************************************/
左值：既能够出现在等号左边，也能出现在等号右边的变量；
右值：只能出现在等号右边的变量。

左值 = 右值，左值与右值的数据类型要匹配，将右值数据赋值给左值对象。



/********************/数据类型/************************************************************/
基本数据类型				占用空间（字节）	格式控制符
char			字符型		1				%c
int			整型			4				%d
short int		短整型		2				%hd
long int		长整型		4/8				%ld
long long int	长长整型		8				%lld
float			单精度浮点型	4				%f
double		双精度浮点型	8				%lf


非基本数据类型
*pointer		指针类型		4/8				%p
void			空类型
bool			布尔类型
__int32		可移植数据类型

构造数据类型
array int arr[5]	数组类型
struct		结构体类型
union		联合体（共用体）
enum		枚举类型 

补充数据类型
unsigned （无符号） 
signed     （有符号）


//注意
1、在没有unsigned的修饰下，编译器，默认数据类型是有符号的，将最高位作为符号位（1表示负数，0表示正数）
2、 long 和 unsigned long 在32位中是4个字节，在64位中是8个字节
3、 * pointer指针类型 在32位中是4个字节，在64位中是8个字节


//实例：以下均以%d格式输出，即：printf("%d\n", a);
char a1 = 127;				//输出127
char a2 = 234;				//输出-22
unsigned char b1 = 127;		//输出127
unsigned char b2 = 234;		//输出234	

char a = 127;				//输出127
char b = 128;				//输出-128
char c = -127;				//输出-127
char d = -128;				//输出-128
char e = -129;				//输出127



/********************/原码反码和补码/************************************************************/
数据存储的形式，都是以二进制的补码形式存放

正数的反码、补码等于原码
负数的原码是其本身；反码为符号位保持不变，数据位取反；补码，在反码的基础上，最低位加1，

5	原码0000 0101		反码0000 0101		补码0000 0101
-5	原码1000 0101		反码1111 1010		补码1111 1011


