/********************/左值与右值/************************************************************/
//定义
左值（内存变量）：既能够出现在等号左边，也能出现在等号右边的变量；
右值（临时值）：只能出现在等号右边的变量。

//位置
左值 = 右值，左值与右值的数据类型要匹配，将右值数据赋值给左值对象。

//特征
左值可以取地址&。具有持久性，可以在赋值操作后继续存在。
右值不能获取地址。通常是临时值或表达式的结果。



/********************/数据类型/************************************************************/
基本数据类型					占用空间（字节）	格式控制符
char			字符型		1				%c
int				整型			4				%d
short int		短整型		2				%hd
long int		长整型		4/8				%ld
long long int	长长整型		8				%lld
float			单精度浮点型	4				%f
double			双精度浮点型	8				%lf


非基本数据类型
*pointer		指针类型		4/8				%p
void			空类型
bool			布尔类型
__int32			可移植数据类型

构造数据类型
array int arr[5]	数组类型
struct				结构体类型
union				联合体（共用体）
enum				枚举类型 

补充数据类型
unsigned   （无符号） 
signed     （有符号）


//注意
1、在没有 unsigned 的修饰下，编译器默认数据类型是有符号的，将最高位作为符号位（1表示负数，0表示正数）
2、 long 和 unsigned long 在32位中是4个字节，在64位中是8个字节
3、 *pointer指针类型 在32位中是4个字节，在64位中是8个字节


//实例：以下均以%d格式输出，即：printf("%d\n", a);
char a1 = 127;				//输出127
char a2 = 234;				//输出-22
unsigned char b1 = 127;		//输出127
unsigned char b2 = 234;		//输出234	

char a = 127;				//输出127
char b = 128;				//输出-128
char c = -127;				//输出-127
char d = -128;				//输出-128
char e = -129;				//输出127


//强制类型转换
*C语言中，整数是用补码形式存储的。
有符号数转同类型无符号数：若是负数，负号会被解释为数据。如: short->unsigned short [1001(-1) -> 1001(9)]
长整数转短整数：高位截断，保留低位。如: int->short [1001 0001 0000 0001->0000 0001]
短整数转长整数：高位数据位填充0(正数)/1(负数)，同补码移位。如 : short->int[1001 0001->1111 1111 1001 0001]

无损
char->int->long->double
float->double

有损
int->float 可能损失精度
float->int 可能溢出和损失精度


//浮点数
浮点数：小数点位置会有浮动，可以表示更大范围的数据，但会丢失精度。
浮点数在计算机中以 阶码(阶符+数值) + 尾数(数符+数值) 形式储存。（尾数*2^阶码）
阶码：常用补码或移码表示的定点整数
尾数：常用原码或补码表示的定点小数

规格化：尾数算数左移1位，阶码减1。直到尾数最高位是有效值(左规)(1xxx)。右规同理(用于处理溢出)。
*补码表示的尾数规格化时，尾数最高位要与符号位相反。1.0xxx或0.1xxx





