/********************/数据类型/************************************************************/
基本数据类型				占用空间（字节）	格式控制符
char			字符型		1				%c
int			整型			4				%d
short int		短整型		2				%hd
long int		长整型		4/8				%ld
long long int	长长整型		8				%lld
float			单精度浮点型	4				%f
double		双精度浮点型	8				%lf


非基本数据类型
*pointer		指针类型		4/8				%p
void			空类型
bool			布尔类型
__int32		可移植数据类型

构造数据类型
array int arr[5]	数组类型
struct		结构体类型
union		联合体（共用体）
enum		枚举类型 

补充数据类型
unsigned （无符号） 
signed     （有符号）


*在没有unsigned的修饰下，编译器，默认数据类型是有符号的，将最高位作为符号位（1表示负数，0表示正数）



/********************/原码反码和补码/************************************************************/
数据存储的形式，都是以二进制的补码形式存放

正数的反码、补码等于原码
负数的原码是其本身；反码为符号位保持不变，数据位取反；补码，在反码的基础上，最低位加1，

5	原码0000 0101		反码0000 0101		补码0000 0101
-5	原码1000 0101		反码1111 1010		补码1111 1011




/********************/unsigned 实例/************************************************************/
#include <stdio.h>

int main()
{
	char a1 = 127;
	char a2 = 234;
	unsigned char b1 = 127;
	unsigned char b2 = 234;

	printf("a1: %d\n", a1);		//输出127
	printf("a2: %d\n", a2);		//输出-22
	printf("b1: %d\n", b1);		//输出127
	printf("b2: %d\n", b2);		//输出234

	return 0;
}



/********************/数据的取值范围 实例/************************************************************/
#include <stdio.h>

int main()
{
	char a = 127;		//输出127
	char b = 128;		//输出-128
	char c = -127;		//输出-127
	char d = -128;		//输出-128
	char e = -129;		//输出127

	printf("a: %d\n", a);
	printf("b: %d\n", b);
	printf("c: %d\n", c);
	printf("d: %d\n", d);
	printf("e: %d\n", e);

	return 0;
}