/********************/运算符优先级/************************************************************/
优先级		运算符
1			[]   ()   .   ->   后缀++   后缀--					//括号、成员
2			前缀++   前缀--   sizeof   &   ^   +   -   ~   !		//前缀、自增减
3			强制类型转换								//强转
4			*   /   %									//乘除取余
5			+   -										//算术加减
6			<<   >>									//左右移位
7			<   <=   >   >=							//比大小
8			==   !=									//等于不等于
9			&										//位与
10			^										//位异或
11			|										//位或
12			&&										//与
13			||										//或
14			? :										//三目
15			=  ^=  /=  %=  +=  -=  <<=  >>=  &=  ^=  |=	//赋值
16			,										//逗号

//口诀
括号和成员
强转前缀自加减
乘除取余 算术加减
左右移位比大小
等于不等于
位与异或或与或
三目赋值和逗号


//注意
1、python中，非与或在比大小后面
2、取余（% ）号两边必须为整数


//sizeof()运算符
1、 sizeof() 运算符：计算数据在内存中所占字节数
2、 不使用 sizeof 求数据类型的字节大小：#define mysizeof(value) (char*)(&value + 1) - (char*)(&value)
3、 sizeof(a++)		对于 sizeof 只会求所占内存大小，不会进行表达式运算。执行后 a 还是原值。
4、 sizeof(void)		VS2021报错，Ubuntu为1且警告



/********************/逻辑运算符/************************************************************/
逻辑与	&&
逻辑或	||
逻辑非	！

*短路求值：&& 在前项不符合要求情况下不进行后项的判断和执行， || 在前项符合要求情况下不进行后项的判断和执行。



/********************/位运算符/************************************************************/
位与		&		两个位都为1时，结果才为1
位或		|		两个位都为0时，结果才为0
位异或	^		两个位相同为0，相异为1
位非		~		0变1，1变0
左移		<<		全部左移若干位，高位丢弃，低位补0
右移		>>		各二进位全部右移若干位，对无符号数高位补0，有符号数，有的补符号位（算术右移），有的补0（逻辑右移）


//交换a与b的值
a=a^b;
b=a^b;
a=a^b;

