/********************/左值与右值/************************************************************/
左值与右值：左值指既能够出现在等号左边，也能出现在等号右边的变量；右值则是只能出现在等号右边的变量。

左值 = 右值，左值与右值的数据类型要匹配，将右值数据赋值给左值对象。



/********************/宏库/************************************************************/
va_list 、va_start、 va_arg、 va_end



/********************/printf()/************************************************************/
源码



/********************/scanf()/************************************************************/
源码



/********************/格式控制符/************************************************************/
格式字符		意义
%a, %A		十六进制浮点数（C99 新增）。//实例 printf("pi=%a\n", 3.14); 输出 pi = 0x1.91eb86p+1。
%d			十进制有符号整数（正数不输出正号）
%o			八进制无符号整数（不输出前缀0）
%x, %X		十六进制无符号整数（不输出前缀0x）
%u			十进制无符号整数
%f			小数形式单、双精度实数
%e, %E		指数形式单、双精度实数
%g, %G		以%f或%e中较短的输出宽度输出单、双精度实数
%c			单个字符
%s			字符串
%p			指针地址
%lu			32位无符号整数
%llu			64位无符号整数



/********************/转义字符/************************************************************/
转义字符		释义
?			在书写连续多个问号时使用，防止他们被解析成三字母词
\`			用于表示字符常量`
\"			用于表示一个字符产内部的双引号
\\			用于表示一个反斜杠，防止它被解释为一个转义序列符
\a			警告字符，蜂鸣
\b			退格符
\f			进纸符
\n			换行
\r			回车
\t			水平制表符
\v			垂直制表符
\ddd			ddd表示1~3个八进制的数字。如：\130X
\xdd			dd表示2个十六进制数字。如 : \x30 0

