/********************/顺序结构/************************************************************/
默认结构：从main开始，到return结束


/********************/分支结构/************************************************************/
if
else if
else if
else



switch (表达式)
{
case 常量一: /*语句一*/; break;
case 常量二: /*语句二*/; break;
case 常量三: /*语句三*/; break;
default:
}
①case 后的必须是整型常量，可以是一个范围，a 。。。 b，空格不可省略
②default的位置没有固定，如果放在case语句之前，需要加上break;
③switch语句中的表达式或者变量，必须是整型



/********************/循环结构/************************************************************/
①while
②do - while:先执行一次循环体
③for


for (初始表达式；逻辑表达式；补充表达式)
{

}

初值表达式：只在循环开始前执行一次
逻辑表达式：在每次循环开始前都会执行一次
补充表达式：在每次循环结束后执行一次


for (;;) 与 while (1) 相同，是一个死循环


//关键字
break	跳出整个 for / while / switch 循环，只能跳一层
continue	用于跳出 for / while 的单次循环，进入下一次循环
goto		无条件跳转到标签位置（使用场景：代码调试阶段可以适当使用；用于驱动）