/********************/顺序结构/************************************************************/
默认结构：从main开始，到return结束


/********************/分支结构/************************************************************/
if-else

switch ()
{
case 条件一: /*语句一*/; break;
case 条件二: /*语句二*/; break;
case 条件三: /*语句三*/; break;
default:
}
①case 后的必须是整型常量
②default的位置没有固定，如果放在case语句之前，需要加上break;
③switch语句中的表达式或者变量，必须是整型
④case后的常量可以是一个范围，a 。。。 b，空格不可省略



/********************/循环结构/************************************************************/
①while
②do - while:先执行一次循环体
③for


for (初始表达式；逻辑表达式；补充表达式)
{

}

初值表达式
逻辑表达式
补充表达式