/********************/数组/************************************************************/
数组（array）：数组是在内存中连续存储的具有相同类型的一组数据的集合。（特点：连续内存，具体长度，相同类型）

//数组初始化
全部初始化为0：
int a[10] = { 0 };
char str[10] = "\0";			//等价于char str[10]={0};

初始化为其他值：
int a[10] = { 0,1,2,3,4,5,6,7,8,9 };
char str[10] = "Hello";		//也可以写成char str[10]={'H','e','l','l','o','\0'}

如果初始化列表包含数组a的所有元素，可以省略数组的长度：
int a[] = { 0,1,2,3,4,5,6,7,8,9 };

多维数组在计算机中也是线性存储的，因此下面两种写法等价：
int a[2][5] = { {0,1,2,3,4},{5,6,7,8,9} };
int a[2][5] = { 0,1,2,3,4,5,6,7,8,9 };

只给一部分元素赋值，没有被初始化的元素自动为 0：
int a[5] = { 1, 2 };

//注意
1、如果数组不作初始化，那么各个元素的值就不是0了，所有元素都是垃圾值。
2、你也不能写成" int a[5] = {}; "，那就是极其严重的语法错误


//柔性数组
结构体中的最后一个元素允许是未知大小的数组，这就叫作柔性数组，柔性数组就是对一块空间实现动态开辟。
struct st_type
{
	int i;
	int a[0];	//柔性数组成员,也可以写int a[];
};

特点：
1、结构体中柔性数组成员前面必须至少有一个其他成员
2、sizeof返回的这种结构大小不包括柔性数组的内存
3、包含柔性数组成员的结构用malloc()等函数进行内存的动态分配，并且分配的内存应该大于结构的大小，以适应柔性数组的预期大小

相比于指针的优点：
1、方便内存释放：释放内存时不需要先释放内部指针，避免了内存泄漏
2、加快访问速度：连续的内存有益于提高访问速度，也有益于减少内存碎片


//变长数组
c99标准中，新增了可变长度数组：Variable - length array(VLA)；c11中VLA变为可选项，不是语言必备的特性。
“变”指的是：在创建数组时，可以使用变量指定数组的长度，而非指可以修改已创建数组的大小。一旦创建了变长数组，它的大小则保持不变。

特点：
1、只能是局部变量数组
2、不能在定义的时候进行初始化
3、必须是自动存储类别，即不能使用 extern 或 static 存储类别说明符
4、不等于动态数组（柔性数组），本质还是静态数组，也就是说，数组的长度在变量的整个生命周期中是不可变的
5、由于变长数组只能是局部变量，且必须是自动存储类别，因此变长数组分配在栈上
6、对于多维数组也适用（如array[a][b] ）


//数组传参
#include <stdio.h>
// void show_array(int a[10])			//数组原型
// void show_array(int len, int a[])		//柔性数组，没有规定数组的具体长度
// void show_array(int len, int a[len])	//变长数组
void show_array(int len, int* a)		// 指针类型，编译器所使用的，
{
	for (int i = 0; i < len; i++)
		printf("arr[%d]: %d\n", i, a[i]);
}

int main()
{
	int arr[10] = { [0 ... 4] = 666,[9] = 123 };
	show_array(10, arr);
	return 0;
}



/********************/二维数组/************************************************************/
使用指针变量访问二维数组的任意一个元素的方法：

//1.使用列指针：定义一个列指针p，让它指向二维数组的第0个元素
int a[3][4];
int* p;
p = &a[0][0];		//因为a[0]是第0行的数组名，所以p=&a[0][0]相当于p=a[0]，因为a[i][j]前面共有i*4+j个元素

该二维数组的任意i行j列元素可表示为* （p + i * 4 + j）。

//2.使用行指针：定义一个行指针p, 让它指向二维数组的第0行
int a[3][4];
int(*p)[4];
p = a;			//也可以为p=&a[0];   

其中* (*(p + i) + j)表示任意一个i行j列的元素。

