/********************/指针/************************************************************/
//指针辨析
int* p[5];			指针数组，是一个存放5个指向 int 类型指针的数组
int(*p)[5];			数组指针，是一个指向存放5个 int 类型数组的指针
int* (*p)[5];		指针数组指针，是一个指向存放5个 int 类型指针的数组的指针
int** p;			二级指针，是一个指向指针的指针
int* p(char);		指针函数，是一个返回值为 int 类型指针的函数，p是函数名
int (*p)(char);		函数指针，是一个指向参数为 char 类型、返回值为 int 类型的指针

指针的类型：把指针声明语句里的指针名 p 去掉，剩下的部分就是这个指针的类型。
指针所指向的类型：把指针声明语句中的指针名和指针声明符 *p 去掉，剩下的就是指针所指向的类型。


//指针和数组的关系
数组名代表着数组的首地址，其实可以看作一个指针。
int array[10] = { 0,1,2,3,4,5,6,7,8,9 }, value;
value = array[0]; //也可写成：value=*array;
value = array[3]; //也可写成：value=*(array+3);

*指针加减一个整数，其移动的位数是以指针所指类型为单位计算的。


//成员运算符
p->a 等价于(*p).a


//回调函数（callback）
回调函数就是作为其它函数参数的函数。其它函数以函数指针方式调用它。
匿名函数（lambda表达式）就是一种回调函数。

返回类型(*函数指针名称)(参数列表);
int (*callback)(int, int);


//回调函数实例
int add(int a, int b)
{
	return a + b;
}

void printsum(int (*fun)(int, int))
{
	int sum = fun(1, 2);
	printf("%d", sum);
}

void main()
{
	printsum(add);
}

//回调函数实例：使用typedef简化函数类型
typedef int(*callfun)(int, int);

int add(int a, int b)
{
	return a + b;
}

void printsum(callfun addfun)
{
	int sum = addfun(1, 2);
	printf("%d", sum);
}

void main()
{
	printsum(add);
}


//二级指针
二级指针是一级指针的指针，存放一级指针的地址。
二级指针q是指针p的地址，* q是a的地址，** q是a的值，& q是q自己的地址。
int a = 10;
int* p = &a;
int* q = &p;



/********************/函数指针/************************************************************/
#include <stdio.h>

int func_sum(int a, int b)
{
	return a + b;
}

int main()
{
	// 函数的调用原理：
	// 根据函数的《入口地址》去执行相应的函数
	// 函数名就是函数的入口地址
	int c1 = func_sum(100, 200);
	printf("c1: %d\n", c1);

	int (*p1)(int, int) = func_sum;
	int c2 = p1(101, 200);
	printf("c2: %d\n", c2);

	// 假设已知某个函数的入口地址是：0x000000FF，
	int (*p2)(int, int) = 0x000000FF;
	int c3 = p2(100, 200);
	int c3 = 0x000000FF(100, 200);
	return 0;
}



/********************/字符串/************************************************************/
在 C 语言中，字符串实际上是使用空字符 \0 结尾的一维字符数组。因此，\0 是用于标记字符串的结束。

由于在数组的末尾存储了空字符 \0，所以字符数组的大小比实际的有效字符数大1。


#include <string.h>

size_t	这是无符号整数类型，它是 sizeof 关键字的结果。

strcpy(s1, s2);		//复制字符串 s2 到字符串 s1。
strcat(s1, s2);		//连接字符串 s2 到字符串 s1 的末尾。
strlen(s1);			//返回字符串 s1 的长度。
strcmp(s1, s2);		//如果 s1 和 s2 是相同的，则返回 0；如果 s1<s2 则返回小于 0；如果 s1>s2 则返回大于 0。
strchr(s1, ch);		//返回一个指针，指向字符串 s1 中字符 ch 的第一次出现的位置。
strstr(s1, s2);		//返回一个指针，指向字符串 s1 中字符串 s2 的第一次出现的位置。

