/********************/结构体/************************************************************/
关键字 struct

//注意
结构体类型声明时可以同时定义变量，声明结束需要带分号";"。

//内存对齐
类型数据所占空间必须是成员变量中字节最大的整数倍；每个变量类型的偏移量必须是该变量类型的整数倍

//为什么需要内存对齐
由编译器在编译阶段完成，旨在提高数据存取速度。
如32Bit字长的CPU，对这类型的CPU取4个字节的数要比取一个字节要高效，也更方便。
因此在结构体中每个成员的首地址都是4的整数倍的话，取数据元素时就会相对更高效，这就是内存对齐的由来。

//对齐规则
1、结构体(struct)或联合体(union)的数据成员，需要进行内存对齐，以其中最大的成员为基准（且需凑满4或8个字节）
2、在数据成员完成各自对齐之后，结构(或联合)本身也要进行对齐

//预编译命令#pragmapack(n)
每个特定平台上的编译器都有自己的默认“对齐系数”(也叫对齐模数)。
程序员可以通过预编译命令#pragmapack(n)，n = 1, 2, 4, 8, 16来改变这一系数，其中的n就是你要指定的"对齐系数"。
当#pragmapack的n值等于或超过所有数据成员长度的时候，这个n值的大小将不产生任何效果。



/********************/结构体初始化与传参/************************************************************/
#include <stdio.h>
#include <string.h>

// 构造一个结构体模板（声明一种结构体类型）
struct stu {
	int id; 		// 成员1：学号
	char name[32];	// 成员2：姓名
	char sex;		// 成员3：性别
};

// 地址传递
void show_info(struct stu* show)
{
	printf("ID\t Name\t Sex\t Score\n");//打印表头
	for (int i = 0; i < 3; i++)
	{
		// printf("%d\t %s\t %c\t %.1f\n", 
		// show->id, show->name, show->sex, show->score);
		// show++;
		printf("%d\t %s\t %c\t %.1f\n",
			(show + i)->id,
			(show + i)->name,
			(show + i)->sex,
			(show + i)->score);

	}
}

int main()
{
	// 现在数组元素的类型为结构体类型
	struct stu your_class[50] = {
		{1, "jack", 'm', 90.5},			// 数组的第一个元素
		{2, "Rose", 'w', 85.5},		// 数组的第二个元素
		{3,	"Tom",	'm', 81}
	};

	//指定成员初始化
	struct stu my_class[50] = {
		{
			.id = 1,
			.name = "Jack",
			.sex = 'm',
		},
		{
			.id = 2,
			.name = "Rose",
			.sex = 'w',
		},
		{
			.id = 3,
			.name = "Tom",
			.sex = 'm',
		}
	};
	show_info(my_class);
	// show_info(my_class+1);
	return 0;
}



/********************/联合体/************************************************************/
联合体(union)中的所有成员共用其中占内存最大的数据成员大小的内存。


//union判断大小端序
union(联合体)可以用于判断大小端序
	大端序：高位放低地址，低位放高地址（8位一组）
	小端序：高位放高地址，低位放低地址（8位一组）

union {
	int i;
	char c;
} u;

u.i = 1;				// 在大多数系统中，int型为4字节，这里赋值为1（即0x00000001
						// 如果系统是小端序，那么u.c将存储int的最低有效字节，即0x01  
						// 如果系统是大端序，那么u.c将存储int的最高有效字节，即0x00
printf("%d", u.c);		// 输出：1	（x86、x64、arm都是小端序）


