/********************/枚举/************************************************************/
enum 变量自动从0开始计值，若某位有赋值，则后面的都为前面的值 + 1。值可以重复;



/********************/预处理指令/************************************************************/
在源码中，以#开头的语句，被称为预处理指令，他们不属于c语言语法

//（一）宏定义：#define
#define PI 3.14		//宏名一般使用全大写字母，以区分普通变量、函数。因为其不属于c语言语法，所以不用写分号

优点：
1、提升代码的可阅读性
2、使得代码更方便修改
3、提高程序运行效率

//带参宏（宏函数）
使用场合：子函数代码比较少，调用频繁，可以使用带参宏来代替。带参宏只发生替换，并没有像子函数正真的发生调用、执行、返回。
补充：使用带参宏（宏函数）需要注意优先级，++，--可能会多次操作，如果宏函数有多行，需要使用反斜杠\连接
#define max(a,b) \
		({\
			int _a = a; \
			int _b = b; \
			(_a) > (_b) ? (_a) : (_b); \
		})


//（二）条件编译（类似于分支结构）
#if #ifdef #ifndef #elif #else #endif

条件编译可以通过编译指令去控制调试语句，实际上是控制语句是否参与编译


//（三）头文件
<>表示包含系统头文件，“”表示包含自定义头文件


