/********************/枚举/************************************************************/
enum 变量自动从0开始计值，若某位有赋值，则后面的都为前面的值 + 1。值可以重复;

枚举类型默认为整型，可以指定其它类型，如下。

// 使用 char 类型的枚举，可以节省内存
enum Week : char {   
	Sunday = 1,
	Monday,
	Tuesday,
	Wednesday
};


//枚举与位操作
枚举常常和位操作一起使用，尤其是在处理标志位时。例如：

#include <stdio.h>

enum Flags {
    FLAG_A = 1 << 0,  // 0001
    FLAG_B = 1 << 1,  // 0010
    FLAG_C = 1 << 2   // 0100
};

int main() {
    int flag = FLAG_A | FLAG_C;  // 设置 FLAG_A 和 FLAG_C

    if (flag & FLAG_A) 
        printf("FLAG_A is set.\n");

    if (flag & FLAG_B) 
        printf("FLAG_B is set.\n");

    if (flag & FLAG_C) 
        printf("FLAG_C is set.\n");

    return 0;
}



/********************/预处理指令/************************************************************/
在源码中，以#开头的语句，被称为预处理指令，他们不属于c语言语法

//（一）宏定义：#define
#define PI 3.14		//宏名一般使用全大写字母，以区分普通变量、函数。因为其不属于c语言语法，所以不用写分号
#undef PI           //取消宏定义


//带参宏（宏函数）
使用场合：子函数代码比较少，调用频繁，可以使用带参宏来代替。带参宏只发生替换，并没有像子函数正真的发生调用、执行、返回。
补充：使用带参宏（宏函数）需要注意优先级，++，--可能会多次操作，如果宏函数有多行，需要使用反斜杠\连接
#define max(a,b) \
		({\
			int _a = a; \
			int _b = b; \
			(_a) > (_b) ? (_a) : (_b); \
		})


//（二）条件编译（类似于分支结构）
#if 
#ifdef 
#ifndef 
#elif 
#else 
#endif

条件编译可以通过编译指令去控制调试语句，实际上是控制语句是否参与编译


//（三）头文件
<> 通常用于包含 标准库头文件 或者其他系统级的头文件。
编译器会首先在预定义的系统目录中查找这个头文件。系统目录通常是编译器的安装路径或者操作系统提供的库目录。

"" 通常用于包含 用户自定义的头文件。
编译器首先会在当前代码文件的所在目录中查找指定的头文件。如果没有找到，编译器会继续按照和 <> 相同的方式在系统目录中查找。


