/********************/Linux内存布局/************************************************************/

Linux的内存分布：（以下按高地址到低地址）

//内核空间

//栈区
向下增长，由编译器自动分配释放，存放局部变量、形参、返回值。
Linux系统为例，默认的栈空间大小是8MB，这意味着每个线程的栈空间大小上限为8MB。Windows中为2MB。

//映射区
存储动态链接库以及调用mmap函数的文件映射

//堆区
向上增长，由程序员分配和释放。
malloc：申请size字节的堆空间							  //分配一块未初始化的内存，需要手动初始化
calloc：申请n*memb* size字节的堆空间，返回一个数组指针。 //会将分配的内存初始化为零
realloc：重新申请一块size字节的堆空间					  //需要手动初始化
free：释放堆空间										  //需要手动指向NULL

//全局(静态)区
包括.bss段 和.data段，存放全局变量和静态变量
（1）未初始化 或 初始化为0 的 全局变量 和 静态变量 存放在.bss段。
（2）已初始化的 全局变量 和 静态变量 存放在.data段。
（3）未初始化的变量默认赋值为0

//常量区(.rodata)
存放字符串、数字、const修饰的全局变量。

//代码区(.text)
1、存放程序执行的代码，其值不能修改（若修改则会出现错误）。
2、字符串常量和define定义的常量也有可能存放在代码区。



/********************/内存管理/************************************************************/

//野指针
定义：是指向地址不确定的指针。
产生原因：释放内存之后指针没有及时置空，或是定义时没有赋值的指针变量。

//不可访问区域
不可访问区域：例如定义一个指针p, int* p = NULL; 之后不能对p进行使用，因为p的地址为NULL，即0x0000 0000, 该地址属于保留区即不可访问区。
不可访问内存：是指一组没有任何可访问指针指向的由计算机程序进行动态分配的内存块。就是内存泄漏。

//段错误
段错误不属于语法错误，编译器不会提示，出现的原因一般是非法操作内存（访问空指针 nullptr 、访问野指针、访问越界、栈溢出、访问权限错误）
解决办法：在关键位置，添加打印语句，找出错误的代码行


//在1G内存的计算机中能否malloc(1.2G)？为什么？
有可能，因为malloc是相进程申请虚拟内存，与物理地址空间没有直接关系



/********************/内存溢出/************************************************************/
//内存溢出定义
内存溢出是指应用系统中存在无法回收的内存或使用的内存过多，最终使得程序运行要用到的内存超出系统能提供的最大内存。

通常分为堆溢出和栈溢出

//堆溢出原因
1、函数递归调用过深
2、分配了过大的局部变量
3、堆的尺寸设置的太小

//栈溢出的原因
1、分配了过多的内存，导致堆空间用尽
2、动态申请空间过多，使用之后没有释放（内存泄漏）
3、越界访问堆内存
4、栈的尺寸设置的太小


//内存越界
内存越界：向系统申请了一块内存，而在使用的时候超过了申请的范围，常见的如数组访问越界。内存越界是导致段错误的常见原因之一。


//内存泄漏
内存泄漏：申请的内存不使用之后并没有释放。或者说，指向申请的内存的指针又指向别的地方，导致找不到申请的内存。

后果：随着程序运行时间越长，占用内存越多，最终用完内存，导致系统崩溃


//如何减少内存泄漏
1.申请的内存使用完毕后立即释放
2.将分配的内存的指针以链表的形式自行管理，使用之后从链表中删除，程序结束时可以检查该链表
3.使用智能指针
4.使用常见插件，ccmalloc
