/********************/Linux内存布局/************************************************************/

Linux的内存分布：（以下按高地址到低地址）

//内核空间

//栈区
向下增长，由编译器自动分配释放，存放局部变量、形参、返回值。
Linux系统为例，默认的栈空间大小是8MB，这意味着每个线程的栈空间大小上限为8MB。Windows中为2MB。

//映射区
存储动态链接库以及调用mmap函数的文件映射

//堆区
向上增长，由程序员分配和释放。
malloc：申请size字节的堆空间
calloc：申请n*memb* size字节的堆空间，返回一个数组指针。
realloc：重新申请一块size字节的堆空间
free：释放堆空间

//全局(静态)区
包括.bss段 和.data段，存放全局变量和静态变量
（1）未初始化 或 初始化为0 的 全局变量 和 静态变量 存放在.bss段。
（2）已初始化的 全局变量 和 静态变量 存放在.data段。
（3）未初始化的变量默认赋值为0

//常量区(.rodata)
存放字符串、数字、const修饰的全局变量。

//代码区(.text)
1、存放程序执行的代码，其值不能修改（若修改则会出现错误）。
2、字符串常量和define定义的常量也有可能存放在代码区。



/********************/内存管理/************************************************************/

//野指针
定义：是指向地址不确定的指针。
产生原因：释放内存之后指针没有及时置空，或是定义时没有赋值的指针变量。

//不可访问区域
不可访问区域：例如定义一个指针p, int* p = NULL; 之后不能对p进行使用，因为p的地址为NULL，即0x0000 0000, 该地址属于保留区即不可访问区。
不可访问内存：是指一组没有任何可访问指针指向的由计算机程序进行动态分配的内存块。就是内存泄漏。

//段错误
段错误不属于语法错误，编译器不会提示，出现的原因一般是非法操作内存（访问不可访问区域， 访问越界，内存溢出......）
解决办法：在关键位置，添加打印语句，找出错误的代码行



//在1G内存的计算机中能否malloc(1.2G)？为什么？
有可能，因为malloc是相进程申请虚拟内存，与物理地址空间没有直接关系



