/********************/字符串/************************************************************/
在 C 语言中，字符串实际上是使用空字符 \0 结尾的一维字符数组。因此，\0 是用于标记字符串的结束。

由于在数组的末尾存储了空字符 \0，所以字符数组的大小比实际的有效字符数大1。


#include <string.h>

size_t	这是无符号整数类型，它是 sizeof 关键字的结果。

strcpy(s1, s2);		//复制字符串 s2 到字符串 s1。
strcat(s1, s2);		//连接字符串 s2 到字符串 s1 的末尾。
strlen(s1);			//返回字符串 s1 的长度。
strcmp(s1, s2);		//如果 s1 和 s2 是相同的，则返回 0；如果 s1<s2 则返回小于 0；如果 s1>s2 则返回大于 0。
strchr(s1, ch);		//返回一个指针，指向字符串 s1 中字符 ch 的第一次出现的位置。
strstr(s1, s2);		//返回一个指针，指向字符串 s1 中字符串 s2 的第一次出现的位置。
