/********************/GCC编译器/************************************************************/

//简述C++从代码到可执行二进制文件的过程
预处理、编译、汇编、链接
预编译：这个过程主要的处理操作如下：
（1）将所有的#define删除，并且展开所有的宏定义
（2）处理所有的条件预编译指令，如#if、#ifdef
（3）处理#include预编译指令，将被包含的文件插入到该预编译指令的位置。
（4）过滤所有的注释
（5）添加行号和文件名标识
编译：这个过程主要的处理操作如下：
（1）词法分析：将源代码的字符序列分割成一系列的记号。
（2）语法分析：对记号进行语法分析，产生语法树。
（3）语义分析：判断表达式是否有意义。
（4）代码优化：
（5）目标代码生成：生成汇编代码。
（6）目标代码优化
汇编：这个过程主要是将汇编代码转变成机器可以执行的指令。
链接：将不同的源文件产生的目标文件进行链接，从而形成一个可以执行的程序


//🔧 链接阶段主要做了什么？
步骤								说明
① 符号解析（Symbol Resolution）	找出所有外部符号（函数、变量）在其它目标文件或库中的定义
② 重定位（Relocation）			确定每个目标文件中代码和数据的最终地址，并修正代码中地址相关的地方
③ 合并段（Section Merging）		比如把所有.text 段合并成一个代码段，.data 段合并成一个数据段
④ 生成可执行文件 / 库文件			最终生成.exe（Windows）、无扩展名文件（Linux 可执行程序）或.so / .dll / .a 等


//指令
预处理：gcc hello.c –o hello.i –E
编译：gcc hello.i –o hello.s –S
汇编：gcc hello.s –o hello.o –c
链接：gcc hello.o –o hello –lc –lgcc(-lxxx:表示链接xxx库，l:library)


gcc 常见参数编译选项
- E 预处理
- S 编译
- c 汇编
- o 指定生成
- l 指明使用的库对象 - lm 指明数学库
- L 指明使用的库位置
- I 指明头文件所在位置
- Wall  严格编译


//gcc编译器有什么作用？
将代码文本编译为机器能识别的二进制指令

//经过哪个步骤后，代码不能直接阅读？
汇编

//对代码的语法检查（提示错误的行号）属于哪一个步骤？
编译

//为什么代码漏写函数，gcc编译时，不提示出现错误的行号？
因为函数链接定位在链接的阶段，不在编译阶段，因为编译器是一行一行进行编译的，所以哪一行有问题，就会将行号打印


