/********************/register/************************************************************/
register 寄存器 关键字

作用：将变量存储在寄存器中（即CPU），以提高访问效率。
编译器通常会自动优化变量存储位置，如果变量被高频繁使用，编译器也会自动将变量存储在寄存器中。因此 register 已经几乎被淘汰。

//注意：
1、 register 变量不能进行取地址操作，并且只能是整数。虽然寄存器也是有地址的，但是该地址是硬件地址，并不是内存地址。
2、不能保证每次都能成功将 register 变量放入寄存器当中，因为寄存器的数量是有限



/********************/volatile/************************************************************/
volatile  易变 关键字

对于某些变量（比如硬件寄存器、共享变量等），它们的值可能随时被外部修改（例如通过中断或多线程），
如果编译器只使用寄存器中的缓存值，程序可能无法获得正确的结果。

//作用
1、每次访问变量时都必须从内存读取最新的值，而不是使用寄存器中缓存的旧值。
2、禁止对该变量进行读写优化。

//注意
1、std::atomic 确保变量的 内存可见性 和 顺序一致性，比 volatile 更适合多线程环境，并且具有更好的跨平台兼容性和更明确的语义。
2、 volatile 只保证变量每次都从内存读取，但不提供原子性。这意味着多线程中仍可能发生数据竞争，因此它无法代替锁（std::mutex）或原子操作。

//使用场景
1、对于数据比较敏感的场合，例如单片机某些模块当中，避免更新数据不及时
2、多线程使用共享变量：因为多线程是多核操作，同时进行。但要避免同时写入。
3、中断：中断程序会修改其他程序中使用的变量
4、硬件寄存器：因为寄存器随时会被修改，好比AD转换的寄存器，随时会因为电压变化而修改
5、外部任务会修改变量



/********************/extern/************************************************************/
extern 外部 关键字

//作用
（1）声明外部变量和函数：说明该变量或函数是在其他文件中定义，可以使用。数据保存在数据段中；
（2） extern "C":在c++中调用c语言代码，告诉编译器这部分代码要是有C编译，避免函数名被 C++ 修饰（编译器导入导出符号不一致）。
（3） const 变量默认是内部链接的，无法直接用 extern 声明跨文件共享。需要显式声明：定义时也需要加 extern 修饰。

extern 的核心功能是 在链接阶段帮助解析全局符号引用，让不同编译单元共享变量或函数的定义。



/********************/typedef/************************************************************/
typedef 原始类型 新名称
typedef 的意思是给一个已经存在的数据类型取一个别名，而不是定义新的数据类型。



/********************/static/************************************************************/
static 为声明静态变量，主要有修饰变量和修饰函数的作用。

//作用
1、修饰局部变量：放在静态区.data段中，只会初始化一次，并且函数结束后其内存不会被释放。
2、修饰全局变量：使该变量只在当前文件中可用。
3、修饰函数：使该函数只在当前文件中可用。



/********************/const/************************************************************/
const 修饰只读变量，变量一旦赋初值就不能被修改。编译器不为只读变量分配内存，这使得它的效率也很高。

//作用
1、修饰常量变量：使该变量的值不可修改
2、修饰指针：使指针的指向或指针指向的内存数据不可修改
const int*			//指针的指向不可修改
int* const			//指针指向的内存数据不可修改
const int* const	//都不可修改
3、修饰函数参数或返回值：使对应变量的值不可修改


