/********************/register/************************************************************/
register 寄存器 关键字

作用：将变量存储在寄存器中（即CPU），以提高访问效率。
如果变量被高频繁使用，编译器也会自动将变量存储在寄存器中。

//注意：
1、该值不能取地址操作，并且只能是整数。虽然寄存器也是有地址的，但是该地址是硬件地址，并不是内存地址，因此无法进行取地址操作。
2、不能保证每次都能成功将 register 变量放入寄存器当中，因为寄存器的数量是有限

	

/********************/volatile/************************************************************/
volatile  易变 关键字

作用 ：修饰经常存取的变量，使编译器不对该变量进行优化，每次取值必须从内存中取值而不是直接去取之前在寄存器中的值
从外部接收的数据要经过内存，送入CPU的寄存器中，CPU从寄存器中读取数据并处理。
而加入 volatile 关键字后，数据将无需送入寄存器，由CPU直接从内存中读取数据并处理。

//使用场景
1、对于数据比较敏感的场合，例如单片机某些模块当中，避免更新数据不及时
2、多线程使用共享变量：因为多线程是多核操作，同时进行
3、中断：中断程序会修改其他程序中使用的变量
4、硬件寄存器：因为寄存器随时会被修改，好比AD转换的寄存器，随时会因为电压变化而修改
5、外部任务会修改变量



/********************/extern/************************************************************/
extern 外部 关键字	

（在链接阶段调用声明的内容）
用于说明该变量或函数是在其他文件中定义，可以使用。
（1）声明外部变量：保存在数据段中；
（2）声明外部函数：保存在数据段中；
（3） extern "C":在c++中调用c语言代码，告诉编译器这部分代码要是有C编译



/********************/typedef/************************************************************/
typedef 的意思是给一个已经存在的数据类型取一个别名，而不是定义新的数据类型。



/********************/static/************************************************************/
static 为声明静态变量，主要有修饰变量和修饰函数的作用。



/********************/const/************************************************************/
const 修饰只读变量，变量一旦赋初值就不能被修改。编译器不为只读变量分配内存，这使得它的效率也很高。





