/********************/宏定义/************************************************************/
在源码中，以#开头的语句，被称为预处理指令，他们不属于c语言语法
（一）宏定义：define
#define PI
定义了一个宏，名称叫做PI，宏名一般使用全大写字母，用以区分普通变量、函数，因为其不属于c语言语法，所以不用写分号
#define PI 3.14
给3.14取了一个名称为PI，或者有一个字符PI，内容为3.14，
好处：提高操作效率，提升代码的可阅读性
带参宏（宏函数）
使用场合：子函数代码比较少，调用频繁，可以使用带参宏来代替，带参宏只发生替换，并没有像子函数正真的发生调用、执行、返回，
补充：使用带参宏（宏函数）需要注意优先级，++，--可能会多次操作，如果宏函数有多行，需要使用反斜杠\连接
总结：宏定义的作用有三个，
1.使代码更具可读性，2.使得代码更方便修改，3.提高程序运行效率
（二）条件编译（类似于分支结构）
#if #ifdef #ifndef #elif #else #endif
注意：#if与#endif同时出现

在编译的时候，加上 - DXXX， - D就是#define, XXX是宏定义
总结：条件编译可以通过编译指令去控制调试语句，实际上是控制语句是否参与编译
（三）头文件
练习：使用条件编译，控制某段代码是否加入编译

如果没有定义_INC_STRING（这个宏），则执行操作（#define _INC_STRING）

<>表示包含系统头文件，“”表示包含自定义头文件
头文件前加上条件编译后，在预处理文本中只有一个，原理：第一次使用的时候，没有这个头文件，会定义，第二次使用的时候，已经定义了，就不会再定义，这样可以避免头文件中的内容重复加入编译，
在一个文件中，只要使用到函数，就需要添加函数对应的头文件，#define后有1，1表示不让编译器优化


