/********************/register/************************************************************/
register 关键字
作用：修饰寄存器变量，将变量存储在寄存器中，以提高访问效率。
如果变量被高频繁使用，编译器也会自动将变量存储在寄存器中。

注意点1：
//用register关键字修饰的变量,尽量不要进行取地址操作
//虽然寄存器也是有地址的,但是该地址是硬件地址,并不是内存地址,
//取地址符是对内存进行操作的,但是寄存器是位于CPU的,并不属于内存.

注意点2：
//并且,用register关键字修饰的变量只是尽量放入寄存器当中,
//并不能保证每次都能成功,因为寄存器的数量是有限的.



/********************/volatile/************************************************************/
volatile 关键字
作用 ：强制访问内存，防止编译器优化。
从外部接收的数据要经过内存，送入CPU的寄存器中，CPU从寄存器中读取数据并处理。
而加入 volatile 关键字后，数据将无需送入寄存器，由CPU直接从内存中读取数据并处理。

使用场景 ：对于数据比较敏感的场合，例如单片机某些模块当中，避免更新数据不及时...




9、 volatile	修饰经常存取的变量，使编译器不对该变量进行优化，每次取值必须从内存中取值而不是直接去取之前在寄存器中的值
（1）多线程使用共享变量：因为多线程是多核操作，同时进行
（2）中断：中断程序会修改其他程序中使用的变量
（3）硬件寄存器：因为寄存器随时会被修改，好比AD转换的寄存器，随时会因	为电压变化而修改
（4）外部任务会修改变量
10、 register	将变量存在寄存器里（即CPU），该值不能取地址操作，并且只能是整数