/********************/委托构造函数/************************************************************/
某个类型的一个构造函数可以委托同类型的另一个构造函数对对象进行初始化，
前者称为委托构造函数，后者称为代理构造函数，
在代理构造函数执行完毕后，再执行委托构造函数的函数体。

//语法
即在委托构造函数的列表初始化位置传参调用代理构造函数。

class classname
{
public:
	Myclass() : Myclass(0, 'c') {}
	Myclass(int x) : Myclass(x, 'c') {}
	Myclass(char y) : Myclass(0, y) {};
	Myclass(int x, char y) :a(x), b(y) { CommonInit(); }
private:
	void CommonInit() {}
	int a;
	char b;
};


//注意
* 委托构造函数，其初始化列表里不能对数据成员和基类进行初始化。
* 如果在代理构造函数执行完成后，委托构造函数主体抛出异常，则自动调用该类型的析构函数。

重要用法：可以将委托构造函数设计成函数模板，减少构造函数的编写。



/********************/继承构造函数/************************************************************/
当继承基类时，派生类需要编写与基类一致的构造函数，派生类构造函数代码显得多余。
此时可以使用 using 将基类的构造函数引入到派生类中（过去的标准中 using 只能引入普通函数）。代码如下;

class Base
{
public:
	Base() : x_(0), y_(0.) {};
	Base(int x, double y) : x_(x), y_(y) {}
	Base(int x) : x_(x), y_(0.) {}
	Base(double y) : x_(0), y_(y) {}
private:
	int x_;
	double y_;
};

class Derived : public Base
{
public:
	using Base::Base;
};

//注意
* 派生类不会继承基类的默认构造函数和拷贝构造函数
* 继承构造函数不会影响派生类默认构造函数的隐式声明
* 在派生类中声明形参相同的构造函数会禁止继承相应的构造函数
* 派生类继承多个形参相同的构造函数会导致编译失败
