/********************/范围 for 循环/************************************************************/
该特性隐藏了迭代器的初始化、比较和更新过程

for (element : container)
{
	//循环体
}

element是一个临时的变量声明，代表容器中的每一个元素
container是一个可迭代的对象，如容器、数组等。对象必须满足以下2个条件中的任意一个：
① 对象类型定义了begin和end的成员函数
② 定义了以对象类型为参数的begin和end的普通函数

示例1（遍历容器）：
std::map<int, std::string> mymap{ {1, "hello"}, {2, "world"}, {3, "!"} };

for (const auto& e : mymap)
{
	cout << e.first() << " " << e.second() << endl;
}

示例2（遍历数组）：
int arr[] = { 0,1,2,3,4,5 };

for (auto e : arr)
{
	cout << e << endl;
}

// 优化
* 一般来说对复杂对象使用引用，对基础类型使用值，这样可以减少对内存的拷贝。
* 若在循环过程中不会修改引用对象，可以在范围声明中加上 const 修饰符，以帮助编译器生成更加高效的代码。


C++17标准：begin()和end()返回值类型不必相同
C++20标准：范围声明之前可以执行初始化语句，用";"隔开



