/********************/返回值优化/************************************************************/
RVO 和 NRVO 是C++编译器优化技术，用于提高代码效率和减少不必要的对象拷贝。

//RVO（返回值优化）Return Value Optimization
RVO是一种编译器优化技术，它消除了为保存函数返回值而创建的临时对象。
通常，当函数返回一个对象时，编译器会在函数内部创建一个临时对象来保存返回值，然后将这个临时对象拷贝或移动到调用点。
但是，如果编译器能够确定这个临时对象是不必要的，它就可以优化代码，直接构造返回的对象在调用点，从而避免了不必要的拷贝或移动。


//NRVO（命名返回值优化）Named Return Value Optimization
NRVO是RVO的一种特殊情况，它进一步优化了代码。
允许编译器直接构造返回的对象在函数内部的命名变量中，而不是在函数返回时创建一个临时对象。
这通常发生在函数返回一个局部变量的情况下，编译器可以识别出这个局部变量就是最终要返回的对象，
因此它可以直接在这个局部变量上构造返回的对象，而不需要额外的拷贝或移动。


//新标准
C++14标准明确了对于常量表达式和常量初始化而言，编译器应该保证RVO，但是禁止NRVO。
C++17标准中提到了确保拷贝消除的新特性：
在传递临时对象或者返回临时对象的情况下，编译器应该省略对象的拷贝和移动构造函数，
即使这些拷贝和移动构造还是有一些额外的作用，最终直接将对象构造到目标的存储变量上，
从而避免临时对象的产生。另外标准还强调，这里的拷贝和移动构造函数甚至可以是不存在或者不可访问的。

