/********************/C++11其它特性/************************************************************/
智能指针：引入了 shared_ptr 、unique_ptr 和 weak_ptr 等智能指针类型，提供了更安全和自动化的内存管理。
多线程支持：引入了线程库、原子操作和互斥量等多线程编程的支持，方便编写并发程序。
标准库增强：新的容器类（如unordered_map、array、tuple）、新的算法（如move和emplace）、正则表达式支持
引用限定符：所谓引用限定符，就是在成员函数的后面添加 "&" 或者 "&&"，从而限制调用者的类型（左值还是右值）。
非受限联合体：任何非引用类型都可以成为联合体的数据成员，此时必须提供联合体的构造和析构函数（即使内容为空），这种联合体也被称为非受限联合体。过去只能使用基本类型作为其成员。
默认模板参数： template <typename T = int>
原生字符串：可以在字符串双引号前加"R"，将字符串用小括号包含，则字符串中无需使用转义字符，所见即所得。

C++14其它特性：
1、可以使用以0b作为前缀的二进制数表示整型变量。
2、使用单引号作为整数分隔符，对所有进制整数都有效。
3、初始化列表的返回值：在函数中可以使用初始化列表作为返回值。
4、变量模板：类似于函数模板，可以定义变量模板，使得变量的类型可以根据模板参数自动推断。

C++17其它特性：
1、可以使用以0x作为前缀的十六进制表示浮点数变量。
2、标准库增强：新的容器类（如string_view和optional）、新的算法（如transform_reduce和clamp）、文件系统库等。

C++20其它特性：
1、概念（Concepts）：引入了概念，用于对模板参数进行约束和限定，提供了更清晰和可读性强的模板编程方式。
2、范围的改进：引入了ranges命名空间，提供了丰富的范围操作函数和算法，使得处理容器和范围更加方便和高效。
3、协程：引入了协程机制，使得异步编程更加简洁和直观，可以通过协程关键字和异步操作符来实现协作式的并发。
4、模块：引入了模块化编程的概念，允许将代码划分为逻辑模块，提供了更快的编译速度和更好的代码组织。
5、强制执行：引入了强制执行的机制，用于在函数调用前和调用后对条件进行检查，提供了更强的程序健壮性。
6、标准库的改进：标准库进行了扩展和改进，包括新的容器类（如span和bitset）、新的算法（如std::ranges中的算法）、日期和时间库等。




