/********************/十六进制浮点字面量（C++17）/************************************************************/
#include <iostream>
std::hexfloat		//将浮点数格式化为16进制
std::defaultfloat	//将浮点数格式还原到10进制

cout << hexfloat << 12.48 << endl;					//输出：0x1.8f5c28f5c28f6p+3
cout << defaultfloat << 0x1.8f5c28f5c28f6p+3 << endl;	//输出：12.48


允许使用十六进制格式浮点数字面量
float a = 0x1.7p+2;



/********************/二进制整数字面量（C++14）/************************************************************/
允许使用二进制整数字面量

前缀0b和0B

int a = 0b11001101;



/********************/单引号作为整数分隔符（C++14）/************************************************************/
对所有进制整数都是有效的

int x = 123'456;
int y = 0x1e'240;
int z = 036'11'00;



/********************/原生字符串字面量（C++11）/************************************************************/
char str[] = R"(hello
this
world)";

语法：引号前加R，引号内加()。
省去了每行的双引号以及转义字符。



/********************/用户自定义字面量（C++11）/************************************************************/
//语法格式
return_type operator "" identifier(params)			//建议标识符以下划线开始：_identifier

//实例
long double operator "" _mm(long double x) { return x / 1000; }
long double operator "" _m(long double x) { return x ; }
long double operator "" _km(long double x) { return x * 1000; }
int main()
{
	cout << 1.0_mm << endl;
	cout << 1.0_m << endl;
	cout << 1.0_km << endl;
}


