/********************/列表初始化/************************************************************/
C++11可以使用{}进行列表初始化，尤其可以对各种容器进行初始化

int x = { 5 };							//拷贝初始化
int x1{ 8 };								//直接初始化
std::vector<int> x2 = { 1,2,3,4,5 }；
std::vector<int> x3{ 1,2,3,4,5 }；
std::list<int> x4 = { 1,2,3,4,5 }；
std::set<int> x5 = { 1,2,3,4,5 };
std::map<int> x6 = { "a",1 }, { "b",2 }, { "c",3 };

支持列表初始化的前提条件：支持std::initializer_list<>为形参的构造函数，即在构造函数中为其逐个添加赋值


//默认初始化
在类定义中直接使用等号=或花括号{}进行设定默认初值，代替在构造函数中赋值。可以有效减少具有多个带参构造函数时的赋值代码冗余
class Person
{
private:
	int x = 10;
	int y{ 20 };
};


//指定成员初始化（C++20）
struct Point
{
	int x;
	int y;
};
Point p{ .x = 4, .y = 2 };

但指定初始化有以下要求：
1、必须是一个聚合类型
2、非静态数据成员
3、必须按声明的顺序进行
4、最多只能初始化一次
5、针对联合体中的数据成员只能初始化一次，不能同时指定
6、不能嵌套指定初始化数据成员
7、一旦使用指定初始化就不能混用其他方法对数据成员初始化了
8、禁止对数组使用指定成员初始化



