/********************/Lambda表达式/************************************************************/
lambda表达式
[捕获] <typename T可选> (形参) 说明符可选 异常说明可选->返回值可选 { 函数体 }

1、[捕获capture] :捕获列表
[]是lambda引出符，编译器根据该引出符判断，接下来是否为lambda函数
捕获列表能够捕捉上下文中的变量以供lambda函数使用，捕获列表由0个或者多个捕获项组成，多个捕获项中间用逗号隔开
捕获列表的形式：
[var]			表示值传递，捕获变量var的值
[=]			表示值传递
[&]			或者[&val]表示地址传递或者引用传递
[=, &a, &b]	表示以引用传递的方式捕获变量a和b的值，其他的以值传递的方式进捕捉获取
[&, a, this]	表示值传递的方式捕获a和this
其他的以引用传递的方式进行捕捉获取（包含父作用域）//父作用域是指包含lambda语句块

2、 (形参)参数列表		与普通的函数的参数列表是一致，如果不需要参数传递，可以连括号一起省略
3、 Mutable			Mutable修饰符，默认情况下，lambda函数总是一个const函数。Mutable可以取消常量性，可以lamdba函数修改参数的值
4、->return_type		返回值类型，如果不需要返回值，可以将符号“->”一起省略
5、 { 函数体 }			函数体，内容和写法和普通函数一致
6、 异常说明			Exception attr异常属性，可选

示例：
auto a = [] {return ready};		//在lambda表达式中，只有捕获列表和函数体以外，其他都是可选

示例：
int x = 5;
auto foo = [x](int y)->int { return x * y; };
std::cout << foo(8) << std::endl;


//其它用法
1、转化为函数指针
2、在stl函数中使用lambda表达式作为stl函数的函数指针参数



