/********************/聚合类（Aggregate Class）/************************************************************/
聚合类指的是包含一组具有相似属性或行为的对象的类。
聚合类允许将多个对象组合成一个更大的实体，并通过聚合类来管理和操作这些对象。


//聚合类需满足条件
1、只有默认构造函数
2、只有 public 成员
3、无虚函数
4、没有类内初始值
5、基类类型必须为 public			//C++11新增条件
6、不能是虚继承				//C++11新增条件


//聚合类的作用
1、用户可以直接访问成员变量
2、可以用特殊的初始化语法



/********************/非受限联合体/************************************************************/
任何非引用类型都可以成为联合体的数据成员，此时必须提供联合体的构造和析构函数（即使内容为空），
这种联合体也被称为非受限联合体。过去只能使用基本类型作为其成员。





