/********************/强枚举类型/************************************************************/
//枚举类型的弊端
1、枚举类型可以隐式转换为整型（有符号或无符号）
2、无法指定枚举类型的底层类型，此时可能导致一些问题。如 enum e = { a = 0xff }; 在不同编译器中可能是有符号或无符号。

//C++11引入强枚举类型，具有三个特性
1、枚举标识符属于强枚举类型的作用域，使用时需要指定作用域
2、枚举类型不会隐式转换为整型
3、能指定强枚举类型的底层类型，底层类型默认为 int 类型

语法：在 enum 后添加关键字 class 即可，使用":"指定底层类型。
enum class School { student, teacher, headmaster };
enum class E : unsigned int { e1 = 1, e2 = 2, e3 = 0xfffffff0 };			//指定底层类型


开始可以对有底层类型的枚举类型对象进行列表初始化（C++17）
enum class Color
{
	Red,
	Green,
	Blue
};
int main()
{
	Color c{ 5 };			//编译成功
	Color c1 = 5;			//编译失败
	Color c2 = { 5 };		//编译失败
	Color c3(5);			//编译失败
}


可以使用 using 关键字打开强枚举类型的命名空间使用（C++20）
using class Color;


