/******************************/ffmpeg介绍/******************************************************************************************/
FFmpeg 是一套可以用来记录、转换数字音频、视频，并能将其转化为流的开源计算机程序。采用 LGPL 或 GPL 许可证。
它提供了录制、转换以及流化音视频的完整解决方案。
它包含了非常先进的音频 / 视频编解码库 libavcodec。


容器 / 文件(Conainer / File)	      ：指特定格式的多媒体文件，比如mp4、flv、mov等视频格式。
媒体流(Stream)				      ：一个容器（如mp4文件）中可存在多个流，可以是视频流、音频流、字幕流。
数据帧 / 数据包（Frame / Packet）：一个流媒体是由大量的数据帧构成的，对于压缩数据，帧对应着编解码器的最小处理单元，分属于不同媒体流的数据帧交错存储于容器之中。
编码器 / 解码器				      ：编解码器是以帧为单位进行压缩数据和复原数据的，对原始数据和压缩的数据进行转换。

复用器：把多路原始流按一定的规则组成成一个新的音视频文件（例如：把一个纯视频流、一个纯音频流和一个纯字幕流组合成一个mp4文件）；
解复用器：把一个新的音视频文件按一定的规则拆分成多路原始流（例如：把一个mp4文件，拆分成纯视频流、纯音频流和纯字幕流）。



fmpeg.exe 的代码实际上不算多，加起来只有1万多行代码，相关的代码文件如下：

ffmpeg.c，ffmpeg.exe 的主要逻辑就放在 ffmpeg.c 里面。
ffmpeg_opt.c，主要是负责解析跟处理命令行参数的，里面也有一些打开输出文件，打开编码器的逻辑。
ffmpeg_filter.c，主要是负责滤镜配置的逻辑，命令行的语法可以配置很复杂的滤镜逻辑的。
ffmpeg_hw.c，硬件加速相关。
ffmpeg_qsv.c，硬件加速相关，qsv 是 intel 的硬件加速。
ffmpeg_videotoolbox.c，videotoolbox 是 MacOS，IOS 系统上访问硬件编解码器的一个框架。



/******************************/ffmpeg命令行/******************************************************************************************/
ffmpeg - i  输入文件名  参数选项 - f  格式  输出文件名


参数选项：
- an		去掉音频
- vn		去掉视频
- sn		去掉字幕
- t		持续时长
- ss		起始时间
- to		终止时间
- r		帧率（默认为25）
- s		帧大小（W * H）
- b		设定视频码率
- b:v		视频码率
- b:a		音频码率（为保证音质，每声道码率不低于64kbps）
- c:a		指定音频编码器
- c:v		指定视频编码器
- af		音频滤镜
- vf		视频滤镜
- map	选择轨道
- ac		声道数
- aspect	横纵比（4：3，16：9等）
- acodec   指定音频解码器，一般后面加copy表示拷贝
- vcodec   指定视频解码器，一般后面加copy表示拷贝
-crf		 只能在编码器为x264或x265时使用，取值范围0~51，值越低画质越好（码率越高），默认为23
- filter_complex		复杂滤镜
-pix_fmt	 格式转换


格式选项：
h264	表示输出的是h264的视频裸流
mp4		表示输出的是mp4的视频
mpegts	表示ts视频流


压片技巧
1、使用高画质片源
2、选择高效编码器，如x265、NVENC
3、使用类似CRF的码率控制方式，并设置合适的质量值
4、尝试提高Preset的值（值越高速度越慢）
5、如果片源有大量噪点，先降噪处理（噪点非常消耗码率）

delogo滤镜去logo（复杂场景使用boxblur）
-vf delogo=60:50:200:80				前两值为logo的xy坐标，后两值为logo宽高


文件拖拽：在bat文件中使用"%~1"可自动识别替换为拖拽进bat文件的第一个文件，需指定路径和输出文件名。
批量转换：略
	

/******************************/字幕/******************************************************************************************/
字幕分为硬字幕和软字幕
软字幕如SRT、ASS为，可以编辑修改；硬字幕是画面的一部分，不可修改。

使用：
-vf "ass = 字幕文件名.ass"
-vf "subtitles = 字幕文件名.srt"

字幕样式：						字体名=思源字体				字体大小		字体颜色					边框颜色					边框粗细	 字幕与底边的距离
-vf "ass = 字幕文件名.ass:force_style='FontName=SourceHanSansCN-Bold, FontSize=20, PrimaryColour=&H0000FFFF, OutlineColour=&H00222222, Outline=1, MarginV=20'"
其它属性：
BackColour= &H00222222	阴影颜色				
Shadow=1				阴影深度				
BorderStyle=3				字幕背景色

HTML颜色代码：RGB：#FFFFFF
ASS颜色代码：ABGR：#00FFFFFF



/******************************/ffplay命令行/******************************************************************************************/
ffplay - i  输入文件名  参数选项
- x			宽度
- y			长度
- volume		音量
-framerate	指定帧率
- fs			全屏播放
- an			禁用音频
- vn			禁用视频
- sn			禁用字幕
- ss pos		根据设置的秒进行定位
- acodec		指定音频解码器 - acodec libfdk_aac
- vcodec		指定视频解码器 - vcodec h264
- window_title lpf	指定播放器播放视频的名称
- t				指定播放的时长
- loop number		循环播放的次数
- nostats			不输出视频相关信息，通过这个可以查看ffplay 如何收集的这些信息，自己写播放器可以借鉴
- ast				执行音频流索引
- vst				执行视频流索引，这个只有在视频包含多个流才会生效
- autoexit			播放完毕自动退出

ffplay - i - x 800 - y 480  mult.ts - vst 4 - ast 3		//这个是执行视频流索引是4  音频索引是3
ffplay - i - x 800 - y 480  mult.ts - t 5 - autoexit		//指定播放时间是5秒  播放完毕自动退出
ffplay - i test_1280x720.mp4 - x 800 - y 480 - t 5 - autoexit - codec : v h264		//通过 - codec:v h264 指定使用特定的解码器进行解码播放
ffplay - i test_1280x720.mp4 - x 800 - y 480 - t 5 - autoexit - codec : a libfdk_aac	//通过 - codec:a 指定使用libfdk_aac 来解码音频数据



