/*************************/FTP协议/***************************************************************************/

FTP(File Transfer Protocol)：是应用层的一个文件传输协议 ，基于TCP。

FTP使用了两个并行的TCP来传输文件：
一个是控制连接（port : 21），用于在两个主机之间传输控制信息，如口令，用户标识，存放、获取文件等命令。
一个是数据连接(port : 20)，用于实际发送一个文件, 发送完文件之后数据连接会关闭。
因为FTP协议使用一个独立的控制连接，所以，也称FTP的控制信息是带外（out - of - band）传送的。


//FTP支持两种方式的传输：
文本（ASCII）方式：文本文件
二进制（Binary）方式：而图象、声音文件、加密和压缩文件等非文本文件。

//FTP的2种传输模式：
FTP有两种传输模式——主动（FTP Port）模式和被动（FTP Passive）模式。
由于主动模式存在着安全问题，最近几年，大部分的TFP客户端开始默认使用被动模式。

主动模式的核心是FTP客户端告诉服务端自己开发哪个端口作为数据端口，然后让服务端来连接自己。
1.客户端随机打开一个本地大于1024的端口P1
2.客户端通过端口P1向服务器控制端口（端口21）发起连接请求
3.服务器进行认证成功，请求建立
4.客户端对本地端口P2进行监听并向服务器发送“Port P1 + 1”，告诉服务器客户端的数据监听端口。
5.服务器收到端口后，从自己的数据端口（端口20）发起连接，连接到客户端指定的数据端口P1 + 1.

由于主动方式中，服务端需要主动连客户端，对于客户端的防火墙来说，属于外部连接内部，会出现被阻塞的情况。
被动方式解决了这个问题。被动连接的核心是——控制连接请求和数据连接请求都是由客户端发起。
1.客户端任意打开约1024的两个本地端口（P1和P1 + 1）
2.P1端口发送请求连接服务器的21端口（控制连接端口）同时提交PASV命令。
3.服务器收到请求后，会开启任意一个大约1024的端口P2，然后返回如下格式内容：
227 entering passive mode(h1, h2, h3, h4, p1, p2)		//h1, h2, h3, h4代表服务器的ip地址； p1, p2代表服务器监听的数据连接端口地址。计算方法为P1 * 256 + P2
4.客户端收到服务端返回的内容后，计算出服务端开放的数据连接端口
5.客户端通过P1 + 1端口向服务端的发送连接请求。进行数据传输。


//命令和应答
FTP协议的命令是可读的，每个命令由4个大写的ASCII字符组成，有些还带一些可选参数，命令后面跟回车符换行。
FTP客户端每个发出的命令都会对应一个FTP服务器发出的应答。应答是一个3位的数字，后跟一个可选信息。他与HTTP响应报文的状态码和状态信息的结构相同



FTP客户端多文件同时下载如何实现
1、采用多进程 / 多线程实现
2、主线程或主进程每接收到一次下载文件命令，都重新创建与服务器的连接。
使用之前已经输入用户名和密码，从登陆开始重新执行，CMD，PASV 下载文件。
3、在子线程或子进程下载的过程中，主线程可以继续接收命令或下载新的文件。

FTP如何进行断点续传
1、当下载文件，首先检查本地是否有重名文件，如果有则给出选择，续传或覆盖。选择续传，则客户端以追加方式打开文件，然后计算本地文件的大小，然后告诉服务器，从指定的字节数后(REST 字节数)开始传输文件内容。

2、当上传文件时，如果发现服务器有同名文件，如果有则给出选择，续传或覆盖，选择续传，先获取服务器文件的字节数n(SIZE 文件名)，并发送给服务器：(APPE文件名)，然后打开本地文件从n个字节之后开始读取并传输给服务器。