/********************/header-only/************************************************************/

// 工程构建
1、.hpp写类声明
2、.inl写类方法实现，添加 inline 关键字。文件头部"#include".hpp类声明文件，以便语法高亮
3、在类声明"下方""#include"这些inl文件，如果写在类声明上方inl文件将会找不到类定义（并且在inl"#include".hpp时还会有循环包含问题）

* inl不需要"#ifndef"等语句，因为inl文件只应该被唯一的.hpp文件包含，而.hpp已有"#ifndef"。


// header-only 优点
1. 轻量级编译流程，集成简单，只需包含头文件即可。
2. 内联函数和实现全可见，编译器能做更多优化。
3. 代码设计更规范，无全局或静态变量，减少隐藏问题。
4. 降低ABI接口变更风险，减少多版本库文件需求。
5. 方便模板库开发，inl 方式天然适合模板函数和类

// 缺点
1. 编译时间增加，每次编译都会重新编译实现代码。
2. 代码暴露，源码泄露风险较大，不利于保护商业机密。
3. 可能导致代码膨胀，内联函数和模板展开增加二进制体积。
4. 调试依赖头文件完整，不完整或版本不匹配会出问题。

