


//SQLite 的优缺点
优点
轻量级：库文件小，适合嵌入式和资源受限环境。
易用性：无需安装和配置，操作简单。
跨平台：数据库文件可跨操作系统使用。
零配置：无需服务端，直接读写文件。
单文件存储：便于管理和分发。
快速开发：适合小型项目和原型开发。
高效小型数据处理：在小数据集和简单查询中表现优异。

缺点
并发性弱：不适合高并发写操作。
功能有限：缺少高级特性（如存储过程、多用户权限管理）。
性能瓶颈：处理大规模数据或复杂查询时性能较低。
单机应用：无法用于分布式、多用户的大型系统。
数据安全性：仅提供基础加密支持，不如大型数据库安全性高。


//部分 SQLite 命令
.help					获取可用的点命令的清单
.show					显示各种设置的当前值
.exit					退出 SQLite 提示符
.quit					退出 SQLite 提示符
.databases				列出数据库的名称及其所依附的文件
.schema					查看所有表结构
.schema					表名	查看指定表结构
.tables					查看所有表
.tables					表名	查看指定表，表存在返回表名，表不存在什么都不返回
.header(s) on / off		开启或关闭头部显示
.mode MODE				设置输出模式，MODE 可以是下列之一：column 左对齐的列
.timer on / off			开启或关闭 CPU 定时器


//SQLite 数据类型
NULL		值是一个 NULL 值
INTEGER		值是一个带符号的整数，根据值的大小存储在 1、2、3、4、6 或 8 字节中
REAL		值是一个浮点值，存储为 8 字节的 IEEE 浮点数字
TEXT		值是一个文本字符串，使用数据库编码（UTF - 8、UTF - 16BE 或 UTF - 16LE）存储
BLOB		值是一个 blob 数据，完全根据它的输入存储


// 常用命令
（shell）sqlite3 数据库名.db		//打开数据库，不存在则创建
.open 数据库名.db				//打开数据库，不存在则创建
.databases						// 显示数据库信息
.quit							// 退出sqlite3的shell程序环境
