/********************/数组容器 array/************************************************************/
/********************/单向链表 forward_list/************************************************************/
/********************/unordered_map / unordered_multimap/************************************************************/
/********************/unordered_set / unordered_multiset/************************************************************/
/********************/元组 tuple/************************************************************/


std::array：固定大小的数组，支持随机访问迭代器。它比C风格的数组更安全，因为它会进行边界检查，并且它支持更多的功能，如成员函数fill()和swap()。
std::forward_list：单向链表，只支持前向迭代器。它提供了比传统链表更高效的插入和删除操作。
std::unordered_map 和 std::unordered_multimap：哈希表实现的关联容器，支持键值对的快速查找、插入和删除。与std::map相比，它们通常具有更快的查找速度，但不保证元素的排序。
std::unordered_set 和 std::unordered_multiset：哈希表实现的集合容器，支持快速查找、插入和删除元素。与std::set相比，它们通常具有更快的查找速度，但不保证元素的排序。


std::tuple(元组)

/********************/结构化绑定（C++17）/************************************************************/
1、返回多个值（元组）
auto return_multiple_values()
{
	return std::make_tuple(11, 7);
}

int main()
{
	auto [x, y] = return_multiple_values();
	std::cout << "x=" << x << "y=" << y << std::endl;
}

2、绑定到结构体
3、绑定到元组和类元组对象

