/********************/迭代器/************************************************************/
<容器>						     <对应的迭代器类型>
array							随机访问迭代器
vector							随机访问迭代器
deque							随机访问迭代器
list								双向迭代器
set / multiset						双向迭代器
map / multimap					双向迭代器
forward_list						前向迭代器
unordered_map / unordered_multimap	前向迭代器
unordered_set / unordered_multiset	前向迭代器
stack							不支持迭代器
queue							不支持迭代器

1) 前向迭代器（forward iterator）
假设 p 是一个前向迭代器，则 p 支持 ++p，p++， * p 操作，还可以被复制或赋值，可以用 == 和 != 运算符进行比较。此外，两个正向迭代器可以互相赋值。

2) 双向迭代器（bidirectional iterator）
双向迭代器具有正向迭代器的全部功能，除此之外，假设 p 是一个双向迭代器，则还可以进行 --p 或者 p-- 操作（即一次向后移动一个位置）。

3) 随机访问迭代器（random access iterator）
随机访问迭代器具有双向迭代器的全部功能。除此之外，假设 p 是一个随机访问迭代器，i 是一个整型变量或常量，则 p 还支持以下操作：
p += i：使得 p 往后移动 i 个元素。
p -= i：使得 p 往前移动 i 个元素。
p + i：返回 p 后面第 i 个元素的迭代器。
p - i：返回 p 前面第 i 个元素的迭代器。
p[i]：返回 p 后面第 i 个元素的引用。

此外，两个随机访问迭代器 p1、p2 还可以用 <、>、 <= 、 >= 运算符进行比较。
另外，表达式 p2 - p1 也是有定义的，其返回值表示 p2 所指向元素和 p1 所指向元素的序号之差（也可以说是 p2 和 p1 之间的元素个数减一）。



迭代器定义方式			具体格式
正向迭代器			容器类名::iterator  迭代器名;
常量正向迭代器			容器类名::const_iterator  迭代器名;
反向迭代器			容器类名::reverse_iterator  迭代器名;
常量反向迭代器			容器类名::const_reverse_iterator  迭代器名;

常量迭代器和非常量迭代器的分别在于，通过非常量迭代器还能修改其指向的元素。
对正向迭代器进行 ++ 操作时，迭代器会指向容器中的后一个元素；
而对反向迭代器进行 ++ 操作时，迭代器会指向容器中的前一个元素。



/********************/数组容器vector/************************************************************/
vector是一个封装了动态大小数组的数组容器（Sequence Container）。
vector是一个模板类，它本质上是一个可以存放任意数据类型的数组，可以像数组一样使用下标运算符访问其中的元素。

头文件：
#include <vector>
命名空间：
using namespace std；


//vector的成员方法
构造函数
vector<类型名>V							//无参构造，V是变量名
vector<类型名>V2(&V)					//拷贝构造函数
vector<类型名>v1(V.begin(), V.end())	//将区间内的元素拷贝给v1
vector<类型名>v2(n, 元素)				//将n个元素拷贝给v2

push_back(int value)		添加元素到容器末尾
pop_back()					删除容器末尾的元素
at(int index)				根据下标获取指定位置的元素
begin()						获取首元素的地址
end()						获取尾元素的下一个元素的地址，可以用作迭代器遍历的条件

capacity()					获取当前容器的大小，也就是容量
size()						获取当前容器中元素的个数

resize(n)					调整容器的大小为n，变小则删去多余元素
resize(n，元素)				调整容器的大小为n，变小则删去多余元素，变大则空位都填入新元素。
reserve(n)					调整容器的大小为n，n若比当前小则不变，比当前大则执行。

clear()						清空容器
empty()						判断容器是否为空，空则返回 true, 否则返回 false

insert(地址，元素)			插入元素
erase(迭代器)				删除迭代器当前所指元素，其后的所有元素往前移一个单位。


//迭代器
vector容器的遍历可以使用下标，也可以使用迭代器。
迭代器是容器模板类中定义的一种数据类型。
迭代器定义：vector<类型名>::iterator 变量名;


容器类型为对象类型时，会在存入调用拷贝构造，创建新对象。
容器类型为对象指针时，会存放地址，不会调用拷贝构造，仍然指向原对象地址。


问题：
如果有一个基类引用指向派生类对象，容器保存基类成员，保存以后，是否仍然是派生类中的那部分内存？或者说，是否可以调用派生类的成员方法？
答：不可以。因为放入容器以后调用拷贝构造，实际上是一段新的内存。


/************************************************************/
容器中嵌套容器：
类似于结构体嵌套结构体，类嵌套类，容器也可以嵌套容器。
如：vector <vector<int> > V;		//旧标准：定义容器嵌套容器时，> >运算符间要留有空格


当容器嵌套容器的时候，注意大容器是调用了拷贝构造函数，与原来的小容器是不同的对象，两个容器的数据是不会同步的。

vector（向量）是数组类型的容器，该类型的容器还有 dequeue（双端数组）, queue（队列），stack（栈）。



/********************/链表容器list/************************************************************/
list是一个模板类，它的本质是一个可以存储任意数据的双向链表。

头文件：
#include <list>
命名空间：
using namespace std；

//成员函数
push_back()   		尾部添加
pop_back()			尾部删除
insert()			直接插入

begin()				容器首元素的地址
end()				容器末尾元素的下一个的地址

size()				容器中元素的个数

clear()				清空容器
empty()				判断容器是否为空

push_front()		头部添加
pop_front()			头部删除

remove()			删除所有符合目标的元素
erase()				删除一个元素

assign()      		赋值


list相比vector的好处，就是头部和任意位置插入比较方便, 缺点是遍历时耗时较长，且通过at()获取指定位置元素时耗时较长。


练习 : 创建Person类的对象，用list容器包含Person对象成员。

思考并代码验证 : 加入list容器时，是创建新的对象 ? 还是直接放入的？

因为每次加入容器都是创建了新的对象，所以修改其他对象时，不会影响到容器中的对象。
当需要使用remove删除容器成员时，需要重载 == 运算符


/********************/set / multiset/************************************************************/
set是集合，不允许重复数据。multiset是允许重复数据的集合。底层逻辑结构是二叉树。set是一个已排序的容器。
默认遍历方式是中序遍历，即从小到大输出。

头文件：
#include <set>
命名空间：
using namespace std；




begin()		最小元素的位置
end()		最大元素的下一个 / 右子节点的位置

size()		获取元素个数
clear()		清空容器
empty()		判断容器是否为空

insert()	插入数据，自动判断需要插入的位置
erase()		删除一个元素或者所有符合目标的元素


/********************/map / multimap/************************************************************/
map不允许插入相同的数据
multimap允许插入相同的数据

map是键值与实值关联的容器，里面存放的元素叫做对组，即pair。
对组是C++中的一个类的对象，关键字 pair, pair类有2个成员，分别叫做first和second。

头文件：
#include <map>
命名空间：
using namespace std；


//成员函数
begin()		首元素的地址
end()		末尾元素下一个的单位地址

size()		元素个数
clear()		清空容器
empty()		判断容器是否为空

insert()	插入
erase()		删除元素，通过键值删除

find()		查找元素，通过键值查找。如果没有找到，指向end();


键值 / 实值 成对的内容，往往会作为检索目录或者通信协议存在，例如 XML, Json等。

map容器本质上就是成员为pair对象的容器。pair本身是一个模板。
所以创建map容器时，必须与pair的模板类型保持一致。



/********************/栈容器stack/************************************************************/
头文件：
#include <stack>
命名空间：
using namespace std

//构造函数
stack<类型名>S
stack<类型名>S2(&S1)			//拷贝构造

//成员方法
push(元素)			入栈，向栈顶添加元素
pop()				出栈，删除栈顶元素
top()				获取栈顶元素
empty() 			判断是否为空
size()				获取栈大小



/********************/队列容器queue/************************************************************/
头文件：
#include <queue>
命名空间：
using namespace std

//构造函数
queue<类型名> Q				//queue采用模板类实现，默认构造函数
queue<类型名> Q2(&Q)		//拷贝构造

//成员方法
push(元素)					 //入队——往队尾添加元素
pop()						 //出队——从队头删除元素
back()						 //返回队尾元素
front()						 //返回队头元素
empty()						 //判断队列是否为空
size()						 //返回队列大小


/********************/vector实例/************************************************************/
#include <iostream>
#include <vector> //添加容器头文件

using namespace std;

int main()
{
	//调用无参构造函数定义一个模板类
	vector <int>V;

	//在vector末尾添加元素
	V.push_back(10);
	V.push_back(20);
	V.push_back(30);
	V.push_back(40);

	/* 	//遍历
		for(int i=0;i<4;i++)
		{
			//cout << V[i] << "  ";		//运用下标运算符的重载
			cout << V.at(i) << "  ";	//运用成员函数 at()
		}
		cout << endl;
	*/

	//使用迭代器遍历 
	//V.begin()是容器中的第一个元素
	//V.end()是容器中最后一个元素的下一个单位
	for (vector<int>::iterator it = V.begin(); it != V.end(); it++)
		cout << *it << "  ";
	cout << endl;

	//删除元素--在末尾删除元素
	V.pop_back();

	//删除元素--删除第一个元素
	V.erase(V.begin());

	for (vector<int>::iterator it = V.begin(); it != V.end(); it++)
		cout << *it << "  ";
	cout << endl;

	cout << V.capacity() << endl;		//获取容器的容量
	cout << V.size() << endl;			//获取容器中的元素个数

	cout << "------------" << endl;
	V.push_back(77);
	V.push_back(88);
	V.push_back(99);
	cout << V.capacity() << endl;		//容器的容量，它不是固定不变的
	cout << V.size() << endl;

	int i = 0;
	int* ptr = &V[0];//获取首元素的地址
	for (i = 0; i < 1000; i++)
		V.push_back(i);

	if (ptr == &V[0])
		cout << "首地址没有改变" << endl;
	else
		cout << "容器的首地址发生了改变：当容量满的时候,vector会自动申请新的内存空间" << endl;

	cout << "---------------" << endl;
	V.clear();
	cout << V.capacity() << endl;
	cout << V.size() << endl;

	for (vector<int>::iterator it = V.begin(); it != V.end(); it++)
		cout << *it << "  ";
	cout << endl;

	cout << "---------------" << endl;

	if (V.empty())
		cout << "容器为空" << endl;
	else
		cout << "容器不为空" << endl;
}
