/********************/GPIO/************************************************************/

GPIO八种工作模式：上拉输入、下拉输入、浮空输入、模拟输入; 推挽输出、开漏输出、复用推挽输出、复用开漏输出。

输出1为高电平，输出0为低电平


//高阻态
高阻态就是电阻无穷大，无电压无电路，近似开路。 例如：电阻被导线短路，则该电阻将无电流流过，呈高阻态。


//推挽输出（Push - Pull Output）
推挽输出：输出高电平或低电平。
推挽输出：当输出高电平时（外部为低电平），电流向外流，称为推；当输出低电平时（外部为高电平），电流向内流，称为挽。


//上拉与下拉
单片机MCU向外设输出电平时，若该电平超出了外设所能接受的范围，则需要在中间接一个电源和电阻，此时MCU开漏无电压电流输出，全靠外接的电源给外设供电。

此时，该电源与电阻称为上拉电路。
上拉和下拉：与电源串联的电阻为上拉电阻；与地串联的电阻为下拉电阻；
上拉：分为强上拉和弱上拉。低电阻时，电源输出的电流更强，为强上拉；高电阻时，电源输出的电流更弱，称为弱上拉。
下拉：分为强下拉与弱下拉。低电阻时，流向地的电流更多，下拉能力更强，为强下拉；高电阻时，流向地的电流更少，下拉能力更弱。


//开漏输出（Open Drain Output）
开漏输出：当输出低电平时接地，不对外输出电压和电流，呈高阻态，称为开；
开漏输出：当输出高电平时不接地，如果外接上拉电阻，则在输出高电平时电压会拉到上拉电阻的电源电压。


//浮空输入
浮空输入：输入引脚既不接高电平也不接低电平。此时无电压也无电流。



//位带操作
调用GPIO_SetBits等函数操作IO口都需要进行现场保护和现场恢复的动作，比较耗时间。使用位带操作直接操作IO口可以一步到位，简单快速。


