/********************/STM32/************************************************************/

GPIO八种工作模式：上拉输入、下拉输入、浮空输入、模拟输入; 推挽输出、开漏输出、复用推挽输出、复用开漏输出。

STM32F103的CPU主频率：72MHz			STM32F407的CPU主频率：168MHz


//时钟体系
4个时钟源：高速外部时钟(HSE)、高速内部时钟(HSI)、低速外部时钟(LSE)、低速内部时钟(LSI)。

低速内部时钟(LSI)应用：RTC实时时钟、独立看门狗
低速外部时钟(LSE)应用：RTC实时时钟

高速外部时钟(HSE)和高速内部时钟(HSI)经过锁相环(PLL)电路转换成MCU主频率。同时可将主频率分频供高级外设总线(APB1、APB2)使用。


//位带操作
调用GPIO_SetBits等函数操作IO口都需要进行现场保护和现场恢复的动作，比较耗时间。使用位带操作直接操作IO口可以一步到位，简单快速。



/********************/中断/************************************************************/
中断源：介于事件与CPU之间的电路模块。
中断请求信号：事件引起的，由中断源产生的，能被单片机识别的信号。

//中断与异常
中断：是指系统停止当前正在运行的程序转到其他的服务，可能是程序接收了比自身高优先级的请求，或者是人为设置中断，属于正常现象。
异常：异常是指由于CPU本身故障、程序故障或者请求服务等引起的错误，属于不正常现象。所有能打断正常执行流的事件都称为异常。
CPU给不同的中断源编号，称为中断向量。编号0~15为系统异常（优先级为 - 3到6），16以上称为外部中断。

//中断优先级
高抢占优先级可以打断正在进行的低抢占优先级的中断。
抢占优先级相同时，高响应优先级可以打断正在进行的低抢占优先级的中断。
抢占优先级和响应优先级都相同的中断同时发生时，会按照硬件内部固定的优先级执行。
优先级数值越小，优先级越高。

//中断原理
中断原理：中断是一种电信号，由硬件设备产生，并直接送入中断控制器的输入引脚上，然后再由中断控制器向处理器发送相应的信号。
处理器一经检测到该信号，便中断自己当前正在处理的工作，转而去处理中断。
此后，处理器会通知 OS 已经产生中断。这样，OS 就可以对这个中断进行适当的处理。



/********************/定时器/************************************************************/
SysTick 叫做系统滴答时钟、系统定时器，属于 Cortex - M4 内核中的一个外设(外围设备)，并且是24bit向下递减的计数器。
SysTick 通过计数值间接计算定时时间，计数值越大，定时时间越长。

//SysTick 系统定时器的作用
没有操作系统：只用于延时
有操作系统（ucos2 ucos3 freertos....）：为操作系统提供精准的定时中断（1ms~50ms）

//硬件定时器
STM32F407 有 2 个高级定时器、10 个通用定时器和 2 个基本定时器
高级控制定时器（TIM1 和 TIM8），具有 16 位定时器功能，也具有 PWM 输出高级控制功能
通用定时器（TIM2 到 TIM5），    具有 16 或 32位定时功能，也具有 PWM 输出控制功能
通用定时器（TIM9 到 TIM14），	具有 16 位定时功能，也具有 PWM 输出控制功能
基本定时器（TIM6 和 TIM7），	具有 16 位定时功能。

//PWM
脉冲宽度调制 Pulse Width Modulation(PWM)，是英文的缩写，简称脉宽调制，
是利用微处理器的数字输出来对模拟电路进行控制的一种非常有效的技术，广泛应用在从测量、通信到功率控制与变换的许多领域中。

脉冲：方波，频率
宽度：高电平的宽度，占空比


/************************************************************/




/********************/串口通信/************************************************************/
全双工串行异步的通信方式
帧格式：1个起始位（低电平），8个有效数据位，1个可选校验位，1或2个停止位


/********************/SPI总线/************************************************************/
全双工、同步的通信总线
需要四根通信线主发从收(MOSI)、主收从发(MISO)、片选(CS)、时钟线(SCLK)


/********************/I2C总线/************************************************************/
半双工、同步的通信总线
需要两根通信线SCL时钟线、SDA数据线



