/*************************/YUV/***************************************************************************/
YUV：将亮度信息（Y）与色彩信息（UV）分离，没有UV信息一样可以显示完整的图像，只不过是黑白的。完美解决了彩色电视机与黑白电视的兼容问题。


//YUV格式
打包（Packeted）格式：将Y、U、V分量交叉排列，并以像素点为单元连续地存放在同一数组中，通常几个相邻的像素组成一个宏像素（macro-pixel）。
平面（planar）格式：使用三个数组分开连续地存放Y、U、V三个分量，即Y、U、V分别存放在各自的数组中。

//YUV采样表示法
YUV444（每个像素 3 个字节）：表示色度频道没有下采样，即一个分量对应着一个U分量和一个V分量
YUV422（每个像素 2 个字节）：表示色度分量在水平方向上进行2 : 1的下采样，没有垂直下采样。每两个Y分量共用一个U分量和一个V分量
YUV420（每个像素 1.5 个字节）：表示色度分量在水平方向上进行2 : 1的下采样，在垂直方向上进行2 : 1的下采样。每四个Y分量共用一个U分量和一个V分量

带有P后缀的是平面（Planar）格式。
YUV444P 格式, 又叫 I444 格式, 与 FFmpeg 中的 AV_PIX_FMT_YUV444P 像素格式标识符对应
YUV422P 格式, 又叫 I422 格式, 与 FFmpeg 中的 AV_PIX_FMT_YUV422P 像素格式标识符对应
YUV420P 格式, 又叫 I420 格式, 与 FFmpeg 中的 AV_PIX_FMT_YUV420P 像素格式标识符对应


//下采样与上采样
下采样(Downsampling) 是降低 图像分辨率 或 数据量 的过程。能导致色彩信息的丢失或模糊。
在 YUV 色彩编码时, 下采样 通常应用于 UV 色度分量, 因为 人眼对 Y 亮度信息 比对 UV 色彩信息更敏感, 
下采样通过减少 UV色度分量 的样本数量来实现数据压缩。

上采样(Upsampling) 是 增加图像分辨率 或 数据量 的过程。可能会引入插值误差或伪像。
经过下采样的图像数据中，有些像素点没有 UV 色彩信息，因为无法显示在屏幕中。必须将 YUV 三个分量都补全后, 才能正常显示, 这个补全的过程就是 上采样;
在 YUV 中, 上采样通常用于在 图像处理 或 显示 之前恢复色度分量的原始分辨率;
上采样 通过 插入 额外的样本 或 对现有样本进行插值 来增加色度分量的样本数量; 这样可以在保持图像质量的同时, 将图像放大到更高的分辨率或将其转换为不同的格式;


//NV12 & NV21
NV12 图片颜色编码格式 也是 YUV 420 格式的, 又称为 " YUV420SP 格式 ", 只是其 UV 色度值的排列方式 与 I420 格式不同;
在 I420 格式中, Y 分量是 平面格式, UV 分量 也是平面格式, Y 和 U 和 V 都分别在三个不同的数组中;
在 NV12 格式中, Y 分量是 平面格式, UV 分量 是打包格式, Y 放在一个单独的数组中, UV 放在一个单独的数组中;

NV12 是硬件编码器和解码器中最常支持的格式，广泛用于视频采集、图像处理和视频流传输。CUDA 默认输出 NV12 格式。
NV21 主要应用在Android 系统中，特别是摄像头采集图像数据时，Android 默认输出 NV21 格式，因此常用于手机摄像头的数据处理。

NV12 中, U 分量在前, V 分量在后;
NV21 中, V 分量在前, U 分量在后;

NV12
data[0] : YYYYYYYY... — 先存储亮度(Y) 分量，大小为 宽* 高 字节。
data[1] : UVUV... — 紧跟着存储交错排列的色度(UV) 分量，大小为(宽 / 2)* (高 / 2) * 2 字节。

NV21
data[0] : YYYYYYYY... — 先存储亮度(Y) 分量，大小为 宽* 高 字节。
data[1] : VUVU... — 紧跟着存储交错排列的色度(UV) 分量，大小为(宽 / 2)* (高 / 2) * 2 字节。



/*************************/RGB/***************************************************************************/
红(R) / 绿(G) / 蓝(B) 三个颜色通道 都取值 255, 表示当前颜色是 白色;
红(R) / 绿(G) / 蓝(B) 三个颜色通道 都取值 0, 表示当前颜色值是 黑色;


//颜色格式
AV_PIX_FMT_RGB24：
表示当前像素中颜色值 排列顺序是 : 红 Red、绿 Green、蓝 Blue，在每个像素中各占 8 位, RGB24 表示一个像素有 24 位, 3 字节。
AV_PIX_FMT_BGR24：
表示当前像素中颜色值 排列顺序是 : 蓝 Blue、绿 Green、红 Red，在每个像素中各占 8 位, BGR24 表示一个像素有 24 位, 3 字节



/*************************/YUV与RGB转换/***************************************************************************/
//RGB和YUV转换公式
1. BT.601标准[1]——标清数字电视（SDTV)				Y = 0.299R + 0.587G + 0.114B
2. BT.709标准[2]——高清数字电视（HDTV)				Y = 0.2126R + 0.7152G + 0.0722B
3. BT.2020标准[3]——超高清数字电视（UHDTV)			Y = 0.2627R + 0.6780G + 0.0593B

BT601标准：
8bit位深情况下
*TV range是16-235(Y)、16-240(UV)，也叫Limited Range
*PC range是0-255，也叫Full Range
*而RGB没有range之分，全是0-255

BT601 TV range转换公式
YUV(256级别)可以从8位RGB直接计算：
Y = 0.299*R + 0.587*G + 0.114*B
U = -0.169*R - 0.331*G + 0.5*B 
V = 0.5*R - 0.419*G - 0.081*B

反过来，RGB也可以直接从YUV(256级别)计算：
R = Y + 1.402(Y-128)
G = Y - 0.34414(U-128) - 0.71414(U-128)
B = Y + 1.772(V-128)

YUV444 格式 转为 RGB 格式：
R = Y + 1.13983 * (V - 128)
G = Y - 0.39465 * (U - 128) - 0.58060 * (V - 128)
B = Y + 2.03211 * (U - 128)

YUV->RGB时，如果值小于0取0，大于255取255。


//【问题】YUV->RGB为什么解码出错显示绿屏？
因为解码失败时YUV分量都填为0值，然后根据公式：
R = 1.402 *(-128) = -126.598
G = -0.34414*(-128)-0.71414*(-128)=44.04992+91.40992=135.45984
B = 1.772*(-128)=-126.228

RGB值范围为[0, 255]，所以最终的值为：
R = 0
G = 135.45984
B = 0
此时只有G分量有值所以为绿色。


//数据大小
YUV420帧数据大小 = RGB24帧数据大小 / 2 = 宽 * 高 * 1.5；


