/********************/复习知识点/************************************************************/)

//运算符
1、运算符优先级					括号和成员	强转前缀自加减	乘除取余算术加减	左右移位比大小	等于不等于	位与异或或与或	三目赋值和逗号
2、原码、反码、补码				正数的反码和补码与原码相同，负数的反码0 / 1取反，负数的补码取反 + 1。有符号数首位为符号位。
3、短路求值						&& 在前项不符合要求情况下不进行后项的判断和执行，|| 在前项符合要求情况下不进行后项的判断和执行。
4、取余（ % ）号两边必须为整数

//关键字
5、 continue	跳出单次循环
6、 break		跳出整个 for / while / switch 循环，只能跳一层
7、 return		退出函数，不结束程序
8、 goto		无条件跳转到标签位置
9、 volatile	修饰经常存取的变量，使编译器不对该变量进行优化，每次取值必须从内存中取值而不是直接去取之前在寄存器中的值
				（1）多线程使用共享变量：因为多线程是多核操作，同时进行
				（2）中断：中断程序会修改其他程序中使用的变量
				（3）硬件寄存器：因为寄存器随时会被修改，好比AD转换的寄存器，随时会因	为电压变化而修改
				（4）外部任务会修改变量
10、 register	将变量存在寄存器里（即CPU），该值不能取地址操作，并且只能是整数
11、 union(联合体)可以用于判断大小端序
12、 大端序：高位放低地址，低位放高地址（8位一组）
13、 小端序：高位放高地址，低位放低地址（8位一组）

14、 long 和 unsigned long 在32位中是4个字节，在64位中是8个字节
15、 字节对齐：所占空间必须是成员变量中字节最大的整数倍；每个变量类型的偏移量必须是该变量类型的整数倍
16、 enum 变量自动从0开始计值，若某位有赋值，则后面的都为前面的值+1。值可以重复
17、 int* p，q表示p是指针变量，q是int变量
18、 extern		（在链接阶段调用声明的内容）
（1）声明外部变量：保存在数据段中；
（2）声明外部函数：和声明外部变量一样；
（3）extern "C":在c++中调用c语言代码，告诉编译器这部分代码要是有C编译
19、 switch-case	switch 里面不能是浮点数、double，可以是表达式； case 不能是字符串, 可以是单个字符，因为字符也是整数。不能是变量表达式，必须是能确定值的
20、 64位操作系统中指针大小为8个字节，32位操作系统中指针大小为4个字节。
21、 不使用 sizeof 求数据类型的字节大小：#define mysizeof(value) (char*)(&value + 1) - (char*)(&value)
22、 sizeof(a++)		对于 sizeof 只会求所占内存大小，不会进行表达式运算。执行后 a 还是原值。
23、 sizeof(void)		VS2021报错，Ubuntu为1且警告

24、局部变量可以和全局变量重名，并屏蔽全局变量。
25、全局变量可以声明在被多个.c文件包含的头文件中，但只能赋初值一次
26、printf()函数的返回值是输出字符个数（\n和空格也算），scanf()函数返回值是成功赋值变量的个数
27、C语言中不能使用二进制表示整常数
28、C语言函数参数压栈顺序：从右往左，并且内存中栈是由高向低扩展，所以先入栈的是右边并且地址是高位。比如printf()函数，也都是先打印最右边。
29、栈空间最大值：Window是2MB，Linux是8MB。Linux下可以使用ulimit -s命令查看。
30、在1G内存的计算机中能否malloc(1.2G)？为什么？	有可能，因为malloc是相进程申请虚拟内存，与物理地址空间没有直接关系
31、ptr++	增加量为一个数据类型字节大小
32、野指针：是指向地址不确定的指针；产生原因：释放内存之后指针没有及时置空，或是定义时没有赋值的指针变量。
33、数组下标为负值时表示从数组首地址开始向前寻址，int型数组num[-1]表示num地址往前4个单位的地址上的内容。
34、指针与指针的相减操作，表示两个指针指向的内存位置之间相隔多少个元素(注意是元素，并不是字节数)。指针不能相加。
35、空指针是指向地址为0区域的指针
36、定义一个常数，用以表面一年有多少秒。	#define SECOND_PER_YEAR (60*60*24*365)UL		UL表示长整型数
37、在头文件中不能定义静态变量。因为静态变量是有记忆的，不会随函数结束而结束，所以如果定义在头文件中，那么就会被多个文件开辟空间，浪费资源或者重新出错。
38、使用宏求结构体的内存偏移地址。			#define OffSet(type, field) ((size_t) & (((type*)0)->field))
39、面向对象：面向对象是种编程思想，把一切东西看成一个对象，这个对象拥有自己的属性，我们把对象拥有的属性变量和操作这些属性变量的函数打包成一个类来表示
40、面向对象和面向过程的区别
（1）面向过程：依据业务逻辑从上到下写代码
（2）面向对象：将数据与函数绑定到一起，进行封装，对象理论上是不能直接操作数据，只能通过对应的函数操作里面的数据，这样能够更快速的开发程序，减少了重复代码的重写过程
41、迭代器不是指针，是个类模板，返回的是对象的引用而不是对象的值。

//系统编程
42、内存映射：把硬盘的一部分作为内存使用，直接从硬盘读写数据
43、进程的六种状态：就绪态、执行态、暂停态、睡眠态、僵尸态、死亡态
44、fork函数子进程没复制的内容：PID、PPID、fork函数返回值、未决信号集
45、无名管道特征：亲缘进程、单向读写、数据不具有原子性、没有名字无法使用open打开
46、有名管道特征：任意进程、双向读写、数据具有原子性、使用open打开文件描述符读写，数据先进先出
47、精灵进程步骤：fork()出孙子进程、创建会话、忽略终端关闭信号、修改路径到根目录、关闭文件掩码、关闭继承的文件资源、开始工作。




//图
//哈希表
//红黑树
//排序算法


//TCP协议
//select和epoll
//协程
//线程池
//STM32





