/*************************/封装格式/***************************************************************************/

//常用视频封装格式
AVI：这是一种音频视频交叉存取格式，，并独立于硬件设备，最早由Microsoft公司推出。这种交替方式组织音频和视像数据的方式使得读取视频数据流时能更有效地从存储媒介得到连续的信息。
MKV：这是一种开放的多媒体封装格式，用于取代一些陈旧的媒体封装格式。MKV格式对新技术的使用非常快速，封装能力也很强。
MP4：支持多种音视频编码格式，并具有良好的兼容性和跨平台性。
TS：这是MPEG2 - TS封装格式，主要应用于实时传送的节目，如实时广播的电视节目。TS格式的特点是其数据包长度固定，通常为188字节或204字节。
FLV：这是一种网络视频格式。由于FLV文件体积小、加载速度快，使得网络观看视频文件成为可能。


//常用音频封装格式
WAV：这是微软公司开发的一种声音文件格式，是最接近真实声音的格式，支持多采样率多量化精度。所有的无损格式本质都是WAV的压缩，在播放时会转回WAV。
FLAC：FLAC代表Free Lossless Audio Codec，是一种无损音频压缩编码格式。由于其无损的特性，音频在压缩和解压缩过程中不会丢失任何信息。
APE：APE是一种无损压缩音频格式，它提供了较高的压缩率，并且音频质量几乎没有损失。
AAC：AAC，全称Advanced Audio Coding，是一种高级的音频编码标准，被广泛应用于音频编码和流媒体传输。AAC提供了高质量的音频压缩，并且具有较好的兼容性。
MP3：MP3是一种广泛使用的音频编码和压缩格式。尽管它是一种有损压缩格式，但在适当的压缩率下，音频质量仍然可以接受，并且文件大小相对较小。



//按字节拖动
FLV 容器格式简单，该格式中视频帧的帧头和数据是存储在一起的，帧数据是连续存储的，因此按照字节定位拖动可实现。
mp4 容器格式通常包含复杂的内部结构和元数据, 视频帧的帧头数据和帧内容数据是分开存储的, 存储并不连续, 该数据结构会影响字节到时间的映射, 该格式下不能按照字节进行定位拖动;

//点播场景
点播场景，什么是点播，就是视频已经录好了，放在服务器，客户端按需拉取一小端内容播放，不需要下载全部的视频内容。
点播场景比较适合用 MP4 格式，因为 MP4 格式定义了 stts 索引表以及一些相关的数据结构，可以很快的跳转，
例如 跳转 某个时间点播放，MP4 格式会比 FLV 快很多。（补充：FLV 可以额外添加 keyframeindex 加快跳转速度）

//直播场景
直播场景，MP4 格式的box结构要全部视频录完才能生成，而直播是不知道什么时候结束的。
而 FLV 是一种渐进式的格式，非常适合用于直播。




