/********************/算法/************************************************************/

算法五个基本特征：输入、输出、有穷性、确定性、可行性。

算法并不唯一，同一个问题可以有多个解决的问题的算法。

设计要求四个层次：
·算法程序没有语法错误
·算法程序对于合法的输入能够产生满足要求的输出
·算法程序对于非法输入能够产生满足规格的说明
·算法程序对于故意刁难的测试输入都有满足要求的输出结果

一个好的算法应具备的优点：
1. 算法对应的程序所耗时间少
2. 算法对应的程序所耗存储空间少
3. 算法结构性好、易读、易移植和调试


//时间复杂度
时间复杂度：一般情况下，随着输入规模n的增大，T(n)增长最慢的算法为最优算法。

T(n) = O(f(n))
推导大O阶的方法：
1、用常数1取代运行时间中的所有加法常数。
2、在运行过程中，只保留最高阶项。
3、如果最高阶项存在且不是1，则去除与这个项相乘的常数。
4、得到的最后结果就是大O阶。

也就是说，时间复杂度只有O(1)、O(n)、O(n^2)、O(n^3)...以及O(log2n)、O(log3n)、O(log4n)... //log后的数字是下角标
还有少数O(2^n)、O(3 ^ n)...以及O(nlog2n)...以及O(n^n)...以及O(n^n)...。

常用时间复杂度比较：O(1) < O(logn) < O(n) < O(nlogn) < O(n^2) < O(n^3) < O(2^n) < O(n!) < O(n^n)


//空间复杂度
S(n) = O(f(n)) ，其中，n为问题的规模，f(n)为语句关于n所占用存储空间的函数。



/********************/线性表/************************************************************/
线性表是指一对一的逻辑结构关系，包括顺序表和链表

顺序表是顺序存储的线性表，在内存中是连续的，顺序表就是数组。
线性表是链式存储的线性表，在内存中不一定连续，通过指针确定前后节点。


顺序表优缺点：
优点
1. 不需要多余的信息来记录数据间的关系，存储密度高
2. 所有数据顺序存储在一片连续的内存中，支持立即访问任意一个随机数据，使用下标。
缺点
1. 插入、删除时需要保持数据的物理位置反映其逻辑关系，一般需要成片移动数据
2. 当数据节点数量较多时，需要一整片较大的连续内存空间
3. 当数据节点数量变化剧烈时，内存的释放和分配不灵活

链表优缺点：
优点
1. 插入、删除时只需要调整几个指针，无需移动任何数据
2. 当数据节点数量较多时，无需一整片较大的连续内存空间，可以灵活利用离散的内存
3. 当数据节点数量变化剧烈时，内存的释放和分配灵活，速度快
缺点
1. 在节点中，需要多余的指针来记录节点之间的关联。
2. 所有数据都是随机存储的，不支持立即访问任意一个随机数据。


单向循环链表的优点：从任一结点出发都可访问到表中所有结点。
双向循环链表的优点：删除数据变得容易；尾插变得容易；可以从后向前遍历链表。

内核链表：将指针域单独分装起来；将与数据无关的函数和结构定义在头文件中。 

栈：初始化一个栈顶指针top=NULL。
	入栈：申请新节点，指向top的指向，top指向新节点。（新节点指向旧节点）
	出栈：临时指针temp指向栈顶temp=top，top指向次栈顶top=temp->next，释放temp。

队列：初始化一个头节点，front和rear指针指向头节点。（从头节点指向尾节点，尾节点指向NULL）
	进队：进队时，只操作队尾指针rear
	出队：出队时，只操作队头指针front



/********************/排序算法/************************************************************/
冒泡排序：外层循环：从前往后遍历每一个元素。
		  内层循环：与后一元素比较，若比后面大则交换位置。

快速排序：外层循环：从前向后遍历每个一个元素。
		  内层循环：从当前位置向前遍历，若比前面小则使arr[n] = arr[n - 1]，若比前面大则跳出。出循环后遍历地最后一个位置为循环前选定的temp值（arr[n] = temp）。

选择排序：外层循环：从前向后遍历每个一个元素。
		  内层循环：从当前位置向后遍历，找到最小值交换。








