/********************/日志系统/************************************************************/

// 日志等级
Trace
Debug
Info
Warning
Error
Critical

// 格式
日志级别
日期时间
文件行号
线程号
消息

// 输出方式
控制台
文件
数据库
远程服务器

// 存储格式
文本
JSON

// 滚动策略
按文件大小
按日期

// 缓冲机制
避免每条日志都实时写入硬盘，从而提高性能
提供日志批量写入功能，当缓冲区达到一定大小时才写入日志

// 异步方式
线程
协程

// 异步缓冲区
队列 + 锁
内存池

// 日志管理
图形界面
命令行

// 日志查询
按时间范围、日志级别、模块名等
按日志级别统计日志数量，显示错误频率等

// 性能优化
无锁设计（lock - free）：相关名词：CAS、RingBuffer、内存对齐、伪共享、ABA 问题

// Tip
header-only 设计
控制台彩色输出
泛型输出
性能测试用例
崩溃前 flush 日志
自定义格式

