/********************/汇编/************************************************************/

//8086CPU中断条件
1、除法错误(类型码0)。如div指令产生的除法溢出。
2、单步执行(1)
3、执行into指令(4)
4、执行int指令(n)

CPU根据中断类型码，在中断向量表(内存地址0000:0000~0000 : 03FF共1024个单元)中查找。
中断向量表中，一个表项存放一个中断向量，中断向量即中断处理程序的入口地址，该入口地址包括段地址(高地址字)和偏移地址(低地址字)，共两个字。


//CPU中断过程（由硬件自动执行）
详述：
(1)从中断信息中获取中断类型码
(2)标志寄存器的制入栈
(3)标志寄存器的TF和IF值置为0
(4)CS寄存器值入栈
(5)IP寄存器值入栈
(6)从内存地址为 中断类型码 * 4 和 中断类型码 * 4 + 2 的两个字单元中读取中断处理程序的入口地址设置IP和CS

简述：
(1)取得中断类型码N
(2)pushf
(3)TF = 0, IF = 0
(4)push CS
(5)push IP
(6)(IP) = (N * 4), (CS) = (N * 4 + 2)


//中断处理程序
编写步骤
(1)保存用到的寄存器
(2)处理中断
(3)恢复用到的寄存器
(4)用iret指令返回

iret指令的功能 :
pop IP
pop CS
popf

自定义中断处理程序：
(1)编写中断处理程序：do0
(2)将do0送入空闲内存地址0000:0200中
(3)将do0的入口地址0000:0200存储在中断向量表0号表项中。


//自定义除法溢出中断程序(错误码0，显示信息overflow)
将中断程序送到内存地址0000:0200
assume cs : code
code segment
start : mov ax, cs
mov ds, ax
mov si, offset do0				//设置ds:si指向源地址				
mov ax, 0
mov es, ax
mov di, 200h						//设置es:di指向目的地址
mov cx, offset do0end - offset do0	//设置cx为传输长度		"-"是汇编编译器可以识别的符号，进行常数的减法运算
cld								//设置传输方向为正
rep movsb

设置中断向量表

mov ax, 4c00h
int 21h

do0 : jmp short do0start
db "overflow!"			//中断处理程序所需要的数据应该跟着该处理程序，避免主程序被释放时数据消失
do0start : 中断处理程序(将“overflow!”移动到显存空间)

mov ax, 4c00h
int 21h

do0end : nop

code ends
end start


设置中断向量指向的地址
mov ax, 0
mov es, ax
mov word ptr es : [0 * 4] , 200h
mov word ptr es : [0 * 4 + 2] , 0


//单步中断
CPU执行完一条指令后，如果检测到标志寄存器的TF位为1，则产生单步中断(类型码1)，引发中断过程。
某些功能，如调试器，会在CPU每执行一条指令后将TF位置1，使CPU进入单步中断程序。
中断程序也是由一条条指令组成的，因此中断在触发时，有一个将TF设为0的过程，避免无限触发单步中断。


//中断不响应
有些情况下CPU不会响应中断
如：执行完向ss寄存器传送数据的指令，即使发生中断CPU也不会响应。
因为在中断时，标志寄存器和CS、IP要入栈。此时ss已经改变而sp并未改变，ss : sp指向的不是正确的栈顶，将引起错误。
因此，设置ss和sp的指令应该连续存放，如
mov ax, 1000h
mov ss, ax
mov sp, 0
而不应该
mov ax, 1000h
mov ss, ax
mov ax, 0
mov sp, 0


//int 指令（内中断）
格式: int n			//n是中断类型码
CPu执行int n指令，相当于引发一个n号中断的中断过程。在相关寄存器入栈后，IP = n * 4, CS = n * 4 + 2。


//BIOS（在系统板的ROM中）
内容
(1)硬件系统的检测和初始化程序
(2)外部中断和内部中断的中断例程
(3)用于对硬件设备进行I / O操作的中断例程
(4)其它和硬件系统相关的中断例程

操作系统中也提供许多中断例程
程序员可以用 int 指令直接调用BIOS和操作系统OS提供的中断例程，来完成某些工作。


//BIOS和OS的中断例程安装过程
（1）开机CPU上电，初始化(CS) = 0FFFFH, (IP) = 0, 自动从FFFF:0单元开始执行程序。
FFFF : 0处有一条跳转指令，CPU执行后，转去执行BIOS中的硬件系统检测和初始化程序。
（2）初始化程序将建立BIOS所支持的中断向量，即将BIOS提供的中断例程的入口地址登记在中断向量表中。
而中断例程一直在BIOS的ROM中，ROM是内存的一部分，因此无需安装。
（3）硬件系统检测和初始化完成后，调用 int 19h 进行操作系统的引导。从此将计算机交由操作系统控制
（4）操作系统启动后，除完成其它工作外，还将它所提供的中断例程装入内存，并建立相应的中断向量。

* FFFF:0位于内存ROM区，并且受到操作系统保护，无法修改。


//中断例程应用
一个供程序员调用的中断例程往往包括多个子程序，通过传递进来的参数决定调用哪一个子程序。
BIOS和DOS提供的中断例程，都用ah来传递内部子程序的编号。

int 10h在光标位置显示字符功能(由BIOS提供)
mov ah, 9		//ah=9表示调用第10h中断例程的9号子程序：在光标位置显示字符
mov al, 'a'		//字符
mov bl, 7		//颜色属性
mov bh, 0		//第0页
moc cx, 3		//字符重复个数
int 10h

int 21h程序返回功能(由DOS提供)
mov ah, 4ch		//程序返回
mov al, 0		//返回值
int 21h


//in和out 端口读写指令
外设接口芯片上也有寄存器(即端口)，CPU对其进行统一编址。
CPU访问外设的内存，需要通过其寄存器(端口)。

访问8位端口用al，16位端口用ax
可以端口号放在寄存器中
mov dx, 3f8h
in al, dx			//从端口3f8读入一个字节
out dx, al			//向端口3f8写入一个字节


//CMOS RAM芯片
该芯片靠电池供电，关机后RAM中的信息不丢失
包含一个实时时钟和128个存储单元的RAM存储器，0~0dh单元保存时间信息，其余大部分单元用于保存系统配置信息
70h为地址端口，71h为数据端口
比如读取CMOS RAM的2号单元：
(1)将2送入端口70h
(2)从端口71h读出2号单元的内容
mov ax, 2
out 70h, ax
in ax, 71h


//shl和shr 逻辑位移指令
shl：逻辑左移
shr：逻辑右移

shl功能
(1)将一个寄存器或内存单元中的数据向左移位
(2)将最后移出的一位写入CF中
(3)最低位用0补充

指令：
mov al, 01001000b
shl al, 1			//将al中的数据左移一位，如果移动位数大于1，移动位数要放在cl中

执行后(al)=10010000b, CF=0


//外部中断
外设产生的中断几乎都是可屏蔽中断。
外中断源分类

(1)可屏蔽中断：CPU可以不响应的外中断。
* CPU是否响应该中断，取决于标志寄存器IF位的设置。IF=1，则CPU执行完当前指令后响应中断；IF=0，则不响应。
* 中断信息(中断码)来自CPU外部，通过数据总线送入CPU。
* 至此可以解释中断处理时将IF设为0的原因：在进入中断处理程序后，禁止其它可屏蔽中断。

(2)不可屏蔽中断：CPU必须响应的外中断。
* 当CPU检测到不可屏蔽中断信息时，则在执行完当前指令后，立即响应，引发中断过程。
* 不可屏蔽中断的中断类型码固定位2


//键盘输入处理过程
(1)键盘产生扫描码
(2)扫描码送入60h端口
(3)引发9号中断
(4)CPU执行int 9中断例程处理键盘输入
以上1、2、3步由硬件系统完成，我们能改变的只有int 9中断处理程序。

按下一个键产生的扫描码称为通码，松开产生的扫描码称为断码。断码=通码+80h。寄存器的端口地址为60h。

0040:17单元存储键盘状态字节，该字节各位的记录信息如下，置1表示被触发的状态。
0：右Shift状态
1：左Shift状态
2：Ctrl状态
3：Alt状态
4：ScrollLock状态
5：NumLock状态
6：CapsLock状态
7：Insert状态


//键盘缓冲区
（1）键盘缓冲区是一个环形队列结构管理的内存区
（2）初始状态，没有键盘输入，此时键盘缓冲区为空
（3）按下A键，引发键盘中断；CPU执行int 9中断例程，从60h端口读出A键的通码；然后检测状态字节，看看是否有Shift、Ctrl等切换键按下；
发现没有切换键按下，则将A键的扫描码1eh和对应的ASCII码，即字母“a”的ASCII码61h，写入键盘缓冲区。
缓冲区的字单元中，高位字节存储扫描码，低位字节存储ASCII码（即1E61）。
（4）按下左Shift键，引发键盘中断；int 9中断例程接收左Shift键的通码，设置0040:17处状态字节的第1位为1，表示左Shift键按下。
（5）按下A键，引发键盘中断；CPU执行int 9中断例程，从60h端口读出A键的通码；然后检测状态字节，看看是否有Shift、Ctrl等切换键按下；
发现左Shift键被按下，则将A键的扫描码1Eh和Shift_A对应的ASCII码，即字母“A”的ASCII码41h，写入键盘缓冲区（1E41）。
（6）松开左Shift键，引发键盘中断；int 9中断例程接收左Shift键的断码，设置0040:17处状态字节的第1位为0，表示左Shift键松开。

int 16 中断用于读取键盘缓冲区：
mov ah, 0	//表示int 16h中断的0号功能
int 16h
执行后从缓冲区队头获取数据放入ax：ah中为扫描码，al中为ASCII码
当键盘缓冲区为空时，调用int 16h，则循环等待，直到缓冲区中有数据。


//描述了单元长度的标号（数据标号）
数据标号区别于仅表示地址的地址标号，且地址标号通常只在代码段中使用。
代码段中使用数据标号需要使用伪指令assume将标号所在的段和段寄存器联系起来。
assume cs:code
code segment
a db 1,2,3,4,5,6,7,8	//a表示code:0，并且默认单元长度为byte
b dw 0					//b表示code:8，并且默认单元长度为word

可以如下操作
mov ax, b	//mov ax, cs:[8]
mov b,2		//mov word ptr cs:[8], 2
inc b		//inc word ptr cs:[8]

mov al, a[si]		//mov al, cs:0[si]
mov al, a[3]		//mov al, cs:0[3]
mov al, a[bx+si+3]	//mov al, cs:0[bx+si+3]


//直接定址表
使用内存空间换取运行速度
showsin: jmp short show
table dw ag0,ag30,ag60,ag90,ag120,ag150,ag180
ag0   db '0', 0			//sin(0)=0
ag30  db '0.5', 0		//sin(30)=0.5
ag60  db '0.866', 0
ag90  db '1.0', 0
ag120 db '0.866', 0
ag150 db '0.5', 0
ag180 db '0', 0
show: 
push bx
push es
push si
mov bx, 0b800h
mov es,bx
以下用角度值/30作为相对于table的偏移，取得对应的字符串的偏移地址，放在bx中
mov ah, 0
mov bl, 30
div bl
mov bl, al
mov bl, 0
add bx, bx
mov bx, table[bx]
以下显示sin(x)对应的字符串
mov si, 160*12+24*2
shows:
mov ah, cs:[bx]
cmp ah, 0
je showret
mov es:[si], ah
inc bx
add si, 2
jmp short shows
showret:
pop si
pop es
pop bx
ret


//运算符int何rem
int()：描述性运算符，取商
rem()：描述性运算符，取余数

软盘逻辑扇区号=(面号*80+磁道号)*18+扇区号-1
面号=int(逻辑扇区号/1440)
磁道号=int(rem(逻辑扇区号/1440)/18)
扇区号=rem(rem(逻辑扇区号/1440/)18)+1


//三种工作模式
（1）实模式：工作方式相当于一个8086.
（2）保护模式：提供支持多任务环境的工作方式，建立保护机制。
（3）虚拟8086模式：可以从保护模式切换至其中的一种8086工作方式。这种方式的提供使用户可以方便地在保护模式下运行一个或多个原8086程序。

* 开机时CPU以实模式工作，加载Windows后切换到保护模式。运行一个DOS下的程序，那么Windows将CPU切换到虚拟8086模式下运行该程序。
* 实模式不支持内存保护，因此一个错误的指令或操作可能会导致整个系统崩溃
* 保护模式确保不同程序之间的隔离和安全性。这主要是通过内存保护和访问控制来实现的
* 虚拟8086模式主要用于在保护模式下运行基于DOS的应用程序或游戏。



