/*************************/流媒体协议/***************************************************************************/
//流媒体传输协议
1. RTP（Real - time Transport Protocol 实时传输协议）			：基于UDP，定义简单且性能好，但是需要额外的信令协议。
2. RTCP（Real - time Transport Control Protocol 实时传输控制协议）：基于UDP，为RTP媒体流提供信道外控制。RTCP本身并不传输数据，但和RTP一起协作将多媒体数据打包和发送。
3. RTSP（Real Time Streaming Protocol   实时流协议）		：基于TCP，HTTP与RTSP相比，HTTP传送HTML，而RTSP传送的是多媒体数据。应用层协议。
4. RTMP（Real Time Messaging Protocol 实时消息协议）	：基于TCP，性价比高，是目前直播推流的标准使用协议。应用层协议。
RTSP不会发送媒体数据，只完成服务器和客户端之间的信令交互，RTP协议负责媒体数据传输，RTCP负责RTP数据包的监视和反馈。
RTP和RTCP没有规定传输层的类型，可用选择TCP或UDP，RTSP的传输层则是要求基于TCP。

//流媒体应用协议
1. HTTP - FLV：基于TCP，使用HTTP传输FLV流，分发性能强，适用于CDN分发；
2. HLS（HTTP Live Streaming http直播流）					：基于TCP七层协议，被HTML5写入标准支持，延时大，但是兼容H5；
3. CDN：CDN架构设计比较复杂。包含源站、缓存服务器、智能DNS、客户端等几个主要组成部分。

//WebRTC信令协议
WebRTC信令协议有：SDP、ICE、NAT、STUN、TURN。当然，WebRTC的网络传输协议也有用到上面提及的流媒体传输协议。
信令：用来通信连接的两侧做状态同步使用。

//流式传输分为两种
顺序流式传输(Progressive Streaming)
实时流式传输(Real time Streaming)



/*************************/网络视频传输的服务质量（QoS）/***************************************************************************/
QoS（Quality of Service）服务质量，是网络的一种安全机制，是用来解决网络延迟和阻塞等问题的一种技术。

QoS参数也是流媒体媒体传输的性能指标。主要的QoS参数有如下几项：传输带宽，传输时延和抖动，丢包率。

1.传输带宽（影响最大）
传输带宽也指的是数据传输的速率。
如果带宽过低，使得数据传输下载的速度小于视频流播放的数率，
那么在视频的播放将会经常出现停顿和缓冲，极大的影响了客户观看的流畅性；
而为了保证视频观看的流畅性，在低带宽的条件下，只能选择低品质、低码流的视频进行传输，这样又会影响到客户的光看效果。
所以，一个良好的传输带宽环境是客户活动高品质的流媒体体验的重要保证。

2.传输时延和抖动
传输时延定义为从服务器端发送数据到接收端接收到该数据之间的时间差，它是用来描述网络时延的一个指标。
时延抖动定义为网络传输延时的变化率。
流媒体最重要一个特性的就是实时性强，所以流媒体通信需求更难于满足的是对通信系统的传输时延限制。
时延限制主要是用在具有实时性要求的交互分布式实时流媒体应用中，如视频会议系统。
为防止时延给交互式通信带来不便，建议的最大端到端的总时延不要超过150ms，否则交互双方会感到明显的时延，
给双方的信息交流带来不便。端到端的时延可分为以下四个部分：
1．信息源的媒体采样、压缩编码和打包的时延；
2．传输时延；
3．接收端的排队和播放缓冲时延；
4．接收端的拆包、解码和输出时延。
抖动定义为网络传输延时的变化率。时延抖动对流媒体播放质量的影响非常大，一般会采用缓存排队的办法平滑数据报的抖动。
但如果数据传输的抖动较大，则必须采用大的缓存，这将直接造成更大的时延，直接影响流媒体的体验效果。

3.丢包率
流媒体数据传输中的时延和抖动是可以通过缓存的办法减少影响，所以流媒体业务可以允许在一定范围内的时延和抖动。
但丢包会对流媒体数，据播放质量造成极其重大的影响。
丢包率会造成视频和音频质量严重恶化，小的丢包率会造成图像的失真和语音的间歇中断，过高的丢包率甚至可以导致业务的中断。
网络设计的目标是丢包率为零，但显然不存在这样的理想网络。所以丢包的大小将直接决定流媒体业务质量的好坏。



/*************************/网络抖动/***************************************************************************/
网络传输的指标：
1. 丢包率：(本端接收到的数据包 / 对端发送的数据包) * 100 % ；
2. 延时：对端接收时间T1 - 本端发送数据时间T0，一般用RTT来评估延时，即往返延时，本端发送数据，到对端接收数据并确认接收的耗时；
3. 带宽：网口允许收发数据量的大小，单位bps，发送速率：实际收发的数据量的大小，单位bps。带宽可以理解成最大发送速率；

网络抖动就是实际发（收）的数据没有发（收），判断是否抖动就是看丢包率是否增加、 RTT是否增加、发送速率是否降低。


JitterBuffer就是为了减少网络抖动给音视频传输带来的影响而产生的，jitterBuffer是传输过程中的一个缓冲区，连接着解码器和网络协议栈。
JitterBuffer会有一的延迟音视频传输时间，将数据先缓存在缓冲区中，并且也会将之前缓存的数据发送到接收端，
我就把他理解成我们在网上看电视的时候的视频缓存，这样的话，即使出现了偶尔的网络抖动，也不会影响到用户的体验。

JitterBuffer带来的好处就是：
1. 降低了网络轻微抖动打来的卡顿；
2. 平衡编解码器和网络协议栈的数据供求量；
3. 动态调整数据的收发量，在一定范围内控制数据收发平衡性。



/*************************/弱网优化/***************************************************************************/
弱网优化的策略包括如下：

1. 播放器Buffer
2. 丢帧策略(优先丢P帧，其次I帧，最后音频)
3. 自适应码率算法
4. 双向链路优化
5. 音频FEC冗余算法(20 % 丢包率）


