/*************************/流媒体协议/***************************************************************************/
//流媒体传输协议
1. RTP（Real - time Transport Protocol 实时传输协议）			：基于UDP，定义简单且性能好，但是需要额外的信令协议。
2. RTCP（Real - time Transport Control Protocol 实时传输控制协议）：基于UDP，为RTP媒体流提供信道外控制。RTCP本身并不传输数据，但和RTP一起协作将多媒体数据打包和发送。
3. RTSP（Real Time Streaming Protocol   实时流协议）		：基于TCP，HTTP与RTSP相比，HTTP传送HTML，而RTSP传送的是多媒体数据。应用层协议。
4. RTMP（Real Time Messaging Protocol 实时消息协议）	：基于TCP，性价比高，是目前直播推流的标准使用协议。应用层协议。
RTSP不会发送媒体数据，只完成服务器和客户端之间的信令交互，RTP协议负责媒体数据传输，RTCP负责RTP数据包的监视和反馈。
RTP和RTCP没有规定传输层的类型，可用选择TCP或UDP，RTSP的传输层则是要求基于TCP。

//流媒体应用协议
1. HTTP - FLV：基于TCP，使用HTTP传输FLV流，分发性能强，适用于CDN分发；
2. HLS（HTTP Live Streaming http直播流）					：基于TCP七层协议，被HTML5写入标准支持，延时大，但是兼容H5；
3. CDN：CDN架构设计比较复杂。包含源站、缓存服务器、智能DNS、客户端等几个主要组成部分。

//WebRTC信令协议
WebRTC信令协议有：SDP、ICE、NAT、STUN、TURN。当然，WebRTC的网络传输协议也有用到上面提及的流媒体传输协议。
信令：用来通信连接的两侧做状态同步使用。

//流式传输分为两种
顺序流式传输(Progressive Streaming)
实时流式传输(Real time Streaming)



/*************************/网络抖动/***************************************************************************/
网络传输的指标：
1. 丢包率：(本端接收到的数据包 / 对端发送的数据包) * 100 % ；
2. 延时：对端接收时间T1 - 本端发送数据时间T0，一般用RTT来评估延时，即往返延时，本端发送数据，到对端接收数据并确认接收的耗时；
3. 带宽：网口允许收发数据量的大小，单位bps，发送速率：实际收发的数据量的大小，单位bps。带宽可以理解成最大发送速率；

网络抖动就是实际发（收）的数据没有发（收），判断是否抖动就是看丢包率是否增加、 RTT是否增加、发送速率是否降低。


JitterBuffer就是为了减少网络抖动给音视频传输带来的影响而产生的，jitterBuffer是传输过程中的一个缓冲区，连接着解码器和网络协议栈。
JitterBuffer会有一的延迟音视频传输时间，将数据先缓存在缓冲区中，并且也会将之前缓存的数据发送到接收端，
我就把他理解成我们在网上看电视的时候的视频缓存，这样的话，即使出现了偶尔的网络抖动，也不会影响到用户的体验。

JitterBuffer带来的好处就是：
1. 降低了网络轻微抖动打来的卡顿；
2. 平衡编解码器和网络协议栈的数据供求量；
3. 动态调整数据的收发量，在一定范围内控制数据收发平衡性。



/*************************/弱网优化/***************************************************************************/
弱网优化的策略包括如下：

1. 播放器Buffer
2. 丢帧策略(优先丢P帧，其次I帧，最后音频)
3. 自适应码率算法
4. 双向链路优化
5. 音频FEC冗余算法(20 % 丢包率）


