/********************/算法与数据结构/************************************************************/

//数据结构三要素
逻辑结构（集合结构、线性结构：一对一、树形结构：一对多、图结构：多对多）
数据的运算（增删改查）
存储/物理结构（顺序存储、链式存储、索引存储、散列存储）


//算法的五个基本特征
1、输入：可以有0个或多个输入。
2、输出：至少有一个输出。
3、有穷性：一个算法必须总在执行有穷步之后结束。
4、确定性：算法中每条指令必须有确切的含义，对于相同的输入只能得出相同的输出。
5、可行性：每个计算步骤都可以在有限时间内完成。


//一个好的算法应具备的特性
正确性：算法应能够正确地解决求解问题。
可读性：算法应具有良好的可读性。
健壮性：输入非法数据时，算法能适当地作出反应或进行处理，而不会产生莫名其妙的输出结果。
高效性：算法对应的程序所耗时间少
低存储量需求：算法对应的程序所耗内存空间少


//时间复杂度
时间复杂度：一般情况下，随着输入规模n的增大，T(n)增长最慢的算法为最优算法。

T(n) = O(f(n))
推导大O阶的方法：
1、用常数1取代运行时间中的所有加法常数。
2、在运行过程中，只保留最高阶项。
3、如果最高阶项存在且不是1，则去除与这个项相乘的常数。
4、得到的最后结果就是大O阶。

常用时间复杂度比较：O(1) < O(log2n) < O(n) < O(nlog2n) < O(n^2) < O(n^3) < O(2^n) < O(n!) < O(n^n)


//空间复杂度
S(n) = O(f(n)) ，其中，n为问题的规模，f(n)为语句关于n所占用存储空间的函数。



/********************/线性表/************************************************************/
线性表是具有相同数据类型的n个数据元素的有限序列。包括顺序表和链表。

//标准命名
InitList(&L);				//初始化链表：构造并分配内存空间
DestroyList(&L);			//销毁链表：销毁并释放内存空间
ListInsert(&L, i, e);			//插入元素：在第i个位置插入元素e
ListDelete(&L, i, &e);		//删除元素：删除第i个位置的元素并用e返回该元素值
LocateElem(L, e);			//按值查找元素：查找值为e的元素
GetItem(L, i);				//按位置查找元素：获取第i个元素的值

//顺序表和链表
顺序表是顺序存储的线性表，在内存中是连续的，顺序表就是数组。
链表是链式存储的线性表，在内存中不一定连续，通过指针确定前后节点。

//静态顺序表
数组、数据节点、最大长度、当前长度。

//动态顺序表
1、使用*data指针指向malloc的连续数据空间。
2、当需要扩容时，需要重新malloc分配一个更大的内存空间，
3、逐个复制原空间元素到新内存
4、使*data指向新内存
5、最后free释放原内存

//静态链表
使用数组存储数据元素，并通过游标来模拟链表的链接关系。
这种结构使得静态链表在物理上虽然是连续的存储空间，但在逻辑上却具有链表的特点

//动态链表
普通链表

//顺序表优缺点：
优点
1. 存储密度高，不需要多余的信息来记录数据间的关系。
2. 访问速度快，所有数据顺序存储在一片连续的内存中，可使用下标立即访问任意一个随机数据。
缺点
1. 插入、删除不方便，需要移动大量数据
2. 扩展容量不方便（静态无法扩展，动态扩展时间开销大）

//链表优缺点：
优点
1. 插入、删除时只需要调整几个指针，无需移动任何数据
2. 当数据节点数量较多时，无需一整片较大的连续内存空间，可以灵活利用离散的内存
3. 当数据节点数量变化剧烈时，内存的释放和分配灵活，速度快
缺点
1. 在节点中，需要多余的指针来记录节点之间的关联。
2. 所有数据都是随机存储的，不支持立即访问任意一个随机数据。


单向循环链表的优点：从任一结点出发都可访问到表中所有结点。
双向循环链表的优点：删除数据变得容易；尾插变得容易；可以从后向前遍历链表。

内核链表：将指针域单独分装起来；将与数据无关的函数和结构定义在头文件中。 本质上是个双向循环链表。



/********************/栈和队列/************************************************************/
顺序栈、链式栈、顺序队列、链式队列、共享栈、循环队列、双端队列

栈（Stack）是只允许在一端进行插入和删除操作的线性表。
栈：初始化一个栈顶指针top=NULL。
	入栈：申请新节点，指向top的指向，top指向新节点。（新节点指向旧节点）
	出栈：临时指针temp指向栈顶temp=top，top指向次栈顶top=temp->next，释放temp。

共享栈：两个栈共享内存空间，两个栈从两端向中间增长。

队列（Queue）是只允许在一端进行插入，在另一端删除的线性表。
队列：初始化一个头节点，front和rear指针指向头节点。（从头节点指向尾节点，尾节点指向NULL）
	进队：进队时，只操作队尾指针rear
	出队：出队时，只操作队头指针front

双端队列：允许在两端进行插入和删除的队列。



/********************/排序算法/************************************************************/
冒泡排序：外层循环：从前往后遍历每一个元素。
		  内层循环：与后一元素比较，若比后面大则交换位置。

快速排序：外层循环：从前向后遍历每个一个元素。
		  内层循环：从当前位置向前遍历，若比前面小则使arr[n] = arr[n - 1]，若比前面大则跳出。出循环后遍历地最后一个位置为循环前选定的temp值（arr[n] = temp）。

选择排序：外层循环：从前向后遍历每个一个元素。
		  内层循环：从当前位置向后遍历，找到最小值交换。








