
//用户态、内核态、特权指令、非特权指令
PSW寄存器用于标记当前处理器状态
应用程序使用非特权指令
内核程序使用特权指令，会触发中断，将处理器状态由用户态转为内核态。使用特权指令修改PSW可切换到用户态。
中断会让操作系统内核强行夺回CPU的控制权，同时使CPU转变为内核态。



//内存管理
内存映射：程序运行后会进行内存映射，每个进程都拥有各自映射的虚拟内存。
虚拟内存：虚拟内存其实就是将硬盘的一部分容量当内存使用，从而弥补物理内存不足的问题。
假设物理内存只有512M，通过 MMU（内存管理单元）进行映射后一个进程的内存空间会有4G的大小。
但这个4G内存只是一个可用范围。可同时操作的内存最多只有512M，因为实际内存只有512M。

内存条使用时分为两段，一段给内核用，一段留给用户。多个进程的内核空间占用同一块内核内存。



//原语
系统内核中，一些执行过程具有原子性(不会被中断)的程序。
原理：执行执行前关闭中断，执行后再打开中断。
关中断：CLI将IF位清除(置0)
开中断：STI将IF位设置(置1)



//进程切换
在CPU进行进程切换时，会将必要的寄存器中的信息保存到PCB中。待再次运行时通过PCB恢复。



//进程互斥算法
四个原则：
空闲让进：临界区空闲时，应允许一个进程访问
忙则等待：临界区正在被访问时，其它试图访问的进程需要等待
有限等待：要在有限时间内进入临界区，保证不会饥饿
让权等待：无法进入临界区的资源，应该释放CPU资源

软件实现：
单标志法：违反空闲让进。
双标志法：违反忙则等待或空闲让进和有限等待。
Peterson算法：违反让权等待。

硬件实现：
中断屏蔽：使用开关中断的方法。但该方式对当前CPU有效，其他CPU的进程仍可能访问该临界资源。
TestAndSetLock指令：该指令由硬件完成，实现“检查”和“上锁”，不会被打断。但不满足让权等待原则。
Swap指令(也称Exchange(XCHG)指令)：与TSL指令相似，由硬件完成“检查”和“上锁”。也不满足让权等待原则。



//自旋锁
一个线程采用循环(while)方式不断尝试获取锁、等待锁释放的机制就被称为自旋锁（spinlock）。自旋锁会占用CPU资源。

