/********************/线程池/************************************************************/
每次执行任务时创建和销毁线程的时间和资源开销很大，线程池使得线程可以复用，执行完一个任务不被销毁，之后可以继续执行其他的任务。

最理想的情况是:
让进程有一些初始数目的线程（所谓的线程池)，当没有任务的时候这些线程自动进入睡眠，有了任务他们会立即执行任务，不断循环。
进程还应该可以根据自身任务的繁重与否来增删线程的数目，当所有的任务都完成了之后，所有的线程还能妥当地收官走人，不带走一片云彩。

在各个编程语言的语种中都有线程池的概念，并且直接提供了线程池，我们直接使用就可以了。



//线程池的组成
线程池主要由 3 个部分组成：

任务队列（单向链表），存储需要处理的任务，由工作的线程来处理这些任务
通过线程池提供的 API 函数，将任务添加到任务队列，或者从任务队列中删除，已处理的任务会被从任务队列中删除
线程池的使用者，也就是调用线程池函数往任务队列中添加任务的线程就是生产者线程

工作的线程（任务队列任务的执行者） ，N 个
线程池中维护了一定数量的工作线程，他们的作用是不停的读任务队列，从里边取出任务并处理
如果任务队列为空，工作的线程将会被阻塞(使用条件变量 / 信号量阻塞)
如果阻塞之后有了新的任务，由生产者将阻塞解除，工作线程开始工作。

管理者线程（不处理任务队列中的任务），1 个
它的任务是周期性的对任务队列中的任务数量以及处于忙状态的工作线程个数进行检测
当任务过多的时候，可以适当的创建一些新的工作线程，
当任务过少的时候，可以适当的销毁一些工作的线程，


//任务节点原理
难点：如何把所有功能函数进行统一，放入到一个节点当中.

我们要把这些具体功能的函数存放到单向链表当中去，而每个具体的功能函数，它的返回值，参数不可能都一模一样.

任务节点：

struct tasklist
{
    void* (*taskp)(void*);   //万能函数指针
    void* taskarg;           //用于保存传递给函数指针的参数.
    struct tasklist* next;   //指针域，指向下一个任务
}

参数解析：
void* (*taskp)(void*);       //万能函数指针：指向 void* func_name(void*) 这样的函数的指针。
                                           //返回值void*，因为任务执行函数必须是void*，需要保持一致。
                                           //函数名*taskp，表示这是一个指针变量（指向void*类型函数）
                                           //参数void*，因为任务执行函数的参数是void*，需要保持一致
void* taskarg;               //保存传递给函数指针的参数
                                            //如果任务执行函数有多个参数，则需要定义对应数量的这种参数，如 void* taskarg2; void* taskarg3;
                                            //同时万能函数指针也要相应变化，如 void* (*taskp)(void*, void*, void*);
struct tasklist* next;       //指针域，指向下一个任务，形成队列结构。


//任务队列
任务节点通过尾插加入队列，执行时取下头结点的下一节点（head->next），交由线程执行。


//线程池结构体
typedef struct pthread_pool
{
	pthread_mutex_t lock; 			//互斥锁
	pthread_cond_t cond; 			//条件变量
	struct task* task_list;			//任务链表的头节点
	pthread_t* tids;			    //用于指向一个堆空间，储存的线程池的线程号TID
	unsigned int max_waiting_tasks; //最大的任务数量
	unsigned int waiting_tasks;		//需要处理的任务数量
	unsigned int active_threads;	//活跃的线程数量
	bool shutdown;					//标志位代表线程池是否要被销毁
}thread_pool;



