
//用户态、内核态、特权指令、非特权指令
PSW寄存器用于标记当前处理器状态
应用程序使用非特权指令
内核程序使用特权指令，会触发中断，将处理器状态由用户态转为内核态。使用特权指令修改PSW可切换到用户态。
中断会让操作系统内核强行夺回CPU的控制权，同时使CPU转变为内核态。



//内存管理
内存映射：程序运行后会进行内存映射，每个进程都拥有各自映射的虚拟内存。
虚拟内存：虚拟内存其实就是将硬盘的一部分容量当内存使用，从而弥补物理内存不足的问题。
假设物理内存只有512M，通过 MMU（内存管理单元）进行映射后一个进程的内存空间会有4G的大小。
但这个4G内存只是一个可用范围。可同时操作的内存最多只有512M，因为实际内存只有512M。

内存条使用时分为两段，一段给内核用，一段留给用户。多个进程的内核空间占用同一块内核内存。



//原语
系统内核中，一些执行过程具有原子性(不会被中断)的程序。
原理：执行执行前关闭中断，执行后再打开中断。
关中断：CLI将IF位清除(置0)
开中断：STI将IF位设置(置1)



//进程切换
在CPU进行进程切换时，会将必要的寄存器中的信息保存到PCB中。待再次运行时通过PCB恢复。



