/********************/进程/************************************************************/

进程：它是一道运行起来的程序，是动态的概念，程序在运行时会占用CPU与总线等等一些系统资源。
	  进程是系统资源分配的最小单位，线程是系统调度的最小单位。
组成：进程控制块(PCB)，数据段，代码段。

PCB：一个进程被创建以后，操作系统会创建一个"struct task_struct"的结构体保存这个进程的所有资源，它也被称为该进程的PCB资源。
并发：指操作系统中，一个时间段中有多个进程都处于运行状态，但任何一个时间点上任只有一个进程在真正运行。


//CPU调度分类
高级调度（作业调度）：负责从外存中调入作业并为其分配资源。
中级调度（交换调度）：负责在内存紧张时调整进程在内存和外存之间的分配。
低级调度（进程调度）：负责在CPU空闲时从就绪队列中调度进程投入运行。


//CPU调度策略
先到先服务(FCFS)：		非抢占
短作业优先(SJF)：			非抢占，执行时间短的优先执行。
最短剩余时间优先(SRTN)：	抢占式，剩余执行时间最短的先执行。具有最短的平均等待和平均周转时间，但可能导致饥饿现象。
高响应比优先(HRRN)：		非抢占，在短作业优先的基础上增加等待因素，响应比大的优先执行。响应比=(等待时间+执行时间)/执行时间

时间片轮转(RR)：			抢占式
优先级调度：				抢占式/非抢占，分为静态优先级(优先级始终不变)和动态优先级(优先级根据情况改变)，可能导致饥饿。
多级反馈队列调度：		抢占式，将进程分成多个队列，每个队列具有不同的优先级，具有高优先级的队列会获得更短的时间片。如果进程在其时间片内没有完成，它将被移动到较低优先级的队列中，以避免饥饿情况，但仍然可能导致饥饿。

饥饿（Starvation）现象指进程一直被插队而无法获得所需资源或执行时间的现象。是由于资源分配不公平或调度策略不合理导致的。



/************************************************************/
//进程的六种状态
进程PCB中有个变量state来表示进程的当前状态。
各个状态下的进程使用指针和队列组织起来。

就绪态  ： 进程已经运行起来了, 但是CPU的执行权(时间片还没有轮询到该进程)还没切换到该程序.
执行态  ： CPU的执行权已经切换到了该进程，正在执行.
阻塞态  ： 进程中调用sleep()或则具有阻塞功能的函数（pause函数）（read函数）
暂停态  ： 进程受到外界发送的暂停信号.
僵尸态  ： 进程退出，父进程没有进行资源回收，就会变成僵尸态。
死亡态  ： 进程退出，父进程对其资源进行了回收，则进入到死亡态。
*挂起态 ： 由CPU中级调度到外存中的进程，进入挂起态。

就绪态->执行态： 提高动态优先级；上一进程的时间片耗完。
执行态->就绪态： 时间片耗完；其它进程提高优先级抢占了。
执行态->阻塞态： 遇到如sleep(), read()等有阻塞功能的函数。
执行态->暂停态： 接收到暂停信号 SIGSTOP 或 SIGTSTP。
暂停态->就绪态： 接收到恢复信号 SIGCONT。
执行态->僵尸态： 1.main函数中调用return
				 2.任意函数中调用 exit()， _exit()， Exit()。
				 3.最后一个线程结束或者调用pthread_exit()。
				 4.被系统信号杀死。
僵尸态->死亡态： 进程的PCB资源被回收，wait()或waitpid()等函数。



/********************/相关函数/************************************************************/
进程号PID：进程号的取值范围是在 0~65535 之间，当使用完之后才会循环使用。

linux操作系统在启动的时, 只有一个init的进程, init 进程PID == 1


获取PID：
#include <unistd.h>
pid_t getpid(void)				//获取当前进程PID
pid_t getppid(void)				//获取当前进程的父进程PID
pid_t getpgid(pid_t pid)		//获取当前进程组的GID，也就是组长进程的PID

创建进程：
#include <sys/types.h>
#include <unistd.h>
pid_t fork(void)				//创建一个新进程，复制原进程的大部分资源，并从该函数的下一条语句开始执行。
								//返回值 大于0：父进程返回子进程PID		等于0：子进程返回0		小于0：创建进程失败
								*遵循读时共享写时复制的原则，并非每次fork都直接分配了同样大小的内存，节省了内存开销。
								*调用 fork 函数之后，父进程先执行，还是子进程先执行是不确定的，取决于内核所使用的调度算法。

父子进程
复制部分：	数据段，代码段，堆，栈，宿主目录位置，进程工作目录位置，信号处理方式
没复制部分：进程的ID，返回值，各自的父进程，进程的创建时间，未决信号集
父子共享：	文件描述符，内存映射区，读时共享 写时复制（体现在全局变量）

孤儿进程： 父进程如果比子进程先退出，会导致系统无法回收子进程的资源，那么该子进程会变为孤儿进程。子进程资源将由init进程回收。


进程退出：
#include <stdlib.h>
void exit(int status)			//退出进程，冲刷缓冲区。		参数status：进程退出值，返回给父进程。
#include <unistd.h>
void _exit(int status)			//退出进程，不冲刷缓冲区。		参数status：进程退出值，返回给父进程。


进程资源回收：
#include <sys/wait.h>
pid_t wait(int* stat_loc)		//阻塞等待，回收子进程资源。	参数*stat_loc：用于保存子进程退出时的状态信息，若不需要可填NULL。
								//返回值：成功返回回收的子进程PID，失败返回-1.
pid_t waitpid(pid_t pid, int* stat_loc, int options)	//阻塞等待，回收子进程资源。	
								//参数pid：用于指定回收的进程	  参数*stat_loc：同上	参数options：填 WNOHANG 则非阻塞等待，填 0 则阻塞等待。
								//返回值：成功返回回收的子进程PID，失败返回-1，选择WNOHANG而且没有已退子进程返回0。


/************************************************************/
系统函数：
#include <stdlib.h>
int system(const char* command)		//在程序中执行shell命令。成功返回0，失败返回-1。

exec函数族
#include <unistd.h>
int execl(const char* path, const char* arg, .../* (char  *) NULL */)
int execlp(const char* file, const char* arg, .../* (char  *) NULL */)
int execle(const char* path, const char* arg, .../*, (char *) NULL, char * const envp[] */)
int execv(const char* path, char* const argv[])
int execvp(const char* file, char* const argv[])
int execvpe(const char* file, char* const argv[], char* const envp[])

//格式：exec函数族(路径，命令，NULL)
//作用:执行命令，相比于system函数，优点在于可以运行其它目录下的文件

//l系：表示可以有多个“路径，命令”
//p系：默认路径为环境变量目录
//v系：参数为指针变量形式（数组名）
//e系：设置环境变量数组，不使用原有的环境变量。设置新加载程序运行的环境变量



/********************/实例/************************************************************/
#include <stdio.h>


void fun(void)
{
	printf("fun");		//没有\n，不会立即打印。打印语句遇到'\n',exit(),return才会刷新缓冲区
	exit(0);			//退出进行打印，参数与return后的参数意义相同
	// _exit(0);		//不作打印直接退出
}


int main(void)
{
	fun();
	int pid = fork();

	if (pid == 0)//子进程
	{
		printf("子进程[%d], 其父进程为[%d] \n", getpid(), getppid());
		execl("./demo", "demo", NULL);							//程序替换为demo
		exit(0);												//子进程正常退出
	}
	if (pid > 0)//父进程
	{
		printf("父进程[%d], 其父进程为[%d] \n", getpid(), getppid());
		int cpid = wait(NULL);									//阻塞，等待回收子进程资源，wait与fork成对使用
		printf("子进程[%d]退出\n ", cpid); 						//c_pid值为回收的子进程的进程号

		//int ccpid = waitpid(-1, &status, 0);	//阻塞 等待回收子进程资源，此参数下效果与wait相等
		//printf("子进程[%d]退出状态status %d\n ", ccpid, WEXITSTATUS(status));
	}

	return 0;
}


//子进程退出时会向父进程发送一个SIGCHLD信号
//父进程的父进程为bash，退出后由bash回收




