/*************************/编解码协议/***************************************************************************/

//数字化后的视频信号能进行压缩主要依据两个基本条件
l  数据冗余。
例如如空间冗余、时间冗余、结构冗余、信息熵冗余等，即图像的各像素之间存在着很强的相关性。
消除这些冗余并不会导致信息损失，属于无损压缩。

l  视觉冗余。
人眼的一些特性比如亮度辨别阈值，视觉阈值，对亮度和色度的敏感度不同，使得在编码的时候引入适量的误差，也不会被察觉出来。
可以利用人眼的视觉特性，以一定的客观失真换取数据压缩。这种压缩属于有损压缩。


//视频冗余信息
空间冗余：图像相邻像素之间有较强的相关性
时间冗余：视频序列的相邻图像之间内容相似性
编码冗余：不同编码值出现的概率不同
视觉冗余：人的视觉系统对某些细节不敏感
知识冗余：规律性的结构可由先验知识和背景知识得到
结构冗余：某些图片中固定存在的分布模式

先验知识：
1、人眼对亮度分量的敏感度高于色度分量，轻微的色度变化对视觉体验影响很小
2、人眼对低频分量的敏感度高于高频分量，轻微的高频变化对视觉体验影响很小



//帧编码流程
预测、变换、量化、扫描、熵编码->码流


帧内编码：对I帧的处理，采用帧内编码方式，只利用本帧图像内的空间相关性
帧间编码：对PB帧的处理，采用帧间编码（运动估计和补偿），同时利用空间和时间上的相关性



/*************************/MPEG-4/***************************************************************************/
MPEG - 4是一种面向多媒体的编解码标准，主要用于视频、音频、3D图像等应用。MPEG - 4文件一般使用.mp4扩展名。

MPEG - 4于1998年11月公布，
由国际标准化组织（ISO）和国际电工委员会（IEC）下属的"动态影像专家组"（Moving Picture Experts Group，即MPEG）制定。
它利用很窄的带宽，通过帧重建技术，压缩和传输数据，以求以最少的数据获得最佳的图像质量。


MPEG - 4标准目前分为27个部分，统称为ISO / IEC14496国际标准，这些部件被称为“Part”。
Part 1，系统：描述视频和音频数据流的控制、同步以及混合方式（Multiplexing, MUX）。
Part 2，视频：定义了对各类视觉信息（包括自然视频、静止纹理、计算机合成图形等等）的编解码器。该部分采用了国际电联ITU的技术建议H.263，故业界亦称该部分为H.263。
Part 3，音频：定义了对各种音频信号进行编码的编解码器的集合，包括AAC（Advanced Audio Coding）。
Part 4，一致性：定义了对本标准其他的部分进行一致性测试方法。
Part 5，参考软件：提供了用于功能演示的软件。
Part 6，多媒体传输集成框架。
Part 7，优化的参考软件：在第五部分的基础上提供了优化示例。
Part 8，IP网络传输：定义了在IP网络上传输MPEG - 4内容的格式。
Part 9，参考硬件：提供了用于实现本标准功能的硬件设计方案。
Part 10，高级视频编码AVC（Advanced Video Coding）：定义了更高级的视频编解码器。该部分采用了国际电联ITU的技术建议H.264，故业界亦称该部分为H.264。
Part 11，场景描述与应用引擎。
Part 12，基本媒体文件格式。
Part 13，知识产权管理和保护的拓展。
Part 14，视频文件格式：在第十二部分的基础上定义了视频内容的存储格式。
Part 15，AVC文件格式：在第十二部分的基础上定义了AVC视频内容的存储格式。
Part 16，动画框架扩展。
Part 17，同步文本字幕格式。
Part 18，字体压缩和流媒体传输。
Part 19，合成信息流。
Part 20，简单场景描述。
Part 21，用于渲染的MPEG - J拓展。
Part 22，开放字体格式。
Part 23，符号化的音乐描述。
Part 24，音频与系统的交互定义。
Part 25，3D图形压缩模型。
Part 26，音频一致性检查。
Part 27，3D图形一致性检查。

* Part 3定义了音频编码器：AAC
* Part 2定义了视频编码器：H263
* Part 10定义了高级视频编码器：H264，也称AVC


//avc1和h264的区别
AVC1 描述 : H.264 bitstream without start codes.一般通过ffmpeg转码生成的视频，是不带起始码0×00000001的。
H264 描述 : H.264 bitstream with start codes.一般对于一下HDVD等电影的压制格式，是带有起始码0×00000001的。


// isom（ISO Base Media file）
isom 是在 "MPEG-4 Part 12" 中定义的一种基础文件格式，MP4、3gp、QT 等常见的封装格式，都是基于这种基础文件格式衍生的。

//MP4相关
MP4文件的格式主要由Part 12、Part 14 两部分进行定义。
其中：
Part 12 定义了ISO基础媒体文件格式，用来存储基于时间的媒体内容。
Part 14 实际定义了MP4文件格式，在Part 12的基础上进行扩展。

