/*************************/JPEG编码/***************************************************************************/
JPEG（Joint Photographic Experts Group），即联合图像专家组，是一种用于连续色调静止图像的压缩标准。

https://zhuanlan.zhihu.com/p/40356456

//编码流程
input->采样、块划分、中心化、DCT、量化、DC差分、AC RLC、Huffman->output

（1）采样
色彩空间转换：将每个像素的RGB888转换为YUV444。这个过程是可逆的，信息并没有损失。
颜色降采样：将YUV444变化为YUV420，色度信息是求取的周围4个像素点的平均值，数据压缩到原来的一半。
查看的时候会重建RGB888，因为显示器都是RGB的，但是还原回来的RGB和编码之前的RGB是有差别的。

（2）块划分
将输入数据按8x8像素划分数据块，源图像如果不是8x8的整数倍，需进行补充

（3）DCT变换（对Y、Cr、Cb分别进行离散余弦变换，但并不压缩图像大小）
减去128再进行DCT，DCT可接受的范围是[-128, 127)
DCT变换，得到64个基底系数，(0, 0)位置是直流系数，是64个源数据的均值
DCT在复杂度和失真上是最好的trade - off
我们暂时先只考虑水平方向上一行数据（8个像素）的情况时的DCT变换，从而来说明其物理意义。如下图所示：
原始的图像信号（最左边的波形）经过DCT变换之后变成了8个波，其中第一个波为直流成分，其余7个为交流成分。
由于大多数图像的高频分量比较小，相应的图像高频分量的DCT系数经常接近于0，
再加上高频分量中只包含了图像的细微的细节变化信息，而人眼对这种高频成分的失真不太敏感，
所以，可以考虑将这一些高频成分予以抛弃，从而降低需要传输的数据量。
这样一来，传送DCT变换系数的所需要的编码长度要远远小于传送图像像素的编码长度。
到达接收端之后通过反离散余弦变换就可以得到原来的数据，虽然这么做存在一定的失真，
但人眼是可接受的，而且对这种微小的变换是不敏感的。

（4）量化
对亮度和色度分量的DCT系数进行量化，使用如下量化表，该量化表是从广泛的实验中得出的。当然，也可以自定义量化表
//标准亮度分量量化表
static const unsigned int std_luminance_quant_tbl[DCTSIZE2] = {
    16,  11,  10,  16,  24,  40,  51,  61,
    12,  12,  14,  19,  26,  58,  60,  55,
    14,  13,  16,  24,  40,  57,  69,  56,
    14,  17,  22,  29,  51,  87,  80,  62,
    18,  22,  37,  56,  68, 109, 103,  77,
    24,  35,  55,  64,  81, 104, 113,  92,
    49,  64,  78,  87, 103, 121, 120, 101,
    72,  92,  95,  98, 112, 100, 103,  99
};
//标准色度分量量化表
static const unsigned int std_chrominance_quant_tbl[DCTSIZE2] = {
    17,  18,  24,  47,  99,  99,  99,  99,
    18,  21,  26,  66,  99,  99,  99,  99,
    24,  26,  56,  99,  99,  99,  99,  99,
    47,  66,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99,
    99,  99,  99,  99,  99,  99,  99,  99
};
量化表搞掉了很多高频量，对DCT变换进行量化后得到量化结果，会出现大量的0，使用Z形扫描，
可以将大量的0连到一起，减小编码后的大小。越偏离左上方，表示频率越高，这里其实是通过量化，将图像的高频信息干掉了。

（5）DC和AC分量编码
DC进行DPCM编码，AC进行RLC编码，这两种编码都有中间格式，进一步减小存储量，原理可自行wiki

（6）熵编码
在得到DC系数的中间格式和AC系数的中间格式之后，为进一步压缩图像数据，有必要对两者进行熵编码，
通过对出现概率较高的字符采用较小的bit数编码达到压缩的目的。
JPEG标准具体规定了两种熵编码方式：Huffman编码和算术编码。JPEG基本系统规定采用Huffman编码。
Huffman编码：对出现概率大的字符分配字符长度较短的二进制编码，对出现概率小的字符分配字符长度较长的二进制编码，
从而使得字符的平均编码长度最短。
Huffman编码时DC系数与AC系数分别采用不同的Huffman编码表，对于亮度和色度也采用不同的Huffman编码表。
因此，需要4张Huffman编码表才能完成熵编码的工作。具体的Huffman编码采用查表的方式来高效地完成。
然而，在JPEG标准中没有定义缺省的Huffman表，用户可以根据实际应用自由选择，也可以使用JPEG标准推荐的Huffman表。
或者预先定义一个通用的Huffman表，也可以针对一副特定的图像，在压缩编码前通过搜集其统计特征来计算Huffman表的值。
（通过霍夫曼树，记录0出现多少次，1出现多少次的方式来进行数据压缩。霍夫曼压缩是所有数据压缩的一个基础，且是一个无损压缩。）

