/*************************/H264码流解析/***************************************************************************/

//H264编码原理
宏块的划分（宏块的组成：宏块类型、预测类型、CPB、QB、宏块颜色数据）
图像分组（有差别的像素只有10% 以内的点，亮度差值变化不超过2% ，而色度差值的变化只有1% 以内，被分为一个GOP）
帧内压缩技术原理（宏块第一排和第一列像素数据记录和方向预测）
帧间压缩技术原理（I、P、B帧）
DCT
CABAC压缩原理。


//H264编码流程
摄像头
信源编码器：划分宏块，划分为16*16，8*8等像素大小的宏块
视频复合编码器：记录宏块第一排和第一列像素信息，以及方向预测
传输缓冲器：缓存，如B帧需要等到后面的I帧或P帧输出后才可以输出
传输编码器
H264码流

编码器将与I帧相似程度70%的下一帧图像编码为P帧，相似程度90%的图像数据编码为B帧。


//录制顺序与码流顺序（编码输出顺序）不一定相同，如
录制顺序：I、B、B、P
码流顺序：I、P、B、B
解码输出顺序：I、B、B、P


//学习思路：
（1）根据流程图，从最右侧码流开始，一步步各个击破，最终学完解码器各个知识点。
（2）编码器和解码器其实只是步骤相反罢了，一边学习解码器各个知识点，一边反过来思考，编码过程如何实现。

//学习主线分段
（1）h264句法元素的解析：NALU的结构和熵解码，同时熵解码又包括指数哥伦布编码、CAVLC、CABAC。
只要掌握了NALU和熵解码，我们就可以从码流中解析出各个句法元素的值。

（2）数据准备：DCT变换、量化、重排序，和它们相关的句法元素及语义。
这个过程是为后面的重建图像做准备，这时我们已经解析出各个句法元素，实现该过程需要配合各步骤所需要的句法元素。

（3）重建图像：帧内预测、帧间预测、去块效应滤波器。
这时候码流数据已经完全解压缩，就差拿着残差数据、参考图像和预测所需的句法元素，预测出预测数据。
预测数据经过去块效应后即可得解码宏块，当前图像的所有宏块解码完成，就可以得到重建图像用于显示。

//学习辅线
（1）h.264 POC的计算
（2）h.264的加权预测
（3）h.264 FMO
（4）h.264参考图像列表
（5）加权预测
（6）量化
（7）帧内预测
（8）片、宏块之间的关系
（9）片类型与宏块类型
（10）NALU
（11）指数哥伦布编码
（12）熵编码
（13）YUV颜色空间
（14）残差

//描述符（descriptor）是正确打开码流解析的第一步。
描述符乍一看很多，其实我们可以把它们分为三类：

（1）连续读取n（包含b(8)）个比特：b(8)、f(n)、i(n)、u(n)，其中只有i(n)为有符号整数，并且几乎用不到，
其他情况则顺序从左至右，读取固定数量的n个bit即可。如上面所讲的NALU Header的句法元素
（2）指数哥伦布编码：ue(v)、me(v)、se(v)、te(v)，这四个描述子，都是指数哥伦布编码。
注意到它们使用的变量是v而不是n，它们的值，并不是直接等于读取固定长度的比特。
而是先根据其他句法元素的值，来确定读取多少比特，然后再将读取到的比特，进行转换才能得到所求句法元素的值。
关于它们，我们后面会单独开几篇来介绍。
（3）CAVLC、CABAC：ae(v)、ce(v)，同指数哥伦布编码一样，CAVLC和CABAC也属于变长编码，这也是我们需要学习的一大重点。

在解析宏块层mb_type的时候，该句法元素对应了两个描述子，分别为ue(v)和ae(v)，并且它们之间用竖线 “ | ” 分隔开。【ue(v) | ae(v)】
H.264协议规定，出现这种情况，得根据另一句法元素entropy_coding_mode_flag 的值来判断：
如果entropy_coding_mode_flag等于0，则使用左边的描述子，这时为ue(v)。
如果entropy_coding_mode_flag等于1，则使用右边的描述子，这时为ae(v)。



/*************************/POC的计算/***************************************************************************/
在H.264编码中，如果没有B帧，那么视频的编码顺序和视频的播放顺序通常是相同的。
这是因为在没有B帧的情况下，只有I帧和P帧。

