/********************/SDP协议/************************************************************/
sdp信息由多行"<type>=<value>"组成，其中<type>是一个字符串，<value>是一个字符串，
type表示类型，value的格式视type而定，整个协议区分大小写，"="两侧不允许有空格！


//📦 常见会使用 SDP 的协议
协议				作用					说明
SIP				会话控制				在 INVITE 请求中附带 SDP，描述通话媒体参数
RTSP			控制流媒体播放		用 SDP 描述视频流的编码、地址、端口等信息
SAP				会话公告				用于多播中广播 SDP 信息，让其他人“知道有会话可加入”
WebRTC			实时通信（浏览器）	使用 SDP 协商媒体能力（通过 offer / answer 模型）
MGCP / H.248	网关控制协议			语音网关与媒体网关之间的控制通信中使用 SDP 描述流

//实例
R"(
v=0
o=- 123456 1 IN IP4 192.168.1.10
s=VoIP Call
c=IN IP4 192.168.1.10
t=0 0
m=audio 49170 RTP/AVP 0
a=rtpmap:0 PCMU/8000
)"
