/********************/基本概念/************************************************************/

//MAC地址
MAC地址（Media Access Control地址），也称为物理地址或硬件地址，是网络设备在网络中的唯一标识符。对应于数据链路层。
MAC地址由48比特（6字节）组成，是一个16进制的数字序列。
其中，前24位是由IEEE（电气电子工程师协会）统一分配给不同厂商的组织唯一标识符（OUI），也称为厂商识别码。
而后24位则由厂商自行分配，用来标识每个厂商生产的具体设备。

//通信设备
网线：实现了单台电脑与单台电脑间的通信。
集线器：将一台电脑的消息，直接转发给其它所有电脑，由各个电脑识别报头（mac地址）。位于物理层。
交换机：将一台电脑的消息，识别报头（mac地址）后，发送给对应电脑。位于数据链路层。
路由器：连接了多个交换机，同时可以将数据包（通过IP地址）在多个路由器间转发。拥有独立的 MAC 地址。位于网络层。

//交换机
MAC地址由电脑的网卡决定。
交换机内部维护一张 MAC 地址表，记录着每一个 MAC 地址的设备，连接在其哪一个端口上。
最开始的时候，交换机的 MAC 地址表为空，此时收到了一台电脑发送的数据包，便记录下了所连端口和其MAC地址。
此时信息将转发给所有端口，由各个电脑自行识别。交换机确认接收者，记录下它的端口和其MAC地址。
交换机和交换机之间可以相连，以拓展端口。

//路由器
路由器连接多个交换机。
交换机会将路由器填到MAC地址表中。
路由器会将交换机填到路由表中。
路由表结构：目的地址（含子网掩码） - 下一跳 - 端口

//子网
192.168.0.1 和 192.168.0.2 处于同一个子网
192.168.0.1 和 192.168.1.1 处于不同子网
如果源 IP 与目的 IP 处于一个子网，直接将包通过交换机发出去。
如果源 IP 与目的 IP 不处于一个子网，就交给路由器去处理。

//子网掩码
子网划分是通过子网掩码来实现的。子网掩码是一个32位的地址掩码，用于将IP地址划分为网络部分和主机部分。
子网掩码中的“1”表示网络部分（255），“0”表示主机部分（0）。
通过调整子网掩码中的“1”和“0”的数量，可以实现对网络的不同划分。
由于子网掩码其实就表示前多少位表示子网的网段，所以如 192.168.0.0（255.255.255.0） 也可以简写为 192.168.0.0 / 24
假如某台机器的子网掩码定为 255.255.255.0
这表示，将源 IP 与目的 IP 分别同这个子网掩码进行与运算，相等则是在一个子网，不相等就是在不同子网，就这么简单。
比如
A电脑：192.168.0.1 & 255.255.255.0 = 192.168.0.0
B电脑：192.168.0.2 & 255.255.255.0 = 192.168.0.0
C电脑：192.168.1.1 & 255.255.255.0 = 192.168.1.0
D电脑：192.168.1.2 & 255.255.255.0 = 192.168.1.0
那么 A 与 B 在同一个子网，C 与 D 在同一个子网。

//网关
电脑给不同子网的另一台电脑发送数据包，会将数据包发给路由器，而默认网关就是路由器的IP地址。

//ARP 协议
发送数据包的数据链路层需要知道 MAC 地址，此时只知道对方的IP地址。因此，就需要ARP协议来解决这个问题。
ARP协议位于数据链路层。
ARP缓存表：每个电脑中都有一张arp缓存表，表中记录着 IP 与 MAC 地址的对应关系。
一开始的时候这个表是空的，电脑 A 为了知道电脑 B（192.168.0.2）的 MAC 地址，将会广播一条 arp 请求，
B 收到请求后，带上自己的 MAC 地址给 A 一个响应。此时 A 便更新了自己的 arp 表。
这样通过大家不断广播 arp 请求，最终所有电脑里面都将 arp 缓存表更新完整。

//整个传输过程
<电脑视角>
1、首先我要知道我的 IP 以及对方的 IP
2、通过子网掩码判断我们是否在同一个子网
3、在同一个子网就通过 arp 获取对方 mac 地址直接扔出去
4、不在同一个子网就通过 arp 获取默认网关的 mac 地址直接扔出去
<交换机视角>
1、我收到的数据包必须有目标 MAC 地址
2、通过 MAC 地址表查映射关系
3、查到了就按照映射关系从我的指定端口发出去
4、查不到就所有端口都发出去
<路由器视角>
1、我收到的数据包必须有目标 IP 地址
2、通过路由表查映射关系
3、查到了就按照映射关系从我的指定端口发出去（不在任何一个子网范围，走其路由器的默认网关也是查到了）
4、查不到则返回一个路由不可达的数据包

网络层（IP协议）本身没有传输包的功能，包的实际传输是委托给数据链路层（以太网中的交换机）来实现的。

//三张表
交换机中有 MAC 地址表用于映射 MAC 地址和它的端口。是通过以太网内各节点之间不断通过交换机通信，不断完善起来的。
路由器中有路由表用于映射 IP 地址(段)和它的端口。是各种路由算法 + 人工配置逐步完善起来的。
电脑和路由器中都有** arp 缓存表** 用于缓存 IP 和 MAC 地址的映射关系。是不断通过 arp 协议的请求逐步完善起来的。



/********************/网络协议/************************************************************/

//网络模型
OSI七层模型：物理层、数据链路层、网络层、传输层、会话层、表示层、应用层
TCP / IP模型：网络接口层（物理层 + 链路层）、网络层、传输层、应用层
网络编程：基于网络协议的编程

//TCP/IP协议
TCP / IP协议是指能够在多个不同网络间实现信息传输的协议簇。由FTP、SMTP、TCP、UDP、IP等协议共同构成。
TCP协议 ： 负责发现传输的问题，并在有问题时发出信号要求重新传输，直到所有数据都安全正确地传输到目的地。
IP 协议 ： 负责给因特网的每一台联网设备规定一个地址。

//TCP/IP模型典型协议
1.应用层 : HTTP协议，FTP协议。
2.传输层 : TCP协议，UDP协议。
3.网络层 : IP协议、ICMP协议、IGMP协议。
4.网络接口层 : 常ARP 协议、RARP协议。

//网络字节序（大端序）
无论是什么类型的数据，都得转换为二进制的字节码流才能在网络环境中进行传输。
TCP / IP协议规定，网络数据流应采用大端字节序，即低地址高字节。
发送与接收 IP地址 + 端口号 时，需要将 网络字节序 和 本地字节序 进行转换。

//C/S模型
优点：使用C / S模式可以提前在本地进行大量数据的缓存处理，他们之间所采用的协议相对灵活。
缺点：由于客户端和服务器都需要有一个开发团队来完成开发。工作量将成倍提升，开发周期较长。



/********************/OSI七层模型解析/************************************************************/
//应用层
是最靠近用户的OSI层。这一层为用户的应用程序（例如电子邮件、文件传输和终端仿真）提供网络服务.

//表示层
协商数据交换格式，确保发送方和接收方能够正确地解析数据。

//会话层
通过传输层(端口号:传输端口与接收端口)建立数据传输的通路。
主要在你的系统之间发起会话或者接受会话请求。（设备之间需要互相认识可以是IP也可以是MAC 或者是主机名)。

//传输层
定义了一些传输数据的协议和端口号。
主要是将从下层接收的数据进行分段和传输，到达目的地址后再进行重组。

//网络层
在位于不同地理位置的网络中的两个主机系统之间，通过IP地址寻路，提供连接和路径选择。
Internet 的发展使得从世界名站点访问信息的用户数大大增加，而网络层正是管理这种连接的层。

//数据链路层
定义了如何让格式化数据以帧为单位进行传输，以及如何让控制对物理介质的访问。
这一层通常还提供错误检测和纠正，以确保数据的可靠传输。数据效验
如 : 串口通信中使用到的115200、8、N、1

//物理层
主要定义物理设备标准，如网线的接口类型、光纤的接口类型、各种传输介质的传输速率等。
它的主要作用是传输比特流, 这一层的数据叫做比特。
就是由1、0转化为电流强弱来进行传输，到达目的地后再转化为1、0，也就是我们常说的数模转换与模数转换。



/********************/TCP/IP四层模型解析/************************************************************/
在我们使用 TCP /IP 协议进行通信的时候，数据将由应用层到链路层层层封装，才能网络中传递。接收方接收到数据也要层层拆解。


传输层封装：TCP与UDP的报头，包括源端口号和目的端口号等。
网络层封装：IP报头，包括协议类型、源IP、目的IP等。
链路层封装：IPv4、ARP、IPV6、PPPoE等协议的帧头。


链路层有以太网、令牌环网等标准，链路层负责网卡设备的驱动、帧同步、冲突检测、数据差错校验等工作。

不同的协议层对数据包有不同的称谓，在传输层叫做段（segment），在网络层叫做数据报（datagram），在链路层叫做帧（frame）。

IP地址：可以在网络环境中，标识一台唯一的主机
端口号：通过IP地址寻找到唯一的主机，标识该主机当中的唯一进程
所以，在网络通信当中，IP地址 加上 端口号 可以在网络环境当中，找到唯一的一个进程。



/********************/TCP与UDP的区别/************************************************************/
//TCP与UDP
TCP传输控制协议：是一种面向连接的、可靠的、基于字节流的传输层通信协议。
UDP用户数据报协议：是OSI参考模型中一种无连接的传输层协议，提供面向事务的简单、不可靠信息传送服务。


				UDP										TCP
是否连接			无连接									面向连接
是否可靠			不可靠（没有确认机制、流量控制、拥塞控制）		可靠（有确认机制、流量控制、拥塞控制）
连接对象个数		支持一对一、一对多、多对一、多对多交互通信		只支持一对一通信
传输方式			面向报文									面向字节流
使用场景			适用于实时应用（IP电话、视频会议、直播等）		适用于要求可靠传输的应用，如文件传输等






