/********************/应用/************************************************************/
MTU（Maximum Transmission Unit，最大传输单元）指一种通信协议的某一层上面所能通过的最大数据包大小（单位字节）。这个参数通常与通信接口有关。
MSS（Maximum Segment Size，最大报文段长度）指的是TCP/UDP报文段所能使用的最大数据段大小。MSS的大小会受到MTU限制。


//当MTU不合理时会造成如下问题
1.本地MTU值 > 网络MTU值时，本地传输的"数据包"过大导致会拆包后传输，会产生额外的数据包，而且消耗了“拆包、组包”的时间。
2.本地MTU值 < 网络MTU值时，传输能力未完全发挥。


//TCP、UDP数据包大小的限制
链路层：由以太网的物理特性决定了数据帧的长度为[(46＋18), (1500＋18)]，其中的18是数据帧的头和尾，也就是说MTU为1500；
网络层：因为IP包的首部要占用20字节，所以这时的MTU为1500－20＝1480；
传输层：对于UDP包的首部要占用8字节，所以这时的UDP段中应用数据部分最大为1480－8＝1472；
---------对于TCP包的首部要占用20字节，所以这时的TCP段中应用数据部分（MSS）为1480－20＝1460；

如果UDP包数据大于MTU（1472）时，发送方的IP层需要"分片"进行传输, 而在接收方IP层则需要进行数据报重组，
由于UDP是不可靠的传输协议，如果分片丢失导致重组失败，将导致UDP数据包被丢弃。

Socket编程时，UDP协议要求包小于64K（65535）。sendto函数最大能发送数据的长度为65535 - IP头(20) - UDP头(8)＝65507字节。
TCP没有限定，TCP包头中就没有“包长度”字段，而完全依靠 IP 层去处理分帧。
因此 TCP 常常被称作一种“流式协议“，即TCP协议本身会进行拥塞 / 流量控制。

在普通的局域网环境下，UDP的数据最大为1472字节最好(避免分片重组)。
但在网络编程中，Internet中的路由器可能有设置成不同的值(小于默认值)，
Internet上的标准MTU值为576，所以Internet的UDP编程时数据长度最好在576－20－8＝548字节以内。

//其它
数据包的大小还应考虑到网络的延迟和丢包率。较大的数据包可能会导致较高的延迟和更高的丢包率，尤其是在网络条件较差的情况下。
应用程序的需求也是确定TCP数据包大小的重要因素。不同的应用程序对数据传输的实时性、吞吐量和可靠性有不同的要求。

//缓冲区大小
对于UDP来说，由于其是无连接的协议，因此其缓冲区的设置也需要特别考虑。
UDP的接收缓冲区最小值通常为256 bytes，发送缓冲区最小值为2048 bytes，这些是由内核的宏决定的。
然而，实际使用中，这些值可能需要根据具体的网络环境和应用需求进行调整。







