/********************/UDP/************************************************************/

//UDP数据报格式
16位源端口号
16位目的端口号
16位报文长度
16位校验和
数据


//UDP基本特征
无连接：通信双方不需要事先连接
无确认：收到数据不给对方发回执确认
不保证有序、丢失不重发
采用帧同步的数据报通信方式（即通信双方每次的收发数据量相等）

//套接字属性
由于套接字的属性繁多，因此为了更加清晰，系统将这些不同的属性放置到各个 Socket Option Level 中，即属性层次SOL。

//广播
路由器从来不会转发本地广播的数据包，但同一个子网的所有主机都会接收到本地广播的数据包。
它不经路由转发，不用知道目标主机的掩码与网络地址，发送本地网络下的所有主机，只能在局域网内转发。

//广播特点
1、广播只能在局域网内使用
2、广播是UDP通信特有的通信方式
3、在发送广播消息的时候，必须要把数据发送到广播地址上.
4、广播分为两端，即数据发送端和数据接收端，通过广播的方式发送数据，发送端和接收端的关系是 1:N
5、发送广播消息的一端（发送端），通过广播地址，可以将消息同时发送到局域网的多台主机上（接收端）
6、只要发送端在发送广播消息，数据接收端就能收到广播消息，消息的接收是无法拒绝的，除非将接收端的进程关闭才接收不到。当端口不匹配时，数据才会丢弃。

接收方一定要知道广播方的端口号，然后绑定此端口号才能正确接收。
接收端的端口号要与广播端绑定的端口号一样，接收方的Socket不需要设置成广播属性。


//组播
广播使用的是广播地址，组播需要使用组播地址。
广播和组播属性默认都是关闭的，如果使用需要通过 setsockopt() 函数进行设置。

组播需要使用组播地址，在 IPv4 中它的范围从 224.0.0.0 到 239.255.255.255.







