/********************/IP协议/************************************************************/

//地址分类
地址类别		网络字节序	主机字节序		取值范围					备注
A类地址		1字节		3字节			1.0.0.1--127.255.255.255		网络地址的最高位必须是 "0"开始
B类地址		2字节		2字节			128.0.0.1--191.255.255.255	网络地址的最高位必须是 "10"开始
C类地址		3字节		1字节			192.0.0.1--223.255.255.255	网络地址的最高位必须是 "110"开始
D类地址		不区别网络字节序和主机字节序		224.0.0.1--239.255.255.255	网络地址的最高位必须是 "1110"开始
E类地址		不区别网络字节序和主机字节序		240.0.0.1--254.255.255.255	网络地址的最高位必须是 "1111"开始


//私有IP地址
A、B、C类地址中，分为公有IP和私有IP。
公有IP就是「可以注册」购买的IP；
私有IP就是「无法注册」的，用于内部使用的私有地址，私有地址如下：

A类	10.0.0.0–10.255.255.255，1个
B类	172.16.0.0–172.31.255.255，16个
C类	192.168.0.0–192.168.255.255，255个

A、B、C类地址范围中，私有IP外的地址都是公有地址（特殊地址除外）。


//特殊地址
类型			地址格式					描述
全0地址		0.0.0.0					路由表的默认路由，表示整个网络，即网络内的所有主机，而非某一个主机，不可用。
网络号全0		0.x.x.x					本网内某个特定主机
主机号全0		x.0.0.0					网络地址，表示整个网络
全1地址		255.255.255.255			子网的广播地址，路由器不转发
主机号全1		x.255.255.255				广播地址，对当前网络所有主机进行广播
环回地址		127.0.0.1 ~127.255.255.254	代表本机IP，可用于测试网络连通性


//IP数据报格式
1）版本（4位）：IP协议版本，目标主机按照此版本解释数据，如果目标主机使用的是其他版本，则丢弃数据报。
2）首部长度（4位）：数据报协议头长度，最小值为5，最大值为15。
3）服务（8位）：用于分配优先级、延迟、吞吐量以及可靠性；前3位是优先级，后面4位成为服务类型，最后1位没有定义。在一般的情况下都不使用这个字段。
4）总长度（16位）：IP数据报的字节长度（协议头部和数据），其最大值为65535字节。
5）标识（16位）：一个整数，数据报分段时，用于识别当前数据报。
6）标记（3位）：由3位字段构成，最低位（MF）控制分段，存在下一个分段置为1，否则置0代表该分段是最后一个分段；中间位（DF）指出数据报是否可进行分段，如果为1则机器不能将该数据报进行分段；第三位即最高位保留不使用，值为0。
7）分段偏移（13位）：指出数据在源数据报中的相对位置，用于重组源数据。
8）生存时间（8位）：一种计数器，在丢弃数据报的每个点值依次减1直至减少为0。防止无法交付的数据报无限制地在互联网中兜圈子。
9）协议（8位）：指明上层接收数据报的协议。TCP（6）,UDP（17）。
10）头部校验和（16位）：该字段帮助确保IP协议头的完整性。由于某些协议头字段的改变，这就需要对每个点重新计算和检验。计算过程是先将校验和字段置为0，然后将整个头部每16位划分为一部分，将个部分相加，再将计算结果取反码，插入到校验和字段中。
11）源地址（32位）	      ：源主机IP地址，该字段在IPv4数据报从源主机到目的主机传输期间必须保持不变。
12）目的地址（32位）：目标主机IP地址，该字段在IPv4数据报从源主机到目的主机传输期间同样必须保持不变。


//数据分片
IP协议负责将网络层的IP数据报（IP分组）传输到链路层，由链路层将数据封装成帧。
帧最多只能封装 1500 字节（默认）的数据，当超过上限时，就需要分割数据，
放到多个数据帧中传输，到达目标主机后，再将数据重组起来。

分割和重组的操作在路由器中完成，发送方发送的信息经过路由器时，路由器会将数据「分割」，放到不同的数据帧中，
并在帧首部的字段（MF）标明数据的顺序；当数据传输到目的路由器后，再根据帧首部的字段将信息「重组」，发送给目标主机。



/********************/HTTP协议/************************************************************/

HTTP协议定义Web客户端如何从Web服务器请求Web页面，以及服务器如何把Web页面传送给客户端。
HTTP协议采用了请求 / 响应模型。客户端向服务器发送一个请求报文，请求报文包含请求的方法、URL、协议版本、请求头部和请求数据。
服务器以一个状态行作为响应，响应的内容包括协议的版本、成功或者错误代码、服务器信息、响应头部和响应数据。


以下是 HTTP 请求 / 响应的步骤：
//1、客户端连接到Web服务器
一个HTTP客户端，通常是浏览器，与Web服务器的HTTP端口（默认为80）建立一个TCP套接字连接。

//2、发送HTTP请求
通过TCP套接字，客户端向Web服务器发送一个文本的请求报文，一个请求报文由请求行、请求头部、空行和请求数据4部分组成。

//3、服务器接受请求并返回HTTP响应
Web服务器解析请求，定位请求资源。服务器将资源复本写到TCP套接字，由客户端读取。一个响应由状态行、响应头部、空行和响应数据4部分组成。

//4、释放连接TCP连接
若connection 模式为close，则服务器主动关闭TCP连接，客户端被动关闭连接，释放TCP连接; 若connection 模式为keepalive，则该连接会保持一段时间，在该时间内可以继续接收请求;

//5、客户端浏览器解析HTML内容
客户端浏览器首先解析状态行，查看表明请求是否成功的状态代码。然后解析每一个响应头，响应头告知以下为若干字节的HTML文档和文档的字符集。客户端浏览器读取响应数据HTML，根据HTML的语法对其进行格式化，并在浏览器窗口中显示。

//实例：在浏览器地址栏键入URL，按下回车之后会经历以下流程：
1. 浏览器向 DNS 服务器请求解析该 URL 中的域名所对应的 IP 地址;
2. 解析出 IP 地址后，根据该 IP 地址和服务器的默认端口 80，和服务器建立TCP连接;
3. 浏览器发出读取文件(URL 中域名后面部分对应的文件)的HTTP 请求，该请求报文作为 TCP 三次握手的第三个报文的数据发送给服务器;
4. 服务器对浏览器请求作出响应，并把对应的 html 文本发送给浏览器;
5. 释放 TCP连接;
6. 浏览器将该 html 文本并显示内容;


//特点
基于 请求 - 响应 的模式：请求从客户端发出, 最后服务器端响应该请求并 返回。
无状态保存：不对请求和响应之间的通信状态进行保存。
无连接：无连接的含义是限制每次连接只处理一个请求。
服务器处理完客户的请求，并收到客户的应答后，即断开连接。采用这种方式可以节省传输时间，并且可以提高并发性能



————————————————————————————————————————————————————
//HTTP请求方法
HTTP / 1.1协议中共定义了八种方法（也叫“动作”）来以不同方式操作指定的资源：

GET
向指定的资源发出“显示”请求。使用GET方法应该只用在读取数据，而不应当被用于产生“副作用”的操作中，例如在Web Application中。其中一个原因是GET可能会被网络蜘蛛等随意访问。

HEAD
与GET方法一样，都是向服务器发出指定资源的请求。只不过服务器将不传回资源的本文部分。它的好处在于，使用这个方法可以在不必传输全部内容的情况下，就可以获取其中“关于该资源的信息”（元信息或称元数据）。

POST
向指定资源提交数据，请求服务器进行处理（例如提交表单或者上传文件）。数据被包含在请求本文中。这个请求可能会创建新的资源或修改现有资源，或二者皆有。

PUT
向指定资源位置上传其最新内容。

DELETE
请求服务器删除Request - URI所标识的资源。

TRACE
回显服务器收到的请求，主要用于测试或诊断。

OPTIONS
这个方法可使服务器传回该资源所支持的所有HTTP请求方法。用’ * '来代替资源名称，向Web服务器发送OPTIONS请求，可以测试服务器功能是否正常运作。

CONNECT
HTTP / 1.1协议中预留给能够将连接改为管道方式的代理服务器。通常用于SSL加密服务器的链接（经由非加密的HTTP代理服务器）。


//注意事项
1、方法名称是区分大小写的。当某个请求所针对的资源不支持对应的请求方法的时候，
服务器应当返回状态码405（Method Not Allowed），
当服务器不认识或者不支持对应的请求方法的时候，应当返回状态码501（Not Implemented）。
2、HTTP服务器至少应该实现GET和HEAD方法，其他方法都是可选的。
当然，所有的方法支持的实现都应当匹配下述的方法各自的语义定义。
此外，除了上述方法，特定的HTTP服务器还能够扩展自定义的方法。
例如PATCH（由 RFC 5789 指定的方法）用于将局部修改应用到资源。


//状态码
所有HTTP响应的第一行都是状态行，依次是当前HTTP版本号，3位数字组成的状态代码，以及描述状态的短语，彼此由空格分隔。
状态代码的第一个数字代表当前响应的类型：
1xx消息——请求已被服务器接收，继续处理
2xx成功——请求已成功被服务器接收、理解、并接受
3xx重定向——需要后续操作才能完成这一请求
4xx请求错误——请求含有词法错误或者无法被执行
5xx服务器错误——服务器在处理某个正确请求时发生错误


//URL
超文本传输协议（HTTP）的统一资源定位符将从因特网获取信息的五个基本元素包括在一个简单的地址中：

传送协议。 层级URL标记符号(为[//],固定不变) 访问资源需要的凭证信息（可省略） 服务器。（通常为域名，有时为IP地址）
端口号。（以数字方式表示，若为HTTP的默认值“:80”可省略） 路径。（以“/”字符区别路径中的每一个目录名称）
查询。（GET模式的窗体参数，以“?”字符为起点，每个参数以“&”隔开，再以“=”分开参数名称与数据，通常以UTF8的URL编码，避开字符冲突的问题）
片段。以“#”字符为起点
以http://www.luffycity.com:80/news/index.html?id=250&page=1 为例, 其中：

http，是协议；
www.luffycity.com，是服务器；
80，是服务器上的默认网络端口号，默认不显示；
/news/index.html，是路径（URI：直接定位到对应的资源）；
?id=250&page=1，是查询。

