/********************/TCP/************************************************************/

//TCP数据报格式
16位源端口号     ：发送数据的进程。
16位目的端口号   ：进程，用于确定哪个进程来进行接收该数据。
32位报文序列号   ：报文的编号。
32位确认序号     ：表示下一个准备接收的包的序列码，也就是上一个接收到的报文序号+1。
4位首部长度   ：表示TCP报头的长度。其值所表示的并不是字节数，而是头部的所含有的32bit的数目（或者倍数）
6位保留
6位标志位（六个）：URG、ACK、PSH、RST、SYN、FIN是六个控制位。使用位或设置多个。
16位窗口大小   ：此字段用来进行流量控制。流量控制的单位为字节数，这个值是本端期望一次接收的字节数。
16位校验和   ：对整个TCP报文段，即TCP头部和TCP数据进行校验和计算，接收端用于对收到的数据包进行验证。
16位紧急指针   ：它是一个偏移量，和SN序号值相加表示紧急数据最后一个字节的序号。
选项
数据


//TCP的6个标志位
紧急比特 URG       ：当 URG = 1 时，表明此报文段中有紧急数据，应尽快传送(相当于高优先级的数据)。
确认比特 ACK       ：只有当 ACK = 1 时确认号字段才有效。当 ACK = 0 时，确认号无效。
推送比特 PSH(Push) ：接收方 TCP 收到推送比特置 1 的报文段，就尽快地交付给接收应用进程，而不再等到整个缓存都填满了后再向上交付。
同步比特 SYN       ：同步比特 SYN 置为 1，就表示这是一个连接请求或连接接受报文。
复位比特 RST(Reset)：当 RST = 1 时，表明 TCP 连接中出现严重差错（如由于主机崩溃或其他原因），必须释放连接，然后再重新建立连接。
终止比特 FIN(Finsh)：用来释放一个连接。当FIN = 1 时，表明此报文段的发送端的数据已发送完毕，并要求释放连接。


//TCP基本特征
有连接：通信双方需要事先连接成功，方可传输数据
有确认：一方收到对端的任何数据，都会给另一方发回执确认
保证数据有序、不重复、丢失会重发
如果网络拥堵，会自动调节发送量
采用帧异步的流式通信方式（即通信双方每次的收发数据量不必相等）


//TCP协议的可靠性，表现在以下方面
1、固定数据块：应用数据被分割成TCP认为最适合发送的数据块。(数据报长度保持不变，这和UDP完全不同)。
2、确认响应：  对于一个收到的请求，将发送一个确认。这个确认通常要延迟几分之一秒。
3、超时重传:   当TCP发出一个段后，它启动一个定时器，等待目的端确认收到这个报文段。如果不能及时收到一个确认, 将重发这个报文段。
4、数据包编号：TCP给发送的每一一个包进行编号, 接收方对数据包进行排序, 把有序数据传送给应用层。（TCP报文段作为IP数据报来传输，IP数据报的大刀可能会失序，因此TCP报文段的到达也可能会失序，如果必要，TCP将对收到的数据进行重新排序）。
5、校验和 :    TCP将保持它首部和数据的检验和。这是一个端到端的检验和，目的是检测数据在传输过程中的任何变化。如果收到段的检验和有差错, TCP将丢弃这个报文段和不确认收到此报文段。
6、丢弃重复数据：IP数据报会发生重复，TCP的接收端会丢弃重复的数据。
7、流量控制 :    TCP连接的每一方都有固定大小的缓冲空间, TCP的接收端只允许发送端发送接收端缓冲区能接纳的我数据。当接收方来不及处理发送方的数据, 能提示发送方降低发送的速率, 防止包丢失。TCP使用的流量控制协议是可变大小的滑动窗口协议。
8、拥塞控制 :	 当网络拥塞时, 减少数据的发送。



/********************/三次握手和四次挥手/************************************************************/
序列号（seq）：前两次握手seq均为随机值，客户端与服务器各自维护一个seq。
———————当SYN = 0时，首个报文seq=seq+1，此后的seq = seq + TCP纯数据字节长度。
确认序号（ack）：ack = 接收报文的seq+1。
ACK：连接建立后所有发送的报文的ACK都为1。首次握手ACK标志为0，故也没有确认序号ack。
最大报文长度（MSS）：前两次握手的报文中带有此可选项值。


//三次握手：
1、客户端发送连接请求给服务器。	SYN=1。		     seq=X。（此时服务器可知自己能接收到客户端的数据）
2、服务器接受请求并应答。		ACK=1，SYN=1。seq=Y，ack=X+1。（此时客户端可知双方都能接收到对方数据）
3、客户端接收应答				ACK=1。		     seq=X+1，ack=Y+1。(此时服务器可知客户端能接收到自己的数据)


//数据传输
数据传输。					ACK=1。		     seq=seq+TCP纯数据字节长度。ack= 接收报文的seq + 1。
数据传输过程中，ACK和确认序号是非常重要的，TCP发送的数据会暂存在TCP层发送缓冲区中，
发出数据包给对方之后，只有收到对方应答的ACK段才知道该数据包确实发到了对方，可以从发送缓冲区中释放掉了，
如果因为网络故障丢失了数据包或者丢失了对方发回的ACK段，经过等待超时后TCP协议自动将发送缓冲区中的数据包重发。


//四次挥手：
1、客户端发送断开请求给服务器。	FIN=1。		     seq=M。（表示没有数据需要发送了，可以断开连接）
2、服务器接收并应答。			ACK=1。		     seq=N，ack=M+1。（此时服务器仍可向客户端发送消息）
3、服务器发送断开请求给客户端。	ACK=1，FIN=1。seq=B，ack=M+1。（表示没有数据需要发送了，可以断开连接）
4、客户端应答。				ACK=1。		    seq=M，ack=B+1。（服务器接收后双方才正式断开连接）

由于TCP连接是全双工的，因此每个方向都必须单独进行关闭。
收到一个 FIN只意味着这一方向上没有数据流动，一个TCP连接在收到一个FIN后仍能发送数据。


//状态
第一次握手：客户端进程进入了 SYN - SENT 同步已发送状态
第二次握手：服务器进程进入了 SYN - RCVD 同步收到状态
第三次握手：客户端进入ESTABLISHED已建立连接状态

第一次挥手：客户端进入FIN - WAIT - 1（终止等待1）状态
第二次挥手：服务端进入CLOSE - WAIT 关闭等待状态
第三次挥手：客户端进入FIN - WAIT - 2（终止等待2）状态，服务器发完数据后就进入了LAST - ACK（最后确认）状态
第四次挥手：客户端进入TIME - WAIT（时间等待）状态，经过2MSL（MSL：报文最大生存时间）后进入CLOSED关闭状态。服务器端接收到确认报文后立即进入CLOSED关闭状态


//为什么客户端要等待2MSL？
主要原因是为了保证客户端发送那个的第一个ACK报文能到到服务器，因为这个ACK报文可能丢失，
并且2MSL是任何报文在网络上存在的最长时间（一般为1-4min），超过这个时间报文将被丢弃，
这样新的连接中不会出现旧连接的请求报文。


