/********************/TCP性能调优/************************************************************/
//三次握手的性能提升
1、调整SYN报文重传速度			【tcp_syn_retries】
2、调整SYN半连接队列长度		【tcp_max_syn_backlog，somaxconn，backlog】
3、调整SYN + ACK报文重传速度	【tcp_synack_retries】
4、调整accept队列长度			【min(somaxconn, backlog)】
5、绕过三次握手				【tcp_fastopen】

//四次挥手的性能提升
1、调整FIN报文重传次数			【tcp_orphan_retries】
2、调整FIN_WAIT2状态的时间		【tcp_fin_timeout】
3、调整孤儿连接的上限个数		【tcp_max_orphans】
4、调整time_wait状态的上限个数	【tcp_max_tw_buckets】
5、复用time_wait状态的连接		【tcp_tw_reuse，tcp_timestamps】

//数据传输的性能提升
1、扩大窗口大小				【tcp_window_scaling】
2、调整发送缓冲区范围			【tcp_wmem】
3、调整接受缓冲区范围			【tcp_rmem】
4、接收缓冲区动态调节			【tcp_moderate_rcvbuf】
5、调整内存范围				【tcp_mem】


Linux内核中，TCP参数位于 "/proc/sys/net/ipv4/ " 目录下。
也可以在 "/etc/sysctl.conf" 文件中批量修改:  
net.ipv4.tcp_syncookies = 1	
net.ipv4.tcp_tw_reuse = 1
...



/********************/三次握手性能提升/************************************************************/
//SYN攻击
SYN攻击者可以在短时间内伪造大量不存在的IP地址，向服务器不断发送SYN包。
由于这些源地址是虚假的，服务器需要不断重发确认包直至超时，这些伪造的SYN包将长时间占用未连接队列，
导致正常的SYN请求被丢弃，目标系统运行缓慢，甚至引发网络堵塞和系统瘫痪。

//超时重传
客户端SYN超时重传次数 / proc / sys / net / ipv4 / tcp_syn_retries		默认为6次。
服务器应答超时重传次数 / proc / sys / net / ipv4 / tcp_synack_retries	默认为5次
每次超时的时间间隔是逐渐增大的，例如1秒、2秒、4秒、8秒、16秒、32秒等。

//连接队列
想增大半连接队列，不能只单纯增大 tcp_max_syn_backlog 的值，还需一同增大 somaxconn 和 backlog，也就是增大 accept 队列。
/ proc / sys / net / ipv4 / tcp_max_syn_backlog	默认256，backlog 是 listen(int sockfd, int backlog) 函数中的 backlog 大小。
/ proc / sys / net / core / somaxconn			默认128，somaxconn 是 Linux 内核的参数，是每一个端口最大的监听队列的长度
半连接队列（    SYN队列）：用于存储处于SYN_RECV状态的连接。当半连接队列溢出后，服务端就无法再建立新的连接。
全连接队列（accept队列）：用于存储处于ESTABLISHED状态的连接。进程调用 accept 函数时取出连接。全连接队列的最大值为somaxconn和backlog中的最小值。

//防止半连接队列溢出：tcp_syncookies 
开启 syncookies 功能就可以在不使用 SYN 半连接队列的情况下成功建立连接。
syncookies 的工作原理：服务器根据当前状态计算出一个值，放在己方发出的 SYN + ACK 报文中发出，
当客户端返回 ACK 报文时，取出该值验证，如果合法，就认为连接建立成功。

/ proc / sys / net / ipv4 / tcp_syncookies	默认1（在应对 SYN 攻击时，只需要设置为 1 即可）
tcp_syncookies 主要有以下三个值：
0 值，表示关闭该功能；
1 值，表示仅当 SYN 半连接队列放不下时，再启用它；
2 值，表示无条件开启功能；


//防止全连接队列溢出：tcp_abort_on_overflow
如果进程不能及时地调用 accept 函数，就会造成 accept 队列（也称全连接队列）溢出，最终导致建立好的 TCP 连接被丢弃。
tcp_abort_on_overflow 设为 0 可以提高连接建立的成功率，当 TCP 全连接队列会长期溢出时，才应设置为 1 以尽快通知客户端。
/ proc / sys / net / ipv4 / tcp_abort_on_overflow	默认0

tcp_abort_on_overflow有以下值：
0 值：如果 accept 队列满了，那么 server 扔掉 client 发过来的 ack ；
1 值：如果 accept 队列满了，server 发送一个 RST 包给 client，告诉客户端连接已经建立失败，表示废掉这个握手过程和这个连接；


//绕过三次握手：使用Cookie：减少了握手带来的 1 个 RTT 的时间消耗
在 Linux 3.7 内核版本之后，提供了 TCP Fast Open 功能，这个功能可以减少 TCP 连接建立的时延。
一般工作原理：
- 第一次握手：SYN
- 第二次握手：SYN + ACK
- 第三次握手：ACK + HTTP Get
- 服务器响应Data

Cookie工作原理：
- 第一次握手：SYN + Cookie请求。
- 第二次握手：（服务器生成Cookie）SYN + ACK + Cookie数据。
- 第三次握手：（客户端保存Cookie）ACK + HTTP Get
- 服务器响应Data

使用Cookie建立连接：
- 握手：SYN + Cookie + HTTP Get
- 握手：SYN + ACK并响应Data
- 握手：ACK

注：客户端在请求并存储了 Fast Open Cookie 之后，可以不断重复 TCP Fast Open 直至服务器认为 Cookie 无效（通常为过期）。

/ proc / sys / net / ipv4 / tcp_fastopen		默认1（该功能需要客户端和服务端同时支持才有效）
tcp_fastopen有4个值：
0 关闭
1 作为客户端使用 Fast Open 功能
2 作为服务端使用 Fast Open 功能
3 无论作为客户端还是服务器，都可以使用 Fast Open 功能



/********************/四次挥手性能提升/************************************************************/
//关闭连接方式
关闭连接的方式有两种：RST 报文关闭、FIN 报文关闭。

RST报文关闭：进程异常退出，内核就会发送 RST 报文来关闭，它不走四次挥手流程，是一个暴力关闭连接的方式。
FIN报文关闭：由进程调用 close 和 shutdown 函数发起 FIN 报文（shutdown 关闭“读”或“读写”时才会发送 FIN）。

close 函数，意味着完全断开连接，完全断开无法传输数据，也不能发送数据。 调用了 close 函数的一方的连接叫做「孤儿连接」。
shutdown 函数，它可以控制只关闭一个方向的连接。


//FIN超时重传
FIN超时重传次数： / proc / sys / net / ipv4 / tcp_orphan_retries		默认0，特指8次
孤儿连接最大数量： / proc / sys / net / ipv4 / tcp_max_orphans		默认值16384

如果遇到恶意攻击，FIN 报文根本无法发送出去，这由 TCP 两个特性导致的：
首先，TCP 必须报文报文是有序发送的，FIN 报文也不例外，当发送缓冲区还有数据没有发送时，FIN 报文也不能提前发送。
其次，TCP 有流量控制功能，当接收方接收窗口为 0 时，发送方就不能再发送数据。
所以，当攻击者下载大文件时，就可以通过接收窗口设为 0 ，这就会使得 FIN 报文都无法发送出去，那么连接会一直处于 FIN_WAIT1 状态。
解决这种问题的方法，是调整 tcp_max_orphans 参数，它定义了「孤儿连接」的最大数量


//FIN_WAIT2 状态持续时间
/ proc / sys / net / ipv4 / tcp_fin_timeout	默认60，该时间与TIMEWAIT时间相同（2MSL）


//TIME - WAIT 的状态的作用
作用一：防止收到历史数据，从而导致数据错乱的问题。
有相同端口的 TCP 连接被复用后，收到了上一个已结束连接的延迟数据包，导致数据错乱。

作用二：等待足够的时间以确保最后的 ACK 能让被动关闭方接收，从而帮助其正常关闭。
如果最后一个 ACK 报文在网络中被丢失了，此时客户端 TIME - WAIT 过短或没有，则就直接进入了 CLOSE 状态了，那么服务端则会一直处在 LASE - ACK 状态。
当客户端再次发起建立连接的 SYN 请求报文后，服务端会就发送 RST 报文给客户端，连接建立的过程就会被终止。

为什么是 2 MSL 的时长呢？
这其实是相当于至少允许报文丢失一次。
比如，若 ACK 在一个 MSL 内丢失，这样被动方重发的 FIN 会在第 2 个 MSL 内到达，TIME_WAIT 状态的连接可以应对。
* 在 Linux 系统中，MSL 的值固定为 30 秒，所以它们都是 60 秒。


//TIME_WAIT最大数量
如果发起连接一方的 TIME_WAIT 状态过多，占满了所有端口资源，则会导致无法创建新连接。

TIME_WAIT最大数量： / proc / sys / net / ipv4 / tcp_max_tw_buckets	默认16384
若超过该值则新关闭的连接就不再经历TIME_WAIT直接关闭


//复用 TIME_WAIT 状态的连接
有一种方式可以在建立新连接时，复用处于 TIME_WAIT 状态的连接，那就是打开 / proc / sys / net / ipv4 / tcp_tw_reuse 参数。
但是需要注意，该参数是只用于客户端（建立连接的发起方），因为是在调用 connect() 时起作用的，
而对于服务端（被动连接方）是没有用的。

tcp_tw_reuse 从协议角度理解是安全可控的，可以复用处于 TIME_WAIT 的端口为新的连接所用。
什么是协议角度理解的安全可控呢？主要有两点：
1、只适用于连接发起方，也就是 C / S 模型中的客户端；
2、对应的 TIME_WAIT 状态的连接创建时间超过 1 秒才可以被复用。

使用这个选项，还有一个前提，需要打开对 TCP 时间戳的支持（对方也要打开 ）
打开时间戳功能： / proc / sys / net / ipv4 / tcp_timestamps		默认1

由于引入了时间戳，它能带来了些好处：
1、我们在前面提到的 2MSL 问题就不复存在了，因为重复的数据包会因为时间戳过期被自然丢弃；
2、同时，它还可以防止序列号绕回，也是因为重复的数据包会由于时间戳过期被自然丢弃；


//连接双方同时关闭连接，会怎么样？
由于 TCP 是双全工的协议，所以是会出现两方同时关闭连接的现象，也就是同时发送了 FIN 报文。
两方发送 FIN 报文时，都认为自己是主动方，所以都进入了 FIN_WAIT1 状态，FIN 报文的重发次数仍由 tcp_orphan_retries 参数控制。
接下来，双方在等待 ACK 报文的过程中，都等来了 FIN 报文。
这是一种新情况，所以连接会进入一种叫做 CLOSING 的新状态，它替代了 FIN_WAIT2 状态。
接着，双方内核回复 ACK 确认对方发送通道的关闭后，进入 TIME_WAIT 状态，等待 2MSL 的时间后，连接自动关闭。



/********************/数据传输性能提升/************************************************************/
滑动窗口：TCP 的提供一种机制，可以让「发送方」根据「接收方」的实际接收能力控制发送的数据量。

接收方根据它的缓冲区，可以计算出后续能够接收多少字节的报文，这个数字叫做接收窗口。
当内核接收到报文时，必须用缓冲区存放它们，这样剩余缓冲区空间变小，接收窗口也就变小了；
当进程调用 read 函数后，数据被读入了用户空间，内核缓冲区就被清空，这意味着主机可以接收更多的报文，接收窗口就会变大。

因此，接收窗口并不是恒定不变的，接收方会把当前可接收的大小放在 TCP 报文头部中的窗口字段，这样就可以起到窗口大小通知的作用。

发送方的窗口等价于接收方的窗口吗？
如果不考虑拥塞控制，发送方的窗口大小「约等于」接收方的窗口大小，因为窗口通知报文在网络传输是存在时延的，所以是约等于的关系。

//扩充滑动窗口
窗口字段只有 2 个字节，因此它最多能表达 65535 字节大小的窗口，也就是 64KB 大小。
这个窗口大小最大值，在当今高速网络下，很明显是不够用的。所以后续有了扩充窗口的方法：
在 TCP 选项字段定义了窗口扩大选项，用于扩大TCP通告窗口，必须在前两次握手的报文中发送该选项。
使 TCP 的窗口定义从 2 个字节（16 位） 增加为 4 字节（32 位），所以此时窗口的最大值可以达到 1GB。
Linux 中打开这一功能，需要把 tcp_window_scaling 配置设为 1（默认打开）


//如何确定最大传输速度？
TCP 的传输速度，受制于发送窗口与接收窗口，以及网络设备传输能力。
其中，窗口大小由内核缓冲区大小决定。如果缓冲区与网络传输能力匹配，那么缓冲区的利用率就达到了最大化。

问题来了，如何计算网络的传输能力呢？
相信大家都知道网络是有「带宽」限制的，带宽描述的是网络传输能力，它与内核缓冲区的计量单位不同 :
1、带宽是单位时间内的流量，表达是「速度」，比如常见的带宽 100 MB / s；
2、缓冲区单位是字节，当网络速度乘以时间才能得到字节数；

这里需要说一个概念，就是带宽时延积，它决定网络中飞行报文的大小，它的计算方式：
带宽时延积BDP = RTT * 带宽
比如最大带宽是 100 MB / s，网络时延（RTT）是 10ms 时，
意味着客户端到服务端的网络一共可以存放 100MB / s * 0.01s = 1MB 的字节。
同时，这 1MB 也表示「飞行中」的 TCP 报文大小，它们就在网络线路、路由器等网络设备上。
如果飞行报文超过了 1 MB，就会导致网络过载，容易丢包。

由于发送缓冲区大小决定了发送窗口的上限，而发送窗口又决定了「已发送未确认」的飞行报文的上限。
因此，发送缓冲区不能超过「带宽时延积」。

发送缓冲区 > 带宽时延积，超出的部分就没办法有效的网络传输，同时导致网络过载，容易丢包；
发送缓冲区 < 带宽时延积，就不能很好的发挥出网络的传输效率。


//发送缓冲区大小调整
调节发送缓冲区范围： / proc / sys / net / ipv4 / tcp_wmem		默认值4096  16384  4194304
三个数字单位都是字节：
* 第一个数值是动态范围的最小值，4096 byte = 4K；
* 第二个数值是初始默认值，16380 byte = 16K；
* 第三个数值是动态范围的最大值，4194304 byte = 4096K（4M）；

//接收缓冲区大小调整
调节接收缓冲区范围： / proc / sys / net / ipv4 / tcp_rmem		默认值4096  131072  6291456
三个数字单位都是字节：
* 第一个数值是动态范围的最小值，4096 byte = 4K；
* 第二个数值是初始默认值，131072 byte = 128K；
* 第三个数值是动态范围的最大值，6291456 byte = 6144K（6M）；

发送缓冲区的调节功能是自动开启的，而接收缓冲区则需要配置 tcp_moderate_rcvbuf 为 1 来开启调节功能

接收缓冲区可以根据系统空闲内存的大小来调节接收窗口：
1、如果系统的空闲内存很多，就可以自动把缓冲区增大一些，这样传给对方的接收窗口也会变大，因而提升发送方发送的传输数据数量；
2、反正，如果系统的内存很紧张，就会减少缓冲区，这虽然会降低传输效率，可以保证更多的并发连接正常工作；


//调节 TCP 内存范围
接收缓冲区调节时，怎么知道当前内存是否紧张或充分呢？这是通过 tcp_mem 配置完成的
调节 TCP 内存范围： / proc / sys / net / ipv4 / tcp_mem		默认值44376  59168  88752

上面三个数字单位不是字节，而是「页面大小」，1 页表示 4KB，它们分别表示：
* 当 TCP 内存小于第 1 个值时，不需要进行自动调节；
* 在第 1 和第 2 个值之间时，内核开始调节接收缓冲区的大小；
* 大于第 3 个值时，内核不再为 TCP 分配新内存，此时新连接是无法建立的；

一般情况下这些值是在系统启动时根据系统内存数量计算得到的。
根据当前 tcp_mem 最大内存页面数是 177120，当内存为(177120 * 4) / 1024K ≈ 692M 时，
系统将无法为新的 TCP 连接分配内存，即 TCP 连接将被拒绝。


//根据实际场景调节的策略
在高并发服务器中，为了兼顾网速与大量的并发连接，我们应当保证缓冲区的动态调整的最大值达到带宽时延积，
而最小值保持默认的 4K 不变即可。而对于内存紧张的服务而言，调低默认值是提高并发的有效手段。

同时，如果这是网络 IO 型服务器，那么，调大 tcp_mem 的上限可以让 TCP 连接使用更多的系统内存，这有利于提升并发能力。
需要注意的是，tcp_wmem 和 tcp_rmem 的单位是字节，而 tcp_mem 的单位是页面大小。
而且，千万不要在 socket 上直接设置 SO_SNDBUF 或者 SO_RCVBUF，这样会关闭缓冲区的动态调整功能。


