/********************/网络编程/************************************************************/
网络编程：基于网络协议的编程

TCP协议 ： 用来检测网络传输中差错的传输控制, 传输过程中一旦发现错误，要求重新传输数据，直到数据安全为止。
IP 协议 ： 专门负责对不同网络进行数据的交互。

//C/S模型
使用C / S模式可以提前在本地进行大量数据的缓存处理，他们之间所采用的协议相对灵活。
C/S缺点：由于客户端和服务器都需要有一个开发团队来完成开发。工作量将成倍提升，开发周期较长。
另外，从用户角度出发，需要将客户端安插至用户主机上，对用户主机的安全性构成威胁，因此很大用户不愿意使用C/S模式的应用程序。


//网络模型
OSI七层模型：物理层、数据链路层、网络层、传输层、会话层、表示层、应用层
TCP/IP模型：网络接口层（物理层+链路层）、网络层、传输层、应用层

//TCP/IP模型典型协议
1.应用层 : 主要使用常见的协议有HTTP协议，FTP协议。
2.传输层 : 主要使用常见协议有TCP，UDP协议。
3.网络层 : 主要使用协议有IP协议、ICMP协议、IGMP协议。
4.网络接口层 : 常见协议有ARP 协议、RARP协议。

//TCP与UDP
TCP传输控制协议：是一种面向连接的、可靠的、基于字节流的传输层通信协议。
UDP用户数据报协议：是OSI参考模型中一种无连接的传输层协议，提供面向事务的简单, 不可靠信息传送服务。



/********************/OSI七层模型解析/************************************************************/
//应用层
是最靠近用户的OSI层。这一层为用户的应用程序（例如电子邮件、文件传输和终端仿真）提供网络服务.

我们所使用的任何程序，都用到的协议，这些协议就是应用层协议，
我们作为开发者，也就是意味着你需要操作系统当中的一系列 API 接口来进行操作，选择使用什么协议把数据进行传输，
然后剩下的事情，计算机操作系统会帮你完成，例如数据怎么打包封装，怎么寻找IP地址，怎么解析数据。

//表示层
可确保一个系统的应用层所发送的信息可以被另一个系统的应用层读取。
例如，PC程序与另一台计算机进行通信, 其中一台计算机使用二—十进制交换码(EBCDIC)，
而另一台则使用美国信息交换标准码(ASCLL)来表示相同的字符。
如有必要，表示层会通过使用一种通格式来实现多种数据格式之间的转换。

//会话层
通过传输层(端口号:传输端口与接收端口)建立数据传输的通路。
主要在你的系统之间发起会话或者接受会话请求。（设备之间需要互相认识可以是IP也可以是MAC 或者是主机名)。

//传输层
定义了一些传输数据的协议和端口号。
主要是将从下层接收的数据进行分段和传输，到达目的地址后再进行重组。

TCP：传输控制协议，传输效率低，可靠性强，用于传输可靠性要求高，数据量大的数据
UDP：用户数据报协议，与TCP特性恰恰相反，用于传输可靠性要求不高，数据量小的数据，如QQ聊天数据就是通过这种方式传输

//网络层
在位于不同地理位置的网络中的两个主机系统之间，通过IP地址寻路，提供连接和路径选择。
Internet 的发展使得从世界名站点访问信息的用户数大大增加，而网络层正是管理这种连接的层。

//数据链路层
定义了如何让格式化数据以帧为单位进行传输，以及如何让控制对物理介质的访问。
这一层通常还提供错误检测和纠正，以确保数据的可靠传输。数据效验
如 : 串口通信中使用到的115200、8、N、1

//物理层
主要定义物理设备标准，如网线的接口类型、光纤的接口类型、各种传输介质的传输速率等。
它的主要作用是传输比特流, 这一层的数据叫做比特。
就是由1、0转化为电流强弱来进行传输，到达目的地后再转化为1、0，也就是我们常说的数模转换与模数转换



/********************/TCP/IP四层模型解析/************************************************************/
在我们使用 TC /IP 协议进行通信的时候，数据将由应用层到链路层层层封装，才能网络中传递。接收方接收到数据也要层层拆解。

交换机工作在链路层，可以在不同的链路层网络之间转发数据帧。
路由器工作在网络层，同时兼有交换机的功能，因此路由器需要将进来的数据包拆掉网络层和链路层两层首部并重新封装。


链路层有以太网、令牌环网等标准，链路层负责网卡设备的驱动、帧同步、冲突检测、数据差错校验等工作。


网络层负责点到点（ptop，point - to - point）的传输（这里的“点”指主机或路由器）
传输层负责端到端（etoe，end - to - end）的传输（这里的“端”指源主机和目的主机）。传输层可选择TCP或UDP协议。

不同的协议层对数据包有不同的称谓，在传输层叫做段（segment），在网络层叫做数据报（datagram），在链路层叫做帧（frame）。


IP地址：可以在网络环境中，标识一台唯一的主机
端口号：通过IP地址寻找到唯一的主机，标识该主机当中的唯一进程
所以，在网络通信当中，IP地址 加上 端口号 可以在网络环境当中，找到唯一的一个进程。


//UDP数据报格式
16位源端口号     ：发送数据的进程.
16位目的端口号   ：进程，用于确定哪个进程来进行接收该数据.
16位报文长度
16位校验和
数据

//TCP数据报格式
16位源端口号     ：发送数据的进程.
16位目的端口号   ：进程，用于确定哪个进程来进行接收该数据.
32位报文序列号
32位确认序号     ：TPC是建立有效连接，意味着我发送一个数据包，对方接收了，则需要返回一个回执，用于确认是否接收完成。
4位首部长度
6位保留
6位标志位（六个）：URG、ACK、PSH、RST、SYN、FIN是六个控制位。使用位或设置多个。
16位窗口大小
16位校验和
16位紧急指针
选项
数据

//TCP的6个标志位
紧急比特 URG       ：当 URG = 1 时，表明此报文段中有紧急数据，应尽快传送(相当于高优先级的数据)。
确认比特 ACK       ：只有当 ACK = 1 时确认号字段才有效。当 ACK = 0 时，确认号无效。
推送比特 PSH(Push) ：接收方 TCP 收到推送比特置 1 的报文段，就尽快地交付给接收应用进程，而不再等到整个缓存都填满了后再向上交付。
同步比特 SYN       ：同步比特 SYN 置为 1，就表示这是一个连接请求或连接接受报文。
复位比特 RST(Reset)：当 RST = 1 时，表明 TCP 连接中出现严重差错（如由于主机崩溃或其他原因），必须释放连接，然后再重新建立连接。
终止比特 FIN(Finsh)：用来释放一个连接。当FIN = 1 时，表明此报文段的发送端的数据已发送完毕，并要求释放连接。



/********************/TCP与UDP的区别/************************************************************/
					UDP												TCP
是否连接			无连接											面向连接
是否可靠			不可靠（没有确认机制、流量控制、拥塞控制）		可靠（有确认机制、流量控制、拥塞控制）
连接对象个数		支持一对一、一对多、多对一、多对多交互通信		只支持一对一通信
传输方式			面向报文										面向字节流
使用场景			适用于实时应用（IP电话、视频会议、直播等）		适用于要求可靠传输的应用，如文件传输等



/********************/三次握手和四次挥手/************************************************************/
TCP三次握手四次挥手过程（带标志位表示标志位置1）
//三次握手：
1、客户端发送连接请求给服务器。		带SYN标志位。	  以及序列号和最大段尺寸。	  （此时服务器可知自己能接收到客户端的数据）
2、服务器接受并应答。				带ACK和SYN标志位。以及序列号和最大段尺寸。	  （此时客户端可知双方都能接收到对方数据）
3、客户端接收应答					带ACK标志位。								   (此时服务器可知客户端能接收到自己的数据)


//四次挥手：
1、客户端发送断开请求给服务器。		带FIN标志位。（表示没有数据需要发送了，可以断开连接）
2、服务器接收并应答。				带ACK标志位。（此时服务器仍可向客户端发送消息）
3、服务器发送断开请求给客户端。		带FIN标志位。（表示没有数据需要发送了，可以断开连接）
4、客户端应答。						带ACK标志位。（服务器接收后双方才正式断开连接）

由于TCP连接是全双工的，因此每个方向都必须单独进行关闭。
收到一个 FIN只意味着这一方向上没有数据流动，一个TCP连接在收到一个FIN后仍能发送数据。

//数据传输
数据传输过程中，ACK和确认序号是非常重要的，TCP发送的数据会暂存在TCP层发送缓冲区中，
发出数据包给对方之后，只有收到对方应答的ACK段才知道该数据包确实发到了对方，可以从发送缓冲区中释放掉了，
如果因为网络故障丢失了数据包或者丢失了对方发回的ACK段，经过等待超时后TCP协议自动将发送缓冲区中的数据包重发。







