/********************/IP协议/************************************************************/

//地址分类
地址类别		网络字节序	主机字节序		取值范围						备注
A类地址		1字节		3字节			1.0.0.1--127.255.255.255	网络地址的最高位必须是 "0"开始
B类地址		2字节		2字节			128.0.0.1--191.255.255.255	网络地址的最高位必须是 "10"开始
C类地址		3字节		1字节			192.0.0.1--223.255.255.255	网络地址的最高位必须是 "110"开始
D类地址		不区别网络字节序和主机字节序	224.0.0.1--239.255.255.255	网络地址的最高位必须是 "1110"开始
E类地址		不区别网络字节序和主机字节序	240.0.0.1--254.255.255.255	网络地址的最高位必须是 "1111"开始


//私有IP地址
A、B、C类地址中，分为公有IP和私有IP。
公有IP就是「可以注册」购买的IP；
私有IP就是「无法注册」的，用于内部使用的私有地址，私有地址如下：

A类	10.0.0.0–10.255.255.255，1个
B类	172.16.0.0–172.31.255.255，16个
C类	192.168.0.0–192.168.255.255，255个

A、B、C类地址范围中，私有IP外的地址都是公有地址（特殊地址除外）。


//特殊地址
类型			地址格式					描述
全0地址		0.0.0.0					路由表的默认路由，表示整个网络，即网络内的所有主机，而非某一个主机，不可用。
网络号全0		0.x.x.x					本网内某个特定主机
主机号全0		x.0.0.0					网络地址，表示整个网络
全1地址		255.255.255.255			子网的广播地址，路由器不转发
主机号全1		x.255.255.255				广播地址，对当前网络所有主机进行广播
环回地址		127.0.0.1 ~127.255.255.254	代表本机IP，可用于测试网络连通性


//📌 0.0.0.0 vs 127.0.0.1 的区别
属性				0.0.0.0							127.0.0.1
含义				任意本地IP地址					本机回环地址（Loopback Address）
作用				监听所有可用的网络接口			仅限本机通信
绑定（服务器）	监听所有IP（本地和远程都可访问）	只能被本机访问
连接（客户端）	不能用于连接						只能连接本机
常见使用场景		服务器程序监听所有网络接口			本地测试、隔离进程间通信


//IP数据报格式
1）版本（4位）：IP协议版本，目标主机按照此版本解释数据，如果目标主机使用的是其他版本，则丢弃数据报。
2）首部长度（4位）：数据报协议头长度，最小值为5，最大值为15。
3）服务（8位）：用于分配优先级、延迟、吞吐量以及可靠性；前3位是优先级，后面4位成为服务类型，最后1位没有定义。在一般的情况下都不使用这个字段。
4）总长度（16位）：IP数据报的字节长度（协议头部和数据），其最大值为65535字节。
5）标识（16位）：一个整数，数据报分段时，用于识别当前数据报。
6）标记（3位）：由3位字段构成，最低位（MF）控制分段，存在下一个分段置为1，否则置0代表该分段是最后一个分段；中间位（DF）指出数据报是否可进行分段，如果为1则机器不能将该数据报进行分段；第三位即最高位保留不使用，值为0。
7）分段偏移（13位）：指出数据在源数据报中的相对位置，用于重组源数据。
8）生存时间（8位）：一种计数器，在丢弃数据报的每个点值依次减1直至减少为0。防止无法交付的数据报无限制地在互联网中兜圈子。
9）协议（8位）：指明上层接收数据报的协议。TCP（6）,UDP（17）。
10）头部校验和（16位）：该字段帮助确保IP协议头的完整性。由于某些协议头字段的改变，这就需要对每个点重新计算和检验。计算过程是先将校验和字段置为0，然后将整个头部每16位划分为一部分，将个部分相加，再将计算结果取反码，插入到校验和字段中。
11）源地址（32位）	      ：源主机IP地址，该字段在IPv4数据报从源主机到目的主机传输期间必须保持不变。
12）目的地址（32位）：目标主机IP地址，该字段在IPv4数据报从源主机到目的主机传输期间同样必须保持不变。


//数据分片
IP协议负责将网络层的IP数据报（IP分组）传输到链路层，由链路层将数据封装成帧。
帧最多只能封装 1500 字节（默认）的数据，当超过上限时，就需要分割数据，
放到多个数据帧中传输，到达目标主机后，再将数据重组起来。

分割和重组的操作在路由器中完成，发送方发送的信息经过路由器时，路由器会将数据「分割」，放到不同的数据帧中，
并在帧首部的字段（MF）标明数据的顺序；当数据传输到目的路由器后，再根据帧首部的字段将信息「重组」，发送给目标主机。



