/********************/UDP 报文大小的影响因素/************************************************************/
1、UDP协议本身，UDP协议中有16位的UDP报文长度，那么UDP报文长度不能超过2 ^ 16 = 65536；
2、以太网（Ethernet）数据帧的长度，数据链路层的MTU；
3、socket的UDP发送缓存区大小（自己定义的）。



/********************/选择合适的MTU大小/************************************************************/
MTU（Maximum Transmission Unit，最大传输单元）指一种通信协议的某一层上面所能通过的最大数据包大小（单位字节）。这个参数通常与通信接口有关。
MSS（Maximum Segment Size，最大报文段长度）指的是TCP/UDP报文段所能使用的最大数据段大小。MSS的大小会受到MTU限制。


//当MTU不合理时会造成如下问题
1.本地MTU值 > 网络MTU值时，本地传输的"数据包"过大导致会拆包后传输，会产生额外的数据包，而且消耗了“拆包、组包”的时间。
2.本地MTU值 < 网络MTU值时，传输能力未完全发挥。


//TCP、UDP数据包大小的限制
链路层：由以太网的物理特性决定了数据帧的长度为[(46＋18), (1500＋18)]，其中的18是数据帧的头和尾，也就是说MTU为1500；
网络层：因为IP包的首部要占用20字节，所以这时的MTU为1500－20＝1480；
传输层：对于UDP包的首部要占用8字节，所以这时的UDP段中应用数据部分最大为1480－8＝1472；
---------对于TCP包的首部要占用20字节，所以这时的TCP段中应用数据部分（MSS）为1480－20＝1460；

如果UDP包数据大于MTU（1472）时，发送方的IP层需要"分片"进行传输, 而在接收方IP层则需要进行数据报重组，
由于UDP是不可靠的传输协议，如果分片丢失导致重组失败，将导致UDP数据包被丢弃。

Socket编程时，UDP协议要求包小于64K（65535）。sendto函数最大能发送数据的长度为65535 - IP头(20) - UDP头(8)＝65507字节。
如果发送的数据包超过65507字节，send或sendto函数会错误码1(Operation not permitted， Message too long)。
如果发送缓冲区小于65507字节，发送一个65507字节数据包的时候，send或sendto函数会错误码1(Operation not permitted， No buffer space available)。
TCP没有限定，TCP包头中就没有“包长度”字段，而完全依靠 IP 层去处理分帧。
因此 TCP 常常被称作一种“流式协议“，即TCP协议本身会进行拥塞 / 流量控制。

在普通的局域网环境下，UDP的数据最大为1472字节最好(避免分片重组)。
但在网络编程中，Internet中的路由器可能有设置成不同的值(小于默认值)，
Internet上的标准MTU值为576，所以Internet的UDP编程时数据长度最好在576－20－8＝548字节以内。

//其它
数据包的大小还应考虑到网络的延迟和丢包率。较大的数据包可能会导致较高的延迟和更高的丢包率，尤其是在网络条件较差的情况下。
应用程序的需求也是确定TCP数据包大小的重要因素。不同的应用程序对数据传输的实时性、吞吐量和可靠性有不同的要求。

//缓冲区大小
对于UDP来说，由于其是无连接的协议，因此其缓冲区的设置也需要特别考虑。
UDP的接收缓冲区最小值通常为256 bytes，发送缓冲区最小值为2048 bytes，这些是由内核的宏决定的。
然而，实际使用中，这些值可能需要根据具体的网络环境和应用需求进行调整。



/********************/其它问题/************************************************************/
//UDP丢包问题
1、UDP socket缓冲区满造成的UDP丢包
2、UDP socket缓冲区过小造成的UDP丢包
3、ARP缓存过期导致UDP丢包

//UDP的冗余传输方案
在外网通信链路不稳定的情况下，有什么办法可以降低UDP的丢包率呢？
一个简单的办法来采用冗余传输的方式。
一般采用较多的是延时双发，双发指的是将原本单发的前后连续的两个包合并成一个大包发送，这样发送的数据量是原来的两倍。

//应用场景
对于实时音视频通信这样的场景就比较合适用UDP了，如果采用TCP，那么在出现丢包的时候会进行补包等，就可能会出现比较大的延时。


//处理丢包
当UDP数据包丢失时，应用层可以采用以下几种方法来处理：
重传：当UDP发送方没有收到确认包，就会认为数据包已经丢失，立即重传丢失的数据包。
超时重传：当UDP发送方发出数据包后，如果一定时间内没有收到确认包，就会认为数据包丢失，立即重传丢失的数据包。

//处理错误
当UDP数据包出现错误时，应用层可以采用以下几种方法来处理：
丢弃：当UDP数据包出现错误时，应用层可以选择丢弃这个数据包，然后重新发送数据包。
纠错：应用层可以在传输的数据中添加冗余信息，例如校验和等，以便在接收端检测和纠正错误。


//UDP发送过快导致丢包
UDP的SendTo不会造成线程阻塞，也就是说，UDP的SentTo不会像TCP中的SendTo那样，
直到数据完全发送才会return回调用函数，它不保证当执行下一条语句时数据是否被发送。
（SendTo方法是异步的）这样，如果要发送的数据过多或者过大，那么在缓冲区满的那个瞬间要发送的报文就很有可能被丢失。
要解决接收方丢包的问题很简单，首先要保证程序执行后马上开始监听（如果数据包不确定什么时候发过来的话），
其次，要在收到一个数据包后最短的时间内重新回到监听状态，其间要尽量避免复杂的操作（比较好的解决办法是使用多线程回调机制）。

//其它方式解决丢包
1. 从发送端解决(推荐)
适用条件: ①发送端是可以控制的.②微秒数量级的延迟可以接受.
解决方法 : 发送时使用usleep(1)延迟1微秒发送, 即发送频率不要过快, 延迟1微妙发送, 可以很好的解决这个问题.

2.从接收端解决方法一
适用条件 : ①无法控制发送端发送数据的频率
解决方法 : 用recvfrom函数收到数据之后尽快返回, 进行下一次recvfrom, 可以通过多线程 + 队列来解决.收到数据之后将数据放入队列中, 另起一个线程去处理收到的数据.

3.从接收端解决方法二
适用条件 : ①使用方法2依然出现大规模丢包的情况, 需要进一步优化
解决方法 : 使用setsockopt修改接收端的缓冲区大小


