

//冯诺依曼计算机的特点
1、计算机由五大部件组成（主存储器、运算器、控制器、输入设备、输出设备）
2、指令和数据以同等低位存于存储器，可按地址寻访
3、指令和数据用二进制表示
4、指令由操作码和地址码组成
5、存储程序
6、以运算器为中心（现代计算机以存储区为中心，CPU = 运算器 + 控制器）

//主存储器（内存）
主存储器 = 存储体 + MAR（存储地址寄存器）+ MDR（存储数据寄存器）
原理：主存储器通过MAR向存储体定位数据，并将数据放到MDR供外部使用。

存储体：
存储单元：存储体中每个地址对应一个存储单元，每个存储单元存放一串二进制代码
存储字（word）：存储单元中二进制代码的组合
存储字长：存储单元中二进制代码的位数
存储元：即存储二进制的电子元件，每个存储元可存1bit

//运算器（算术和逻辑运算）
ACC：累加器，用于存放操作数，或运算结果
MQ：乘商寄存器，在乘、除运算时，用于存放操作数或运算结果。
X：通用的操作数寄存器，用于存放操作数
ALU：算术逻辑单元，通过内部复杂的电路

		加			减			乘				除
ACC		被加数、和	被减数、差	乘积高位			被除数、余数
MQ								乘数、乘积低位		商
X		加数			减数			被减数

//控制器（控制程序指令的执行）
PC获取指令地址，放入IR，由CU处理。
CU：控制单元，分析指令，给出控制信号
IR：指令寄存器，存放当前执行的指令
PC：程序计数器，存放下一条指令地址，有自动加1功能


//计算机五层结构
M4：高级语言机器（执行高级语言）
M3：汇编语言机器（执行汇编语言）
M2：操作系统语言（向上提供广义指令）
M1：传统机器（执行机器语言指令）
M0：微程序机器（执行微指令）

//三个级别语言
编译程序：高级语言-->汇编语言/机器语言
汇编程序：汇编语言-->机器语言
解释程序：高级语言-->机器语言（翻译一句执行一句）



