

//冯诺依曼计算机的特点
1、计算机由五大部件组成（主存储器、运算器、控制器、输入设备、输出设备）
2、指令和数据以同等低位存于存储器，可按地址寻访
3、指令和数据用二进制表示
4、指令由操作码和地址码组成
5、存储程序
6、以运算器为中心（现代计算机以存储区为中心，CPU = 运算器 + 控制器）

//主存储器（内存）
主存储器 = 存储体 + MAR（存储地址寄存器）+ MDR（存储数据寄存器）
原理：主存储器通过MAR向存储体定位数据，并将数据放到MDR供外部使用。
总容量 = 存储单元个数 * 存储字长 = 2^MAR位数 * MDR位数

存储体：
存储单元：存储体中每个地址对应一个存储单元，每个存储单元存放一串二进制代码
存储字（word）：存储单元中二进制代码的组合
存储字长：存储单元中二进制代码的位数
存储元：即存储二进制的电子元件，每个存储元可存1bit

//运算器（算术和逻辑运算）
ACC：累加器，用于存放操作数，或运算结果
MQ：乘商寄存器，在乘、除运算时，用于存放操作数或运算结果。
X：通用的操作数寄存器，用于存放操作数
ALU：算术逻辑单元，通过内部复杂的电路

		加			减			乘				除
ACC		被加数、和	被减数、差	乘积高位			被除数、余数
MQ								乘数、乘积低位		商
X		加数			减数			被减数

//控制器（控制程序指令的执行）
PC获取指令地址，放入IR，由CU处理。
CU：控制单元，分析指令，给出控制信号
IR：指令寄存器，存放当前执行的指令
PC：程序计数器，存放下一条指令地址，有自动加1功能

//工作流程
PC值0交由MAR
MAR从存储体取出指令（二进制的操作码和地址码）放到MDR
MDR将指令交到IR
IR将操作码送到CU，CU分析指令（如取数指令）
IR将地址码送到MAR，获取到操作数据放到MDR
ACC从MDR获取数据
PC++，执行下一条指令。


//计算机五层结构
M4：高级语言机器（执行高级语言）
M3：汇编语言机器（执行汇编语言）
M2：操作系统语言（向上提供广义指令）
M1：传统机器（执行机器语言指令）
M0：微程序机器（执行微指令）

//三个级别语言
编译程序：高级语言-->汇编语言/机器语言
汇编程序：汇编语言-->机器语言
解释程序：高级语言-->机器语言（翻译一句执行一句）

//CPU性能指标
CPU主频：CPU内数字脉冲信号振荡的频率。
CPI（Clock cycle Per Instruction）：执行一条指令所需的时钟周期数。
IPS（Instructions Per Second）：每秒执行多少条指令。
FLOPS（Floating-point Operations Per Second）：每秒执行多少次浮点运算。

CPU主频（时钟频率） = 1 / CPU时钟周期
CPU执行时间 = CPU时钟周期数 / 主频 = （指令条数 * CPI）/ 主频
IPS = 主频 / 平均CPI

//系统整体的性能指标
数据通路带宽：数据总线一次所能并行传送信息的位数（各硬件部件通过数据总线传输数据）
吞吐量：指系统在单位时间内处理请求的数量。
响应时间：发出请求到接收到响应所经过的时间。

//N进制数转十进制数
各位乘其位权的总和。
例：八进制 5.4->5*8^0+4*8^-1=5.5

//十进制转N进制
【整数部分】
除基取余法（辗转相除法）
不断除以N，先得到的余数是整数的低位（从下到上排列）。
【小数部分】
乘基取整法
不断乘以N，先得到整数是小数部分的高位（从上到下排列）。

//BCD码
BCD：Binary-Coded Decinal，用二进制编码的十进制
BCD码也称二进码十进数，BCD码可分为有权码和无权码两类。
其中，常见的有权BCD码有8421码、2421码、5421码，无权BCD码有余3码（8421的每个数字加上0011）、余3循环码、格雷码。


//奇偶校验码
奇校验码：整个校验码（有效信息位和校验码）中“1”的个数为奇数。
偶校验码：整个校验码（有效信息位和校验码）中“1”的个数为偶数。
校验时，校验位根据有效信息位的“1”的个数补0或1，保证1的个数为奇数（奇校验）或偶数（偶校验）。
缺点：如果有两位出错，则无法发现错误。
偶校验的硬件实现：各信息进行异或（模2加）(同0异1)运算，得到的结果即为偶校验位。


//门电路
与门：A·B
或门：A+B
非门：!A
异或：A与非B、B与非A（正好和与门相反）
*与门和或门的符号，反应了他们的优先级，并且适用结合律和分配律。

//溢出判断
发生了溢出的情况：
正+正=负
负+负=正

机器判溢：（方法一）采用一位符号位
设操作数a的符号位A，操作数b的符号位B，运算结果的符号为S
V = AB!S+!A!BS
若V = 0，表示无溢出
若V = 1，表示有溢出

机器判溢：（方法二）采用一位符号位
	符号位相加溢出C1   结果的符号位C2
上溢			0			1
下溢			1			0
C1C2异或为0则为无溢出，异或为1则为有溢出。

机器判溢：（方法三）采用双符号位
正数符号位为00
负数符号位为11
结果的符号位01为上溢
结果的符号位10为下溢
实际存储时只存储1个符号位，运算时会复制一个符号位


//标志位生成
OF(Overflow Flag)溢出标志。溢出时为1，否则置0（有符号数）
	硬件计算：OF=最高位进位XOR次高位进位

SF(Sign Flag)符号标志。结果为负时置1，否则置0（有符号数）
	硬件计算：SF=最高位的本位和

ZF(Zero Flag)零标志。结果为0时置1，否则置0
	硬件计算：两数运算结果为n bit，只有n bit全为0时，ZF=1

CF(Carry Flag)进位/位标志。进位/借位时置1，否则置0（无符号数）
	硬件计算：CF=最高位产生的进位XORsub（sub=1表示减法，sub=0表示加法）



/********************/存储器/************************************************************/
CPU->寄存器->缓存->主存->辅存

随机存取存储器（RAM）
顺序存取存储器（SAM）
直接存取存储区（DAM）既能随机存取，也能顺序存取
相联存储器（CAM）按内容访问的存储器

DRAM(动态RAM)，用于主存，使用栅极电容存储信息。读数据时电容放电，属于破坏性读出。(过时了，现在的主存通常采用SDRAM芯片)
SRAM(静态RAM)，用于缓存，使用双稳态触发器存储信息。读数据时触发器状态保持稳定，属于非破坏性读出。

//DRAM的刷新
1、为什么需要刷新？	---电容的电荷只能维持2ms。即便不断电，2ms后信息也会消失。
2、刷新周期？			---一般为2ms。
3、每次刷新多少存储单元？	---以行为单位，每次刷新一行存储单元。
4、为什么要用行列地址？	---减少选通线的数量。
5、如何刷新？				---有硬件支持，读出一行的信息后重新写入，占用一个读/写周期。
6、在什么时刻刷新？		
---分散刷新：每次读写完都刷新一行。存取周期翻倍
---集中刷新：2ms内集中安排时间全部刷新。刷新时间内无法访问存储器，称为访存“死区”。
---异步刷新：2ms内每行刷新1次即可，每隔 2ms/行数 刷新一行。

//SRAM的刷新
SRAM不用刷新。只要不断电，触发器的状态就不会改变。


//ROM
MROM，掩膜式只读存储器。生产时写入信息，不可重写
PROM，可编程只读存储区。用户可用专门的写入器写一次，无法更改
EPROM，可擦除可编程只读存储器。可多次重写
(UVEPROM)紫外线照射8~20分钟，擦除所有信息
(EEPROM)可用“电擦除”方式擦除特定的字
闪存，U盘/SD卡就是闪存。可进行多次快速擦除重写，写之前需要先擦除，因此“写”速度比“读”速度更慢。每个存储单元是一个MOS管
SSD，固态硬盘。可进行多次快速擦除重写，由控制单元+存储单元(闪存)构成。

//BIOS
主板上的BIOS芯片是(ROM)，存储了“自举装入程序”，负责引导装入操作系统(开机)。
因为RAM中的信息断电丢失。因此开机时需要从该ROM中的程序指令开始执行。
逻辑上，主存由RAM+ROM组成，且二者常统一编址。


//多模块存储器
多体并行存储器(高位交叉编址/低位交叉编址)：每个模块有相同的容量和存储速度。各模块有独立的读写控制电路、地址寄存器、数据寄存器。既能并行工作，又能交叉工作。
存储体数量m = 存取周期T / 存取时间r
(T=r+恢复时间)

单体多字存储器：每个存储单元存储m个字，总线宽度也为m个字，一次并行读出m个字。


//磁盘
驱动器号(2bit)->柱面(磁道)号(8bit)->盘面号(4bit)->扇区号(4bit)


//Cache
如何区分Cache与主存的数据块对应关系？						---Cache和主存的映射
Cache很小，主存很大。如果Cache满了怎么办？					---替换算法
CPU修改了Cache中的数据副本，如何确保主存中数据母本的一致性？	---Cache写策略

//Cache和主存的映射
全相联映射：主存块可以放在Cache的任意位置
直接映射：每个主存块只能放到一个特定位置(Cache块号 = 主存块号 % Cache总块数)
组相联映射：Cache块分为若干组，每个主存块可放到特定分组中的任意一个位置(组号 = 主存块号 % 分组数)

同时，Cache中的每一块使用二进制数标记所属映射的主存块。并用有效位判断该标记的有效性