/********************/设计模式/************************************************************/
设计模式主要是基于以下的面向对象设计原则：

1、对接口编程而不是对实现编程。
2、优先使用对象组合而不是继承。


//创建型模式（这些设计模式提供了一种在创建对象的同时隐藏创建逻辑的方式，而不是使用 new 运算符直接实例化对象。这使得程序在判断针对某个给定实例需要创建哪些对象时更加灵活）
工厂模式（Factory Pattern）
抽象工厂模式（Abstract Factory Pattern）
单例模式（Singleton Pattern）
建造者模式（Builder Pattern）
原型模式（Prototype Pattern）

//结构型模式（这些模式关注对象之间的组合和关系，旨在解决如何构建灵活且可复用的类和对象结构）
适配器模式（Adapter Pattern）
桥接模式（Bridge Pattern）
组合模式（Composite Pattern）
装饰器模式（Decorator Pattern）
外观模式（Facade Pattern）
享元模式（Flyweight Pattern）
代理模式（Proxy Pattern）
过滤器模式（Filter、Criteria Pattern）

//行为型模式（这些模式关注对象之间的通信和交互，旨在解决对象之间的责任分配和算法的封装）
责任链模式（Chain of Responsibility Pattern）
命令模式（Command Pattern）
解释器模式（Interpreter Pattern）
迭代器模式（Iterator Pattern）
中介者模式（Mediator Pattern）
备忘录模式（Memento Pattern）
观察者模式（Observer Pattern）
状态模式（State Pattern）
策略模式（Strategy Pattern）
模板模式（Template Pattern）
访问者模式（Visitor Pattern）
空对象模式（Null Object Pattern）

//J2EE 模式（这些设计模式特别关注表示层。这些模式是由 Sun Java Center 鉴定的）
MVC 模式（MVC Pattern）
业务代表模式（Business Delegate Pattern）
组合实体模式（Composite Entity Pattern）
数据访问对象模式（Data Access Object Pattern）
前端控制器模式（Front Controller Pattern）
拦截过滤器模式（Intercepting Filter Pattern）
服务定位器模式（Service Locator Pattern）
传输对象模式（Transfer Object Pattern）



/********************/设计模式七大原则/************************************************************/
//1、开闭原则（Open Close Principle）
对扩展开放，对修改关闭。
在程序需要进行拓展的时候，不应去修改原有的代码。

优点：
①开闭原则提高复用性。
②开闭原则提高可维护性。
③开闭原则提高灵活性。
④开闭原则易于测试。


//2、单一职责原则
指一个类应当只有一个引起它变化的原因，否则类应该被拆分。
即一个类应该只负责一个职责，其中的职责表示引起该类变化的原因。

优点：
①降低类的复杂度。
②提高类的可读性。
③提高系统的可维护性。
④降低变更引起的风险。


//3、里氏代换原则（Liskov Substitution Principle）
所有引用基类的地方必须能透明地使用其子类的对象，也可以简单理解为任何基类可以出现的地方，派生类一定可以出现。
子类可以扩展父类的功能，但不能改变父类原有的功能。
里氏替换原是继承复用的基础，它反映了父类与子类之间的关系，是对开闭原则的补充，是对实现抽象化的具体步骤的规范。

优点：
①代码共享，减少创建类的工作量，每个子类都拥有父类的方法和属性；
②提高代码的可重用性；
③提高代码的可扩展性；
④提高产品或项目的开放性。


//4、依赖倒转原则（Dependence Inversion Principle）
中心思想：面向接口编程，而非面向实现编程；依赖于抽象而不依赖于具体。
依赖倒转原则是开闭原则的基础。

优点：
①降低类间的耦合性。
②提高系统的稳定性。
③减少并行开发引起的风险。
④提高代码的可读性和可维护性。


//5、接口隔离原则（Interface Segregation Principle）
客户端不应该依赖它不需要的接口，类间的依赖关系应该建立在最小的接口上。
使用多个拆分隔离的接口，比使用（包含很多不必要的成员的）单个接口要好。降低类之间的依赖和耦合度。


//6、迪米特法则，又称最少知道原则（Demeter Principle）
一个实体应当尽量少地与其他实体之间发生相互作用，使得系统功能模块相对独立。
也就是说可以通过中介类进行通信，以降低这两个类的耦合。


//7、合成复用原则（Composite Reuse Principle）
尽量使用合成 / 聚合的方式，而不是使用继承达到复用的目的。
比如，将类作为类成员以获得它的方法和属性，而非使用继承。
合成：部分和整体的关系（羊毛和绵羊），表示一种强的拥有关系，部分和整体的生命周期是一样的。
聚合：个体和群体的关系（绵羊和羊群），是一种弱的拥有关系，个体和群体也可以是完全不相关的（绵羊 / 人类）

优点：
维持了类的封装性。
新旧类之间的耦合度低。
复用的灵活性高。



//简单定义
标记		设计模式原则名称		简单定义

OCP		开闭原则				对扩展开放，对修改关闭

SRP		单一职责原则			一个类只负责一个功能领域中的相应职责

LSP		里氏代换原则			所有引用基类的地方必须能透明地使用其子类的对象

DIP		依赖倒转原则			依赖于抽象，不能依赖于具体实现

ISP		接口隔离原则			类之间的依赖关系应该建立在最小的接口上

CARP	合成 / 聚合复用原则		尽量使用合成 / 聚合，而不是通过继承达到复用的目的

LOD		迪米特法则			一个软件实体应当尽可能少的与其他实体发生相互作用

