/********************/重点/************************************************************/

//C语言
	可变参数函数及其作用

	字符串函数及其作用

	strlen 和 sizeof 的区别

	为什么需要内存对齐

	内存布局，有哪些区域，各存放了什么

	动态内存函数

	野指针，悬空指针

	内存泄漏和内存溢出的区别

	代码编译流程

	系统IO和标准IO的区别

//C++
	什么是多态

	构造和析构函数可以是虚函数吗，作用是什么

	容器底层原理

	C++新特性有哪些

	智能指针的种类和作用

	锁的种类和作用

	条件变量第二个参数

	强制类型转换的种类及作用

	指针和引用的区别

	static 关键字作用

	const 关键字作用

	异步编程

	虚函数和虚继承的原理和作用

	虚表、虚基表、虚指针、虚基指针

	类继承涉及的内存布局

	右值引用

//操作系统
	进程和线程的区别

	CPU调度策略

	进程的六种状态

	IPC通信有哪些

	共享内存的原理

	如何解决死锁

	线程池的结构

//网络
	OSI七层模型和TCP / IP四层模型

	TCP与UDP的区别

	TCP的三次握手和四次挥手

	IP地址分类

	IO模型分类

	多路复用的原理

//数据结构与算法
	排序算法

//设计模式
	单例模式

	工厂模式

	观察者模式

	代理模式

	装饰器模式

	策略模式

//Qt
	Qt一些底层原理

//音视频
	音视频从采集到文件到播放的流程

	H264码流

	H264/MPEG视频的基本码流结构是什么样的

	SPS和PPS是什么

	H264的两种组织格式

	请指出“1080p”的意义

	各种协议的默认端口号

	封装格式特点

	AAC码流

	各流媒体协议的位于哪一层，以及他们的传输层协议是什么

	RTP报头有什么

	RTCP报头有什么，命令有哪些

	RTSP流程什么样，命令有哪些

	RTMP流程什么样，命令有哪些

	描述PCM数据的6个参数

//汇编
	8086寄存器有哪些

	寻址方式有哪些

//特定技巧
	不使用 sizeof 计算数据类型的大小

	大小端序转换

	使用联合体判断大小端序

	RGB图像的大小是同分辨率的YUV420的多少倍

	模板单例实现

	使用两个栈实现一个队列







//手动实现以下函数
内存操作函数：
memcpy：复制内存区域。
memmove：移动内存区域（考虑重叠区域的情况）。
memset：设置内存区域的值。

字符串操作函数：
strcpy：复制字符串。
strncpy：限制复制的字符数。
strcmp：比较两个字符串。
strchr：查找字符串中某个字符的首次出现位置。
strlen：计算字符串的长度。

链表操作：
创建和操作单链表的函数：如 insert, delete, reverse, merge 等。

栈和队列操作：
实现栈和队列的基本操作：push, pop, peek 等。
使用数组或链表实现栈或队列。

递归问题：
实现经典的递归问题，如汉诺塔、斐波那契数列、树的遍历等。

内存管理函数：
malloc、free 的简化实现（自定义内存分配器）。

位操作：
一些位运算函数：比如判断一个整数是否是 2 的幂、翻转二进制数中的某一位、提取二进制中的某一位等。

