/********************/辨析/************************************************************/
sizeof 和 strlen 的区别

strlen 是函数，只能计算字符串的大小，不包含'\0'。
sizeof 是关键字，可以计算任何数据的内存大小，包含'\0'。

	
printf("%d\n", sizeof("\0"));	//2，实际上是"\0\0"
printf("%d\n", sizeof('\0'));	//4
printf("%d\n", strlen("\0"));	//0
printf("%d\n", strlen('\0'));	//报错


/************************************************************/
struct 在C和C++中的区别

C语言				C++
不能含有函数			可以含有函数
不能继承				可以继承
不能省略 struct		可以省略 struct
不能修改权限			可以修改权限
不能初始化成员		可以初始化成员
空结构体大小为1字节	空结构体大小为0字节


/************************************************************/
class 和 struct 的区别

1、继承权限： class 默认私有， struct 默认公有
2、访问权限： class 默认私有， struct 默认公有
3、定义模版： class 可以用于定义模板， struct 不能


/************************************************************/
#define 和 typedef 的区别

 #define 是预处理指令，在预处理时简单地进行字符串替换，不作正确性检查，只有在编译源程序时才会发现错误并报错。
typedef 是关键字，在编译时处理，有类型检查功能。在自己的作用域内给一个已存在的类型起别名，但不能在函数定义里面使用 typedef 。

定义指针的区别：
#define ptr int* p
ptr a, b;					//a是int * a,    b是 int b
typedef  int* ptr;
ptr a, b;					//a是int * a,    b是 int* b

typedef int (*funtion)()   //表示函数指针，重新命名为funtion


/************************************************************/
a++ 和 ++a 的区别

1.	a++ 是先把a赋值到一个临时变量，进行 + 1操作，运算后才返回临时变量给a（参与运算的是自加之前的值）。a++ 相当于 int b = a + 1; a = b
2.	++a 是先给 a + 1, 直接对 a 赋值，不需要开辟临时空间（参与运算的是返回值的引用）
3.	a++需要开辟空间，等运算完才返回值，所以效率比++a低


/************************************************************/
gets 和 scanf 函数的区别

1、gets函数可以接受空格，scanf遇到空格就会结束
2、gets函数仅用于读入字符串；scanf为格式化输入函数，可以读入任意C语言基础类型的变量值，而不是仅限于字符串(char*)类型
3、gets的返回值为 char* 型，当读入成功时会返回输入的字符串指针地址，出错时返回 NULL
scanf返回值为 int 型，返回实际成功赋值的变量个数，当遇到文件结尾标识时返回 EOF


/************************************************************/
char str1[] = "hello" 和 char* str2 = "hello"

数组名相当于常量指针，只可以修改数组里面的元素，不可以修改数组的地址即不能str1++
字符指针相当于指针常量，不可以修改指向的地址的内容，可以修改地址

char* str1[] = "hello"
char* str2 = "hello"
//区别一	数组名不可以自加,因为数组名是地址常量
str1++				//报错
str2++
//区别二	数组里面的元素可以修改，str2指向的地址的内容不可以修改 
str1[0] = 'w'
*str2 = 'w'			//段错误

//初始化
C语言允许 char* str2 = "hello";
C++ 必须 const char* str2 = "hello";   //字符串字面量（如 "hello"）在C++中是存储在程序的只读数据段
char str1[] = "hello"; 在C或C++中都是合法的。

int a[5] = {}; 在C++中合法，C语言中不合法。


/************************************************************/
数组名 num 和 &num 的区别

对于一维数组来说	num + 1是偏移到下个元素， & num + 1是偏移整个数组
对于二维数组来说	num + 1是偏移一个一维数组， & num + 1是整个数组


/************************************************************/
线程与进程的区别

定义上的区别：
进程： 具有一个独立功能的程序，拥有独立的内存空间。
线程： 它是比进程更小的能独立运行的基本单位，线程本身不拥有系统资源，但是它可以和属于同一个进程的其他线程共享进程所拥有的全部资源。

调度区别：
进程是拥有资源的基本单位。
线程是调度和分派的基本单位。

共享地址空间：
进程：拥有各自独立的地址空间、资源，所以共享复杂，需要用IPC（进程间通信），但是同步简单。
线程：共享所属进程的资源，因此共享简单，但是同步复杂，需要用加锁等措施。

占用内存和cpu：
进程：占用内存多，切换复杂，cpu利用率低；
线程：占用内存少，切换简单，cpu利用率高。

互相影响：
进程之间不会互相影响；
一个线程挂掉可能会导致整个进程挂掉。


/************************************************************/
并发和并行的区别

并发是同时发生。如多线程，是同一进程，只使用一个CPU轮流执行。
并行是同时执行。如多进程，每个进程只能执行一个进程，因此需要多个CPU才能同时执行多个进程。


/************************************************************/
NULL 和 nullptr

NULL在C语言中是(void*)0。 void 类型的指针都可以被转化为其他任何指针类型
#define NULL (void*)0

而在C++中是0。由于函数重载的存在，因此不支持如C语言般的隐式转换将 void* 转为其它类型指针


/************************************************************/
编译时函数
sizeof
constexpr
if constexpr
static_assert
decltype
typeid
noexcept
alignof
alignas
std::is_* 类型特征







//知识点
1、全局变量可以声明在被多个.c文件包含的头文件中，但只能赋初值一次
2、在头文件中不能定义静态局部变量（全局变量的话即使非静态也不应该定义）。因为静态变量不会随函数结束而结束，定义在头文件中会被多个文件开辟空间，浪费资源或者出现错误。
3、C语言中不能使用二进制表示整常数
4、C语言函数参数压栈顺序：从右往左，并且内存中栈是由高向低扩展，所以先入栈的是右边并且地址是高位。比如printf()函数，也都是先打印最右边。
5、指针与指针的相减操作，表示两个指针指向的内存位置之间相隔多少个元素(注意是元素，并不是字节数)。指针不能相加。
6、定义一个常数，用以表面一年有多少秒。		#define SECOND_PER_YEAR(60 * 60 * 24 * 365)UL		UL表示长整型数
7、使用宏求结构体的内存偏移地址。			#define OffSet(type, field) ((size_t) & (((type*)0)->field))
8、vector 的 clear() 函数不释放内存，而仅仅改变 size 的大小。可以使用 swap() 函数替换成一个空vector达到释放内存的目的。


