/********************/辨析/************************************************************/
sizeof 和 strlen 的区别

	1、sizeof 是关键字
	   strlen 是函数

	2、sizeof可以计算任何数据的大小 内存大小
	   strlen只能计算字符串数据的大小
	
	3、计算字符串大小时, sizeof 包含'\0', strlen 不包含'\0'。
	
printf("%d\n", sizeof("\0"));	//2，实际上是"\0\0"
printf("%d\n", sizeof('\0'));	//4
printf("%d\n", strlen("\0"));	//0
printf("%d\n", strlen('\0'));	//报错


/************************************************************/
static 关键字的作用

static 修饰的局部变量，放在静态区.data段中，只会被初始化一次，在函数执行完毕后不会被释放。（注意其仍然是局部变量）
static 修饰的全局变量或函数只在当前文件内可用，其它文件不可见。


/************************************************************/
const 修饰指针

const int* p		const 修饰指针 int*，指针所指的内容不能被改变，但可以改变指针所指的地址。
int* const p		const 修饰指针变量p，p的值不能被改变，也就是指针所指的地址无法改变。但所指的内容仍可以通过该指针改变。


/************************************************************/
struct 在C和C++中的区别

1. C语言中结构体不允许有函数，在C++中可以
2. C语言结构体是不可以继承，C++中可以继承
3. C语言中结构体的使用必须要用别名或者使用struct
4. C语言中无法修改权限，C++中可以修改
5. C语言中不能初始化成员，C++中可以初始化
6. C语言中空结构体大小为1字节，C++中为0


/************************************************************/
class 和 struct 的区别

1、继承权限： class 默认私有， struct 默认公有
2、访问权限： class 默认私有， struct 默认公有
3、 class 可以用于定义模板， struct 不能


/************************************************************/
#define 和 typedef 的区别

 #define 是预处理指令，在预处理时简单地进行字符串替换，不作正确性检查，只有在编译源程序时才会发现错误并报错。
typedef 是关键字，在编译时处理，有类型检查功能。在自己的作用域内给一个已存在的类型起别名，但不能在函数定义里面使用 typedef 。

定义指针的区别：
#define ptr int* p
ptr a, b;					//a是int * a,    b是 int b
typedef  int* ptr;
ptr a, b;					//a是int * a,    b是 int* b

typedef int (*funtion)()   //表示函数指针，重新命名为funtion


/************************************************************/
a++ 和 ++a 的区别

1.	a++ 是先把a赋值到一个临时变量，进行 + 1操作，运算后才返回临时变量给a（参与运算的是自加之前的值）。a++ 相当于 int b = a + 1; a = b
2.	++a 是先给 a + 1, 直接对 a 赋值，不需要开辟临时空间（参与运算的是返回值的引用）
3.	a++需要开辟空间，等运算完才返回值，所以效率比++a低


/************************************************************/
gets 和 scanf 函数的区别

1、gets函数可以接受空格，scanf遇到空格就会结束
2、gets函数仅用于读入字符串；scanf为格式化输入函数，可以读入任意C语言基础类型的变量值，而不是仅限于字符串(char*)类型
3、gets的返回值为 char* 型，当读入成功时会返回输入的字符串指针地址，出错时返回 NULL
scanf返回值为 int 型，返回实际成功赋值的变量个数，当遇到文件结尾标识时返回 EOF


/************************************************************/
char str1[] = "hello" 和 char* str2 = "hello"

数组名相当于常量指针，只可以修改数组里面的元素，不可以修改数组的地址即不能str1++
字符指针相当于指针常量，不可以修改指向的地址的内容，可以修改地址

char* str1[] = "hello"
char* str2 = "hello"
//区别一	数组名不可以自加,因为数组名是地址常量
str1++				//报错
str2++
//区别二	数组里面的元素可以修改，str2指向的地址的内容不可以修改 
str1[0] = 'w'
*str2 = 'w'			//段错误


/************************************************************/
堆栈溢出原因

1、函数递归调用层次太深。
2、动态申请空间过多，使用之后没有释放。
3、数组访问越界。
4、指针非法访问。


/************************************************************/
什么是内存泄漏

申请的内存不使用之后并没有释放。或者说，指向申请的内存的指针又指向别的地方，导致找不到申请的内存
影响：
随着程序运行时间越长，占用内存越多，最终用完内存，导致系统崩溃


/************************************************************/
如何减少内存泄漏

1.良好的编码习惯，使用内存分配的函数，一但使用完毕之后就要记得使用对应的函数是否释放掉
2.将分配的内存的指针以链表的形式自行管理，使用之后从链表中删除，程序结束时可以检查该链表
3.使用智能指针
4.使用常见插件，ccmalloc


/************************************************************/
数组名 num 和 &num 的区别

对于一维数组来说	num + 1是偏移到下个元素， & num + 1是偏移整个数组
对于二维数组来说	num + 1是偏移一个一维数组， & num + 1是整个数组


/************************************************************/
线程与进程的区别

定义上的区别：
进程： 具有一个独立功能的程序，拥有独立的内存空间。
线程： 它是比进程更小的能独立运行的基本单位，线程本身不拥有系统资源，但是它可以和属于同一个进程的其他线程共享进程所拥有的全部资源。

调度区别：
进程是拥有资源的基本单位。
线程是调度和分派的基本单位。

共享地址空间：
进程：拥有各自独立的地址空间、资源，所以共享复杂，需要用IPC（进程间通信），但是同步简单。
线程：共享所属进程的资源，因此共享简单，但是同步复杂，需要用加锁等措施。

占用内存和cpu：
进程：占用内存多，切换复杂，cpu利用率低；
线程：占用内存少，切换简单，cpu利用率高。

互相影响：
进程之间不会互相影响；
一个线程挂掉可能会导致整个进程挂掉。


/************************************************************/
并发和并行的区别

并发是同时发生。如多线程，是同一进程，只使用一个CPU轮流执行。
并行是同时执行。如多进程，每个进程只能执行一个进程，因此需要多个CPU才能同时执行多个进程。






