/********************/逆向工程/************************************************************/
定义：一切从产品中提取原理及设计信息并应用于再造及改进的行为，都是逆向工程

//调试方法
静态分析(IDA)：程序并未运行，通过分析文件的结构（格式）获取其内部原理。
动态分析(OD)：在程序的运行过程中，分析其内部原理。
灰盒分析(GBA)：既不静态也不调试，通过一堆监控软件（注册表监控、文件监控、进程监控、敏感API监控）在虚拟机中跑程序，再分析恶意软件的大体行为，并形成病毒分析报告。


//OllyDbg常用快捷键
F2			设置断点，如下图所示的红色位置，程序运行到此处会暂停，再按一次F2键会删除断点。
F9			按下这个键运行程序，如果没有设置相应的点，被调试的程序直接开始运行。
F8			单步步过，每按一次这个按键，将执行反汇编窗口中的一条指令，遇到CALL等子程序不进入其代码。
F7			单步步入，功能通单步步过（F8）类似，区别是遇到CALL等子程序时会进入其中，进入后首先停留在子程序的第一条指令上。如下图进入CALL子程序。
F4			运行到选定位置，即运行到光标所在位置处暂停。
CTRL + F	9执行到返回，按下此键会执行到一个返回指令时暂停，常用于从系统领空返回到我们调试的程序领空。
ALT + F9	执行到用户代码，从系统领空快速返回我们调试的程序领空。


//BeginPaint
在绘制游戏区时，Windows编程有个关键函数，叫做BeginPaint。
BeginPaint函数为指定窗口进行绘图工作的准备，并用将和绘图有关的信息填充到一个PAINTSTRUCT结构中，所以它将是个突破口。

//双缓存技术
双缓存是在缓存中一次性绘制，再把绘制的结果返回在界面上。(核心函数BitBlt)
比如，你要在屏幕上绘制一个圆、正方形、直线，需要调用GDI的显示函数，操作显卡画一个圆，再画一个正方形和直线，它需要访问硬件三次；
此时依赖硬件的访问速度，而且如果绘制错误擦除再绘制，需要反复的访问硬件，
为了减少硬件操作，我们在内存中把需要绘制的图像准备好，然后一切妥当之后提交给硬件显示。






