/********************/汇编/************************************************************/



8086的CPU只有16位，地址总线由有20位，因此会在内部使用 地址加法器 将两个16位地址合成一个20位地址
两个16位地址，一个称为段地址，一个称为偏移地址。物理地址 = 段地址 * 16 + 偏移地址。（物理地址 = 段地址:偏移地址）

偏移地址最大为16位(64K)，因此一个段的最大长度为64K

段地址存放在段寄存器：CS / DS / SS / ES


//CS和IP寄存器
CS存放段地址，IP存放偏移地址
CS:IP可以定位指令的地址

jmp 用于修改CS和IP寄存器的值
同时修改CS和IP
jmp 段地址:偏移地址
jmp 2AE3:3

仅修改IP
jmp 寄存器
jmp ax


//DS寄存器
mov ax, 20			//20表立即数
mov ax, ds:[20]		//20表内存的偏移地址

段寄存器不能从内存取值，也不能用立即数赋值
mov ds, bx


//SS和SP寄存器
SS存放段地址，SP存放偏移指针
SS:SP可以定位栈顶的位置，从而实现PUSH和POP的操作

栈溢出问题(上溢/下溢)：没有预防机制，自己小心。

10000H "+---+" << SS=1000H(栈底)（栈范围10000H~10002H）
10001H "+---+"
10002H "+---+"
10003H "+---+" << SP=0003H(栈顶)（此时为栈空状态）


//汇编程序
汇编指令是有相应机器码的指令，由CPU执行
伪指令没有相应机器码，由编译器执行

【定义一个段】
段名 segment			//DOS中一般需要这么写
...
段名 ends

end：汇编程序结束标识
assume：(MASM编译器特有)将一个特定用途的段和相关的段寄存器关联起来。assume 段寄存器:段名


//[bx]
[bx]表示偏移地址在bx寄存器中
inc bx 用在loop的循环中，可以用作源操作数地址的自增


//loop
loop 标签
(cx)=(cx)-1		//cx存放循环次数
判断cx值，不为0则跳转到标签处(开始下一轮循环)，若为0就向下执行

	mov cx, 循环次数
s:	循环代码
	...
	loop s

