/********************/问答/************************************************************/
堆栈溢出原因

1、函数递归调用层次太深。
2、动态申请空间过多，使用之后没有释放。
3、数组访问越界。
4、指针非法访问。


/************************************************************/
什么是内存泄漏

申请的内存不使用之后并没有释放。或者说，指向申请的内存的指针又指向别的地方，导致找不到申请的内存
影响：
随着程序运行时间越长，占用内存越多，最终用完内存，导致系统崩溃


/************************************************************/
如何减少内存泄漏

1.良好的编码习惯，使用内存分配的函数，一但使用完毕之后就要记得使用对应的函数是否释放掉
2.将分配的内存的指针以链表的形式自行管理，使用之后从链表中删除，程序结束时可以检查该链表
3.使用智能指针
4.使用常见插件，ccmalloc




/********************/复习知识点/************************************************************/)

//关键字
11、 字节对齐：所占空间必须是成员变量中字节最大的整数倍；每个变量类型的偏移量必须是该变量类型的整数倍
12、 int* p，q表示p是指针变量，q是int变量
13、全局变量可以声明在被多个.c文件包含的头文件中，但只能赋初值一次
14、C语言中不能使用二进制表示整常数
15、C语言函数参数压栈顺序：从右往左，并且内存中栈是由高向低扩展，所以先入栈的是右边并且地址是高位。比如printf()函数，也都是先打印最右边。
16、栈空间最大值：Window是2MB，Linux是8MB。Linux下可以使用ulimit -s命令查看。

17、指针与指针的相减操作，表示两个指针指向的内存位置之间相隔多少个元素(注意是元素，并不是字节数)。指针不能相加。
18、空指针是指向地址为0区域的指针
19、定义一个常数，用以表面一年有多少秒。	#define SECOND_PER_YEAR (60*60*24*365)UL		UL表示长整型数
20、在头文件中不能定义静态变量。因为静态变量是有记忆的，不会随函数结束而结束，所以如果定义在头文件中，那么就会被多个文件开辟空间，浪费资源或者重新出错。
21、使用宏求结构体的内存偏移地址。			#define OffSet(type, field) ((size_t) & (((type*)0)->field))
24、迭代器不是指针，是个类模板，返回的是对象的引用而不是对象的值。

//系统编程
42、内存映射：把硬盘的一部分作为内存使用，直接从硬盘读写数据
43、进程的六种状态：就绪态、执行态、暂停态、睡眠态、僵尸态、死亡态
44、fork函数子进程没复制的内容：PID、PPID、fork函数返回值、未决信号集
45、无名管道特征：亲缘进程、单向读写、数据不具有原子性、没有名字无法使用open打开
46、有名管道特征：任意进程、双向读写、数据具有原子性、使用open打开文件描述符读写，数据先进先出
47、精灵进程步骤：fork()出孙子进程、创建会话、忽略终端关闭信号、修改路径到根目录、关闭文件掩码、关闭继承的文件资源、开始工作。







