/*************************/音视频采集处理流程/***************************************************************************/

//1、采集
采集图像帧: 摄像头 硬件 负责 采集画面, 采集的 初始画面 称为 " 图像帧 "。
采集音频帧 : 麦克风 硬件 负责 采集音频, 采集的 初始音频 称为 " 采样帧"。
*也可从本地文件获取音视频数据
*采样时需要一个 同步时钟信息, 记录当前采样的时间, 这是复用和解复用时进行时钟同步的重要依据;
*每帧图像帧和采样帧数据都要打上一个时间戳;
*图像帧 和 音频采样帧 使用的是 相同的时钟源, 这样借助该时钟可以进行 音视频同步 操作;

//2、处理
图像处理：对视频画面进行修改, 如 : 添加滤镜, 调亮画面, 增加字幕等, 可以针对 " 图像帧 " 进行修改, 修改的过程就是 " 图像处理 ";
音频处理：对音频声音进行修改, 如 : 变声, 增加混响音效, 噪声处理等, 可以针对 " 音频帧 " 进行修改, 修改的过程就是 " 音频处理 ";

//3、帧队列
图像帧队列: 将 处理完毕 的 图像帧, 放到一个 " 图像帧队列 ( Frame Queue ) " 中, 等待 视频编码;
采样帧队列: 将 处理完毕 的 采样帧, 放到一个 " 采样帧队列 ( Frame Queue ) " 中, 等待 音频编码;

//4、编码
视频编码: 在 图像帧队列(Frame Queue) 中的视频画面, 体积非常大, 1 分钟可能达到 1GB 大小, 视频的画面必须要进行 压缩编码;
音频编码: 在 采样帧队列(Frame Queue) 中的 PCM 原始音频数据, 体积非常大, PCM 就是 WAV 格式的音频, 没有经过任何压缩, 音频必须要进行编码, 编码为 mp3 或 ogg 格式, 能压缩 10 倍的大小;
*1 秒钟有 44100 个采样, 双通道立体声, 每个采样 16 位, 则 1 分钟的音频有 1 × 60 × 44100 × 2 × 2 字节大小;

//5、包队列
视频包队列: 将 图像帧 编码 后, 放到 视频包 中, 然后 将若干 视频包 放到 " 视频包队列 ( Packet Queue ) " 中, 等待封装;
音频包队列: 将 采样帧 编码 后, 放到 音频包 中, 然后将若干 音频包 放到 " 音频包队列 ( Packet Queue ) " 中, 等待封装;

//6、复用封装
复用封装: 使用 复用器 将 视频包队列 和 音频包队列 封装在一起，得到 一个 包含 音频 和 视频 的 文件;
*存放音视频的容器叫封装容器，文件类型叫封装格式；

//7、传输（网络协议打包）
音视频文件在网络中传输的时候，一般都会有一个特定的协议，也就是流媒体协议。
流媒体协议会将音视频数据文件打包成协议包，通过网络协议端口发送出去，

//8、解协议
接收方接收到网络包之后，要通过网络协议解开协议包，才能获得音视频数据文件。
解协议：将流媒体协议的数据，解析为标准的相应的封装格式数据。
视音频在网络上传播的时候，常常采用各种流媒体协议，例如HTTP，RTMP，或是MMS等等。
这些协议在传输视音频数据的同时，也会传输一些信令数据。
这些信令数据包括对播放的控制（播放，暂停，停止），或者对网络状态的描述等。
解协议的过程中会去除掉信令数据而只保留视音频数据。

//9、解复用
复用 是 将 音频包队列(Packet Queue) 和 视频包队列(Packet Queue) 封装为一个 音视频文件, 
解复用是 复用 的 逆向过程, 就是将 音视频文件 解封装为 音频包队列(Packet Queue) 和 视频包队列(Packet Queue);

//10、解码
压缩数据传输完之后，就需要解码成原始文件一样的数据才能使用。
用来解码的工具就是解码器了，不过通常编码器和解码器是一块的，统称为编解码器codec；
音频解码 : 音频包队列(Packet Queue) 通过 音频解码, 解码为 采样帧队列 Frame Queue;
视频解码: 视频包队列(Packet Queue) 通过 视频解码, 解码为 视频帧队列 Frame Queue;

//11、音视频同步
解码后的 采样帧队列 和 视频帧队列, 需要 根据每一帧的 时钟信息, 进行 音视频同步操作;

//12、音视频处理
音频处理: 对 解码后的 采样帧 添加效果, 如 : 混响, 重低音, 除噪音, 变声, 变调, 变速 等效果;
视频处理: 对 解码后的 视频帧 添加效果, 如 : 美颜, 滤镜, 亮度, 字幕 等效果;

//13、音视频播放
处理后的音频 送到 扬声器 / 耳机 等设备中进行播放;
处理后的视频 送到 显示器 设备中播放;



	数据（解协议）						协议层：http, rtmp, file...
	||
	封装格式数据（解封装）				封装格式层：mkv, mp4, flv, avi, mp3...
	||
	音 / 视频码流数据（解码）			编解码层：h264, h265, mpeg2, aac...
	||
	音频采样数据 / 视频像素数据			像素层：yuv420p, yuv422p, rgb24, pcm...




