/*************************/音视频概念/***************************************************************************/
//图像参数
1. 像素："Pixel" 图像的最小单位。每个像素都有 3 个通道。即RGB，或4通道RGBA。
2. 位深：每个像素点颜色使用的位数。
3. Stride：跨距，即字节对齐。内存中每行像素占用的空间, 不一定是图像的宽度。

//视频参数
1. 分辨率：视频面积大小（像素px）；
2. 帧率：每秒的帧数量fps；
3. 码率：每秒的数据量bps（b = bit）。（码率 = 视频大小 / 视频时长）（能支撑的同时在线观看视频人数 = 带宽大小 / 码率）
视频文件大小[Byte] = （ 视频编码率[bit] + 音频编码率[bit] ）/ 8 * 时长[s]

//音频参数
1. 采样率：每秒从模拟信号中采集转换成数字信号的音频点数量Hz；	比特率(音频) = 采样率 x 采用位数 x 声道数
2. 声道数：同时采集声音的通道数量，常见有单声道和双声道（立体声道）；
3. 位宽：也叫采样位宽，指保存单个声音样本点的比特位数，通常是16bit。

//原始数据格式
视频（图像颜色编码格式）：YUV、RGB
音频（编码格式）：PCM（脉冲调制编码）
 
//编码格式（即压缩数据的算法）
视频：H264（也叫AVG）、H265
音频：AAC、Opus、G711、MP3

//编解码方式
硬编解码：通过硬件实现编解码，减轻CPU计算的负担，如GPU等
软编解码：如 H264、H265、MPEG - 4等编解码算法，更消耗CPU

//封装格式
视频：mp4、mov、3gp、mkv、avi、flv、ps、ts等
音频：mp3、mwv、wma、midi、aac、cda、mov等

//其它
*muxer（复用器）和demuxer（解复用器）或称封装器与解封装器
*H264 + AAC封装为FLV或MP4是最为流行的模式
转码：一种封装格式转换成另一种封装格式，对码流进行先解码再编码。
封装格式转换（remux）：一种封装格式转换成另外一种封装格式，仅对码流重新打包，不涉及编解码。



/*************************/视频帧/***************************************************************************/
视频帧就是视频的一张图片
1. I帧（帧内编码帧）即关键帧，记录了一个完整的图像，可以被直接解码显示，两个I帧中间的一组帧称之为一个GOP。
2. P帧（帧间预测编码帧），不记录画面，记录的是本帧与前一帧的差异，压缩比有20左右。P帧不能直接解码，需要先解码前序的 I帧 或 B帧，来生成一张完整的图片。
3. B帧（双向预测编码帧）是记录了本帧与前一个I / P帧和后一个I / P帧的差异，压缩比有50左右。需要参考其前一个 I帧 或 P帧 及其后面的一个 P帧 来生成一张完整的图片。
在直播中，基本上不会出现B帧，因为B帧是需要解析了前后两个帧之后做对比产生的，如果使用B帧，会因为大量解析的时间增加不少延迟
4. 剩下的还有SI和SP帧，这俩是用于切换码流使用，一般不常见。

GOP（group of picture）：是画面组，就是一个I帧与下一个I帧之间的帧组合。
GOP 一般有两个数字，如 M = 3，N = 12，M 制定 I 帧与 P 帧之间的距离，N 指定两个 I 帧之间的距离。那么现在的 GOP 结构是	I BBP BBP BBP BB I
GOP越长：使用数据量越小，解析时间越长。

IDR：一个序列的第一帧叫做 IDR帧（Instantaneous Decoding Refresh，立即解码刷新），本质上是一个I帧。


//DTS与PTS
DTS（Decode Time Stamp）：解码时间戳。DTS主要是标识内存中的 bit 流什么时候开始送入解码器进行解码。
PTS（Presentation Time Stamp）：显示时间戳。PTS主要用于度量解码后的视频什么时候被显示出来。


//视频清晰度
视频清晰度：一个视频的画质与视频的码率、分辨率、压缩比、帧率、GOP长度有关。只有他们达到了最佳平衡，才能呈现最佳的画质。
分辨率越高->数据越大->需要的码率越高，如果码率不足则视频会卡顿
码率不足->提高压缩比->数据量减小->分辨率减小



/*************************/PCM/***************************************************************************/
PCM（Pulse Code Modulation，脉冲编码调制）模拟信号->数字信号
PCM音频数据是未经压缩的音频采样数据裸流，它是由模拟信号经过采样、量化、编码转换成的标准数字音频数据
单独的PCM编码文件是不能直接播放的，这种文件通常称为PCM裸流。PCM裸流经过封装后，就可以正常播放了。


//描述PCM数据的6个参数
1、采样频率。8kHz(电话)、44.1kHz(CD)、48kHz(DVD)。
2、量化位数。通常该值为16 - bit。
3、通道个数。立体声(stereo)和单声道(mono)、四声道。5.1声道等。
4、符号。表示样本数据是否是有符号位，比如用一字节表示的样本数据，有符号的话表示范围为 - 128 ~127，无符号是0 ~255。
5、字节序。大端序（低地址放高字节）或小端序（低地址放低字节）。通常为小端序。网络字节序为大端序。
6、整形或浮点型。大多数格式的PCM样本数据使用整形表示，而在一些对精度要求高的应用方面，使用浮点类型表示PCM样本数据。


//WAV与PCM的转换
最常见的WAV格式文是在PCM裸流的基础上加上44字节的文件头构成的，
此时PCM的采样率是8KHz，量化位数是16位，当采用8位的量化位数时，文件头的长度可以达到58位。
比如说Windows下自带的那个录音机录下的WAV，文件头有58个字节。



/*************************/FFmpeg中Packed和Planar的PCM数据区别/***************************************************************************/
FFmpeg中音视频数据基本上都有Packed和Planar两种存储方式，对于双声道音频来说，Packed方式为两个声道的数据交错存储；Planar方式为两个声道分开存储。假设一个L / R为一个采样点，数据存储的方式如下所示：
Packed : L R L R L R L R
Planar : L L L L R R R R
FFmpeg音频解码后的数据是存放在AVFrame结构中的。
Packed格式：frame.data[0]或frame.extended_data[0]包含所有的音频数据中。
Planar格式： frame.data[i]或者frame.extended_data[i]表示第i个声道的数据（假设声道0是第一个）, AVFrame.data数组大小固定为8，如果声道数超过8，需要从frame.extended_data获取声道数据。

下面为FFmpeg内部存储音频使用的采样格式，所有的Planar格式后面都有字母P标识。
enum AVSampleFormat {
        AV_SAMPLE_FMT_NONE = -1,
        AV_SAMPLE_FMT_U8,          ///< unsigned 8 bits
        AV_SAMPLE_FMT_S16,         ///< signed 16 bits
        AV_SAMPLE_FMT_S32,         ///< signed 32 bits
        AV_SAMPLE_FMT_FLT,         ///< float
        AV_SAMPLE_FMT_DBL,         ///< double

        AV_SAMPLE_FMT_U8P,         ///< unsigned 8 bits, planar
        AV_SAMPLE_FMT_S16P,        ///< signed 16 bits, planar
        AV_SAMPLE_FMT_S32P,        ///< signed 32 bits, planar
        AV_SAMPLE_FMT_FLTP,        ///< float, planar
        AV_SAMPLE_FMT_DBLP,        ///< double, planar
        AV_SAMPLE_FMT_S64,         ///< signed 64 bits
        AV_SAMPLE_FMT_S64P,        ///< signed 64 bits, planar

        AV_SAMPLE_FMT_NB           ///< Number of sample formats. DO NOT USE if linking dynamically
};

说明：
*Planar模式是ffmpeg内部存储模式，我们实际使用的音频文件都是Packed模式的。
*FFmpeg解码不同格式的音频输出的音频采样格式不是一样。测试发现，其中AAC解码
*输出的数据为浮点型的 AV_SAMPLE_FMT_FLTP 格式，MP3解码输出的数据为 AV_SAMPLE_FMT_S16P 格式（使用的mp3文件为16位深）。具体采样格式可以查看解码后的AVFrame中的format成员或解码器的AVCodecContext中的sample_fmt成员。
*Planar或者Packed模式直接影响到保存文件时写文件的操作，操作数据的时候一定要先检测音频采样格式。



/*************************/音频参数/***************************************************************************/
采样率48000：代表一秒钟48000个样本数据
双通道：代表每个通道都是以48000Hz采样的

【如果】
采样精度(位深)16bit

【可得到】
比特率(每秒数据量)
= 采样率＊通道数＊采样精度
= 48000＊2＊16
= 1536000bit 即 192000 字节

【如果】
编码格式为aac，则
每帧样本数1024：由编码协议规定（mp3为1152）

【可得到】
帧率
= 采样率 / 每帧样本数
= 48000 / 1024
= 46.875Hz
每帧时长 = 1000ms / 46.875 = 21.333ms



/*************************/音频采样/***************************************************************************/
//奈奎斯特 Nyguist 采样定理
根据 奈奎斯特 Nyguist 采样定理, 如果要从"脉冲 振幅值 数字采样信号"还原为"原始的模拟信号",
PCM 的"脉冲 采样频率", 必须是 最高频率 的 2 倍;
人耳 能听到的 频率范围是 20Hz ~20000Hz，那么 根据 " 奈奎斯特 Nyguist 采样定理 ",
想要保证 人耳听到的声音 不失真, 需要使用 40000Hz 以上的采样率;

常见的无损音频格式有WAV、FLAC和APE。且FLAC和APE是WAV的编码压缩格式。


//采样
物体 震动 的 振幅, 就是 声音 的 响度值, 就是 采样值;
假设 采样位数 是 8 位, 可以 表示 256 种响度值, 取值范围是 - 128 ~127;
录音设备, 录制音频, 某个时间戳 时刻 获取的 采样值 100。
将这个数值 100 输出到音响中, 此时音响的输出设置的采样位数也是 8 位，就可以还原录制视频时的震动振幅, 发出对应时间戳时刻的声音;
采样值与声音的分贝值无关
100 这个值 与 真实的音量响度, 也就是分贝值, 没有关系, 播放的声音大小只与录音设备参数有关;
如: 录制 50 分贝的声音, 不同的录音设置录制的 采样值 是不同的, 相同的录音设备 使用不同的参数 录制的采样值也是不同的, 50 分贝的声音可以是 100 采样值, 也可以是 50 采样值;
100 采样值在播放设备中播放的声音分贝数大小也是无关的，与播放设备及参数有关;
如果 播放的设备 的 采样位数 不是 8 位, 而是 16 位, 那么 就需要 将 100 这个值 转为 16 位 的采样值,
将 100 处于 取值范围 - 128 ~127, 等比例放大到 - 32768 ~+ 32767 取值范围中, 计算过程如下 :
100 / 128 * 32768 = 25600
最后将 重采样的 25600 采样值 输入到 16 位采样位数的 音响中;


//常用的音频采样频率
8       kHz : 电话所用采样率，也常被用作一些低质量音频的采样率，例如语音聊天或语音识别等应用。
22.05kHz : 常用于无线电广播;
44.1  kHz : 常用于 CD 音质界限
48     kHz : DVD 和 数字电视音质;
96     kHz : 蓝光 和 高清 DVD 音质;
192   kHz : 蓝光 和 高清 DVD 音质;

//音频通道数
单声道: 单声道音频只有一个声道。它通常用于较简单的音频设备, 如 : 收音机、便携式播放器;
双声道: 又叫 " 立体声 ", 包含左右两个声道, 左右声道的声音信号经过处理后, 可以模拟出人耳对声音的定位感, 使得听者能够感受到声音的方向和立体感;
四声道: 四声道 环绕音频 在 " 立体声 " 的基础上 增加了 后置左右两个声道, 通过更多扬声器的布置, 提供 更加宽广 和 包围感更强 的音频体验; 常用于家庭影院系统;
5.1 声道 : 前置左、前置右、中置、后置左、后置右 五个正常音频声道音箱, 然后加上一个 低音炮 是 0.1 的那部分, 常用于电影院 或 游戏音频;

//常见的音频码率
96 kbps : FM 音质, 适用于一些对音质要求不高的场景;
128 - 160 kbps : 普通质量的音频码率, 常用于在线音乐流媒体服务和普通音乐下载; 该 码率 音质较好, 能够提供清晰的声音, 在 复杂的音频场景 中可能会出现一些细节丢失;
192 kbps : CD 音质, 该码率提供更高的音质, 适用于对音质要求较高的音乐和音频内容, 它在保持相对较小的文件大小的同时, 提供更多的音频细节和动态范围;
256 - 320 kbps : 高质量音频的码率范围, 通常被视为 无损音质; 该 码率 的 音频文件 能够提供非常接近原始录音的音质, 适用于需要保留尽可能多音频细节的场景;



/*************************/音频帧/***************************************************************************/
" 音频帧 " 概念 : 将 音频 送入 音频编码器 进行编码时, 一次性要送入指定个数的 " 采样 ", 也可以理解为 "指定时间内的采样数 "


帧可以指每帧采样数播放的时间，mp3 48k，1152个采样点，每帧为24ms；aac则每帧为1024个采样点。攒够一帧数据才送去做编码。
帧也可以指压缩后每帧的数据长度。

每帧持续时间（秒） = 每帧采样点数 / 采样频率（HZ）


//不同编码格式的编码帧（音频帧）采样个数不同
mp3 编码格式 的 音频编码帧 有 1152 个采样点;
aac 编码格式 的 音频编码帧 有 1024 个采样点;


//音频 帧长度
音频 帧长度 指的是 每个 音频帧 的 " 播放持续时间 ",
音频帧持续时间(单位 : 秒) = 采样点数(单位 : 个) / 采样频率(单位 : 赫兹 Hz);
音频 帧长度 也可以 指 " 压缩后每个 音频帧 的 数据长度 ";

以 mp3 压缩格式为例, 采样率是 48000Hz, 一个 音频帧(编码单元) 有 1152 个采样点, 则 " 音频帧长度 " 为 :
1152÷48000 = 0.024秒 = 24毫秒

上面提到的 " 采样点数 " 概念, 注意区分 采样点数 与 采样个数 :
如果是 单声道, 就有 1 个音频采样,
如果是 立体声(双声道), 就有 2 个音频采样,
如果是 环绕声(四声道), 就有 4 个音频采样;



//音频 帧 采样排列方式 - 交错模式 和 非交错模式
音频 编码 或 解码 时, 首先要知道 在 音频帧 中 采样点 的排列方式,
数据以 " 连续帧 " 的方式存放, 先记录 帧 1 的采样点, 再记录 帧 2 的采样点,
在 " 音频帧 内部 " 的 音频 采样 排列方式 主要有 交错模式 和 非交错模式 两种排列方式;

1、交错模式：数字音频信号的存储方式。数据以连续帧的方式存放，即首先记录帧1的左声道样本和右声道样本，再开始帧2的记录。
交错模式 : 在 存储 音频采样时, 下图是 记录 4 个 双通道 采样点数据,
首先, 记录 采样点 1 的 左声道 和 右声道,
然后, 记录 采样点 2 的 左声道 和 右声道,
再后, 记录 采样点 3 的 左声道 和 右声道,
最后, 记录 采样点 4 的 左声道 和 右声道,

2、非交错模式：首先记录的是一个周期内所有帧的左声道样本，再记录所有右声道样本。
非交错模式 : 在 音频帧 中 存储 音频采样时, 下图是 记录 4 个 双通道 采样点数据,
首先, 记录 采样点 1 ~采样点 4 的 左声道 样本,
然后, 记录 采样点 1 ~采样点 4 的 右声道 样本;



/*************************/音频压缩编码/***************************************************************************/
//音频 压缩技术
音频 压缩技术 就是在 保证 声音信号 在 听觉方面(20Hz ~20000Hz 之间 的 频率) 不失真 的前提下, 对 数字音频信号 进行 压缩, 降低数据量;
数字音频压缩编码, 就是 删除 声音信号 中 冗余 的信息 实现的, 冗余信息 指的是 不能被 人耳 感知 的信号。

如 : 低于 20Hz 的信号, 高于 20000Hz 的信号,
这些信号 对 声音的 音色, 音调 没有任何影响,
删除这些信息, 声音听起来也不会有太大变化;


//掩蔽效应
人耳听觉 " 掩蔽效应 ": 当强音信号与弱音信号同时存在时, 弱音信号会被强音信号" 掩蔽 ";
即使 弱音信号 处于 听觉范围(20Hz ~20000Hz) 之内, 也会被视为 " 冗余信号 ";

在 " 掩蔽效应 " 中, 主要 表现在 " 频谱掩蔽效应 " 和 " 时域掩蔽效应 " 两个方面;


//频谱掩蔽效应
掩蔽阈值: 当一个 频率 的 声音强度 小于 某个阈值 时, 人耳就听不到了。
例如在 0.02 kHz 的频率下, 对应 20Hz 频率, 声音强度要达到 70 分贝 时, 才能被听到, 如果 声音强度 低于 70 分贝, 就听不到了, 这部分 听不到的 信号就是冗余信号, 不用被编码;


//时域掩蔽效应
当 强音信号 和 弱音信号 同时出现, 或 前后时间接近 相继出现时, 弱音信号 会被 强音信号 " 掩蔽 ", 这就是 " 时域掩蔽效应 ";
" 时域掩蔽效应 " 的原理是 : 当 强音信号 出现时, 会 引起听觉神经的强烈反应, 该反应会 在一定时间内抑制对弱信号的感知; 这种 抑制作用 的 持续时间 取决于 强音信号的 强度 和 持续时间, 以及 弱音信号 的频率和强度等因素;
借助 人耳听觉 的 该特性, 可以 将 被 时域掩蔽 的 弱音信号, 当做 " 冗余信号 " 不进行 音频编码, 这样就减少了编码数据量;

" 时域掩蔽效应 " 分为 三种情况 :
超前掩蔽: 指人耳在 听到 强音信号 之前的短暂时间内, 已经存在的 弱音信号 会被 掩蔽 而听不到;
同时掩蔽: 当 强音信号 与 弱音信号 同时存在时, 弱音信号 会被强信号所掩蔽而听不到;
滞后掩蔽: 当 强音信号 消失后, 需经过 较长的一段时间 才能重新听见 弱音信号;



/*************************/音视频开源库/***************************************************************************/
1、多媒体处理
多媒体处理包括：FFmpeg、libav、Gstreamer。其中FFmpeg是目前最常用的音视频处理库，包括封装格式、编解码、滤镜、图像缩放、音频重采样等模块。

2、流媒体传输
流媒体传输包括WebRTC、live555。其中WebRTC是目前最常用的RTC库，比较著名的模块有JitterBuffer、NetEQ、pacer、网络带宽估计。

3、播放器
播放器包括：ijkplayer、exoplayer、vlc。其中ijkplayer是B站开源的跨平台播放器，exoplayer是Google开源的Android平台播放器，vlc属于VideoLAN非盈利组织所开源。

4、编解码
常用的编解码包括：aac、mp3、opus、vp9、x264、av1。其中aac一般用于点播、短视频，opus用于RTC直播。vp9是Google开源的编码器，VideoLAN有提供x264编码器，av1是AOMedia(开放媒体联盟)开源的新一代视频编码器。

5、音频处理
音频处理的开源库包括：sox、soundtouch、speex。其中sox称为音频处理界的瑞士军刀，可以做各种音效、提供各种滤波器。soundtouch用于变速变调、变速不变调。speex严格意义上讲，它是一个编码器，但是它有丰富的音频处理模块：PLC(丢包隐藏)、VAD(静音检测)、DTX(非连续传输)、AEC(回声消除)、NS(噪声抑制)。

6、流媒体服务器
流媒体服务器主流的有：SRS、janus。其中SRS是一款简单高效的视频服务器，支持RTMP、WebRTC、HLS、HTTP - FLV、SRT。而janus是MeetEcho公司开源的基于WebRTC的流媒体服务器，严格意义上讲它是一个网关。

7、音视频分析
做音视频开发绕不开分析工具，掌握使用分析工具至关重要。常用的音视频分析工具包括但不限于：Mp4Parser、VideoEye、Audacity。其中Mp4Parser用于分析mp4格式及其结构。VideoEye是雷神开源的基于Windows平台分析视频码流工具(在此致敬雷神的开源精神)。Audacity是一款开源的音频编辑器，可用于添加各种音效、分析音频波形图。

8、视频渲染
视频渲染相关开源库有：GPUImage、Grafika、LearnOpenGL。其中GPUImage可用于添加各种滤镜特效。Grafika是Google一位工程师开源的基于Android平台渲染示例库。LearnOpenGL主要是配套其网站的学习OpenGL教程。




