('''********************'''shell'''************************************************************'''

设备开机以后，先进入到"BootLoader"进行开机启动，启动uboot 再启动kernel，最后挂载fs（文件系统）。
Shell处于fs文件系统这一层，主要是为了防止程序直接操作内核。

Shell编程中只有一种数据类型为字符串类型(string)
    因此我们在使用脚本文件输出某个语句的时候,是必须要加上双引号的。


与Python的相同点：
1、没有main函数，语句是从头开始执行的
2、一行只写一个语句，若想写入多个语句，需要使用分号";"分隔开。
3、使用 elif 替代 else if

#! /bin/bash


#真和假
Shell中，0为真(true)，1为假(false)。
使用true： /bin/true
使用false：/bin/false
条件判断中也可使用 true 或 [ 1 ] 表示真，使用 false 或 [ 0 ] 表示假。


# 查看当前使用的Shell脚本解释器
~$ echo $SHELL

#shell文件的运行方式
1、./脚本名
2、bash 脚本名
3、source 脚本名
4、绝对路径脚本名
5、bash < 脚本名    #重定向的方式


#输入输出命令
read    输入命令，读取键盘输入的信息
echo    输出命令，将信息输出到屏幕上，自带换行

实例：
$read name                      #定义变量name，从键盘输入读取
$read -p 请输入你的名字: name   #定义变量name，从键盘输入读取，给出提示词

$echo $PATH                     #常用于输出环境变量
$echo "你好！$name"             #格式化输出
$echo -e "我很好\n你呢"         #解释转义字符
$echo -n "hello"                #打印后不换行


#外部命令
Shell命令被区分为外部命令与内建命令
内建可以直接使用，外部命令则需要指明命令的绝对路径，如/bin/pwd、/bin/ls


'''********************'''shell符号'''************************************************************'''
#shell通配符
通配符     含义                             示例
*           匹配任意长度的任意字符          ls *.c    （列出所有以.c结尾的文件）
?           匹配一个任意字符                ls ?.c    （列出所有以.c结尾且名字只有一个字符的文件）
[ ]         匹配一个指定范围内的字符        ls [abc]* （列出所有名字以a/b/c开头的任意文件）
[^]         匹配一个指定范围外的字符        ls [^abc]*（列出所有名字不以a/b/c开头的任意文件）

使用细节
[a-z]     代表一个长度的a-z之间的任意字符
[az]      代表一个长度，匹配字符a或者字符z
[^az]     代表一个长度，匹配字符a和z以外的所有数据

ls 支持 Shell 通配符，但并非所有的 Shell 命令都支持通配符，有些支持的是正则表达式


#shell管道符
管道使得一个命令的执行结果，可以传导给下一个命令，如：
cat /etc/passwd | awk -F=/ '{print $1}' | wc

两个管道 | 将cat、awk 和 wc 三个命令连起来


#tee命令
tee命令把结果输出到标准输出，并得到一个输出的副本文件。

ls -l | tee 1.txt       #屏幕上输出 ls -l 的结果同时，生成一个1.txt文件保存 ls -l 命令的结果
ls -a | tee -a 1.txt    #屏幕上输出 ls -a 的结果同时，将ls -a 命令的结果追加写入到1.txt文件中


#shell文件重定向
序号  重定向符    示例                      说明
1     0<          wc 0< a.txt               从a.txt输入内容到wc，0< 可简写为 <
2     1>          ls 1> a.txt               将ls输出重定向为a.txt，1> 可简写为 >
3     1>>         ls 1>> a.txt              将ls输出追加到a.txt，1>> 可简写为 >>
4     2>          ls nonExist 2> a.txt      将错误输出重定向为a.txt
5     2>>         ls nonExist 2>> /dev/null 将错误输出追加到/dev/null
6     &>          ls &> /dev/null           将所有输出重定向到/dev/null


#反引号
反引号在脚本中的作用是在复合语句中将标记并执行可执行的命令
（即执行符号命令而非当成字符串处理）

实例：
files=ls    # 结果files的值是 "ls"
files=`ls`  # 结果files的值是ls命令结果组成的字符串



'''********************'''shell变量'''************************************************************'''
注意事项：
1、赋值号两边不能有空格
2、变量默认为字符串类型
3、双引号一般不省略
4、在引用时，必要时候使用花括号帮助解释器识别变量的边界


#数值运算
对变量进行数值运算，有三种办法：
1、双括号          a=10               a=$((a+1))
2、类型声明        declare -i b=20    b=b+1
3、expr 命令       c=30               c=`expr $c + 1`      #$c + 1 是expr的三个参数，需要用空格隔开

declare命令参数
-a  声明一个数组
-i  声明一个整型
-f  打印所有函数定义
-F  仅打印函数名字
-r  声明一个readonly变量，该变量的值无法改变，并且不能为unset
-x  和export的作用类似

#关键字
readonly    声明一个只读变量
unset       删除变量


'''********************'''test命令'''************************************************************'''
test命令可以对表达式进行判定，格式：
test 表达式
判断条件成立时，其返回值为0，使用 echo $? 打印
实例：
$test $b -eq $c
$echo $?

test表达式一般用于 条件分支、循环语句 下的条件判断。
test语句写成更易读的括号形式，脚本的方括号两边必须留有空格。下面两句等价：
if test $a -eq $b
if [ $a -eq $b ]        #方括号两边必须留有空格


test 命令可以监测判定如下三种不同的情形
可以使用 echo $? 获取到上次进程或命令 执行的结果。

#数值比较（只能用于整数变量）
-eq     等于
-nq     不等于
-lt     小于
-le     小于或等于
-gt     大于
-ge     大于或等于

#字符串比较
==      等于            
!=      不等于
\<      小于
\>      大于
-z      字符串为空
-n      字符串非空

#文件比较
-e      文件存在
-d      目录存在
-f      存在且为普通文件
-r      存在且可读
-w      存在且可写
-x      存在且可执行


#逻辑运算（与C语言相同）（运算符前后需要留有空格）
逻辑反     !
逻辑与     &&
逻辑或     ||

对于逻辑与"&&"而言，若第一个条件 cmd1 为假，则第二个条件 cmd2 就不会再运行。
test -e 1.txt && echo "hello"    #判断1.txt是否存在,存在则输出"hello"
test -e 2.txt && echo "world"    #判断2.txt是否存在,不存在则不输出"world"

对于逻辑或"||"而言，若第一个条件 cmd1 为真，则第二个条件 cmd2 就不会再运行。
test -e 1.txt || echo "123"      #判断1.txt是否存在,存在则不输出"123"
test -e 2.txt || echo "456"      #判断2.txt是否存在,不存在则输出"456"



'''********************'''分支语句'''************************************************************'''
#二路分支if-then
语法格式：

if [ 条件1 ]
then
    ...
    ...
elif [ 条件2 ]
then 
    ...
    ...
fi      # 将if倒着写，代表分支语句的结束


在Shell当中 有一个特殊的命令值得注意，那就是 ":" 称为空命令 该命令不做任何事，但是总是返回真 true。
if :
    then 
    echo "0"
fi

#多个条件写法示例
if [ -r ${file} ] && [ -w ${file} ]


'''************************************************************'''
#多路分支case
case命令可类比成C语言当中 switch / case 语句，每个匹配分支可以有若干条命令，末尾必须以 ";;" 结束，可以类比成C语言当中的 break。
语法格式：

#case 测试值 in
#    比较值1)
#        ... ...
#        ;;
#    比较值2)
#        ... ...
#        ;;
#    比较值3)
#        ... ...
#        ;;
#    *)
#        ... ...
#esac                   # 将case倒着写，代表分支语句的结束

都是字符串，无论是否添加单引号、双引号都是等价的

实例：
#n=2
#case $n in
#    1)
#        echo "one"
#        ;;
#    '2')
#        echo "two"
#        ;;
#    "3")
#        echo "three"
#        ;;
#    *)
#        echo "对不起，这超出我的理解范围了"
#esac



'''********************'''循环语句'''************************************************************'''
#for循环
语法：

for 变量 in 枚举列表
do
    ... ...
    ... ...
done


注意：
1、枚举列表可以是多个字符串或是多个变量
2、变量是每次循环时，所枚举字符串中的各个单词
3、循环次数取决于枚举列表中的单词个数

实例1：
p="pear"
for FRUIT in apple banana $p
do
    echo "I like $FRUIT"
done

实例2：
for VAL in `ls`;do echo "$VAL" done     #把当前路径下的所有文件名输出出来

实例3：
for FILENAME in chap?;do mv $FILENAME $FILENAME~;done   #将当前目录下的 chap0 chap1 chap2 等，文件名改为 chap0~ chap1~ chap2~ 等

实例4：
n=0
for word in `cat $file`         #计算指定文件中的单词个数
do
    n=$((n+1))
done


'''************************************************************'''
#while循环
语法：

while 条件
do
    ... ...
    ... ...
done


实例：
n=1
sum=0
while [ $n -le 100 ]        #循环累加100以内的所有自然数
do
    sum=$((sum+$n))
    n=$((n+1))
done


'''************************************************************'''
#until循环
与C语言的 do-while 循环相似，语法：

until 条件
do
    ... ...
    ... ...
done


实例：
n=1
sum=0
until [ $n -gt 100 ]        #求100以内所有自然数之和
do
    sum=$((sum+$n))
    n=$((n+1))
done


'''************************************************************'''
死循环的判断条件可以为 true 或 [1]

使用 break 可以跳出整个循环
使用 continue 可以跳出当次循环，进入下一次循环



'''********************'''参数和函数'''************************************************************'''
#外部参数
脚本启动时可以携带参数，如：

$./test.sh  abcd  1234

在脚本文件中，可以使用 $+数字 的形式调用外部参数

echo "参数0：$0" # 打印外部参数test.sh
echo "参数1：$1" # 打印外部参数abcd
echo "参数2：$2" # 打印外部参数1234


#特殊变量
变量名    含义
$0        表示脚本的名字
$n        n是数字 启动脚本传递的参数内容，设 $1 相当于 argv[1].
$#        传入的外部参数个数，相当于 argc 但不包含执行的脚本文件本身
$@        传入参数列表  "$1"  "$2" ...... 例如可以用在 for 循环中的 in 后面，可类比char*argv[]
$*        同上
$?        上一条命令的 Exit Status，可以直到上次运行的程序是否正常结束
$$        当前进程的进程号


#shift 左移命令行参数
位置参数可以使用 shift 命令进行左移
比如 shift 3 表示把原来的 $4 变成 $1，原来的 $5 变成 $2，原本的 $1 $2 $3 丢弃。
不带参数的 shift 命令相当于 shift 1。

实例：
echo "file name $0 正在运行"
echo "file name $1 "
echo "file name $2 "
echo "file name $@ "
shift
echo "file name $1 "
echo "file name $2 "
echo "file name $@ "


#脚本函数
语法：

函数名()
{
    ... ...
}

关键语法点：
1、函数不需要写参数列表，仍可以接受参数
2、函数不需要写返回值类型，仍可以有返回值
3、函数的返回值要可被转化为数值，比如0、5、“123"都可以，但"yes”、"ok"不行
4、函数名不能与系统命令或脚本关键字冲突
5、函数的参数引用与外部参数引用方式完全一致，$1 代表第一个参数、$2 代表第二个参数，$# 代表参数个数

实例1：
func()
{
    if [ $# -ge 1 ]         # 如果传递了1个参数，则返回参数长度
    then
        return ${#1}
    else                    # 否则返回0
        return 0
    fi
}

func abc        #函数调用
echo $?
3               #返回结果3


实例2：
fun() { echo "It is a Function"; }

注意函数体的左花括号和后面的命令之间必须有空格或换行， 
如果将最后一条命令和右花括号写在同一行，命令末尾必须要有分号。



'''********************'''过滤器'''************************************************************'''
Shell命令中，grep，awk，sed等命令可以支持正则表达式，这些命令称为过滤器。其它命令几乎都不支持正则表达式，只支持shell通配符。

#grep
命令 grep 用于在指定文件或目录中，查找某些字符串

格式：grep '正则表达式' 文件或目录名 参数
可选参数 r：目录递归包含里面的所有文件  n：打印行号

实例：在指定的文件 a.txt 中查找所有以 “app” 开头，中间不含数字的单词
命令：grep 'app[^0-9]*' a.txt


#awk
命令 awk 以行为单位，每次读取文件中的一行，查找与命令行中表达式匹配的内容进行处理。如果找不到匹配内容，则继续处理下一行。
值得指出的是，awk 特别擅于处理具有列格式的文件。

格式：awk '条件1 {动作1} 条件2 {动作2} ……' file        #条件为正则表达式。动作前面可以不加条件，表示该动作无条件执行

其执行逻辑是：
1、从file中读取一行；
2、针对这一行判断条件1，成立则执行动作1，否则不执行；
3、然后判断条件2，成立则执行动作2，否则不执行；
4、重复以上步骤，直到将文件读完为止。

详细略


#sed
sed，是stream editor（流编辑器的简写）
sed 的工作就是把文件或字符串里面的文字经过一系列编辑命令转换为另一种格式输出

格式：sed '表达式' 文件名

详细略