('''********************'''正则表达式'''************************************************************'''
正则表达式（Regular Expression，通常简称RE）
就是指使用一些具有特定含义的字符，去组合成具有某种特定规律的字串，对文本、选项、参数等进行比对、抽取等动作。

正则表达式和Shell脚本的通配符，这两者之间有许多符号是一样的，但含义大不相同。
Shell命令中，grep，awk，sed等命令可以支持正则表达式，其它命令几乎都不支持正则表达式，只支持shell通配符。

正则表达式测试网站    https://c.runoob.com/front-end/854/

#元字符
相比于通配符，正则表达式具有更多且更细致的特殊字符，这些字符通常被称为元字符。

元字符     含义                        正则举例       说明
                                       
^          行首                        ^ab            匹配以ab单词为开头的单词
$          行尾                        ab$            匹配以ab为结尾的单词
.          一个除换行符的任意字符      a.b            以a开头以b结尾的中间有且仅有一个任意字符，只能在方括号外
<>         指定单词                    <ab>           精准匹配单词ab，需要配合转义字符使用 \<ab\>，该表达式前后只能是制表符
|          逻辑或                      ab|AB          匹配 ab 或 AB
[]         一个指定范围内的字符        a[xy]b         匹配 axb 或 ayb
[^]        一个自定范围外的字符        a[^xy]b        匹配以a开头以b结尾，中间不是x或y的字符
？         前面的字符重复0次或1次      ab?c           匹配abc或ac
+          前面的字符重复1次或多次     ab+c           匹配以a开头c结尾，中间含有1个或多个b的单词
*          前面的字符重复0次或多次     ab*c           匹配以a开头c结尾，中间含有0个或多个b的单词
{n}        前面的字符重复n次           a{3}           匹配字符a连续出现3次的单词
{n，}      前面的字符重复n次或n以上    a{3，}         匹配字符a连续出现3次或以上的任意单词
{n，m}     前面的字符重复n到m次        a{3,5}         匹配字符a连续出现3到5次的任意单词
-          区间（0-9、a-z、A-Z）       a[4-6]         匹配含 a4 或 a5 或 a6 的单词
\          将后面的符号变成普通字符    a\+            匹配含 a+ 的单词

\b         以后面为开头或以前面为结尾
\B         不以后面为开头或不以前面为结尾
\w         匹配一个单词字符，包含数字、大小写字母、下划线
\W         匹配一个非单词字符
\d         匹配一个数字
\D         匹配一个非数字
\s         匹配一个空白字符，如空格、TAB、换行等
\S         匹配一个非空白字符
()         分组。获得整个匹配


#模式匹配修饰符
g          全局匹配
i          忽略大小写
m          多行模式
s          包含换行符，即"."可以匹配"\n"（默认不匹配）


#贪婪模式
\d{3,4} 既可以匹配3个数字也可以匹配4个数字，不过当有4个数字的时候，优先匹配的是4个数字，
这是因为正则表达式默认是贪婪模式，即尽可能的匹配更多字符，若要同时匹配多个和少个符合表达式的字符，应将少的写在前面。
若要使用非贪婪模式，我们要在表达式后面加上 ?号。



'''********************'''运算符优先级'''************************************************************'''
运算符	                        描述
\	                            转义符
(), (?:), (?=), []	            圆括号和方括号
*, +, ?, {n}, {n,}, {n,m}	    限定符
^, $, \任何元字符、任何字符	    定位点和序列（即：位置和顺序）
|	                            "或"运算



'''********************'''分组'''************************************************************'''
#分组和捕获
在正则表达式中使用()可以将表达式分组，每个括号中的内容各成一组。当使用分组时，除了获得整个匹配，还能够在匹配中选择每一个分组。

分组有一个非常重要的功能——捕获数据。所以()被称为捕获分组，用来捕获数据，当我们想要从匹配好的数据中提取关键数据的时候可以使用分组。
实例：0731-8825951
正则：(\d{4})-(\d{7})

(\d{4}) 和 (\d{7})就分别捕获了两段数据：
0731
8825951


#非捕获分组
如果不需要捕获某个分组的内容，但是又想使用分组的特性。这个时候就可以使用非捕获组
(?:表达式)


#分组的回溯引用
使用\N可以引用编号为N的分组
实例：0123<font>提示</font>abcd              匹配<font>提示</font>
正则：/<(\w+)>.*?</\1>/g

使用\1获取第一个分组的表达式并替换掉自身。



'''********************'''先行断言和后行断言'''************************************************************'''

先行断言和后行断言总共有四种：
1、正向先行断言
2、反向先行断言
3、正向后行断言
4、反向后行断言

先行断言和后行断言只有一个区别，即先行断言从左往右看，后行断言从右往左看。


#正向先行断言
(?=表达式)，指在某个位置向右看，表示所在位置右侧必须能匹配表达式

实例：我喜欢你 我喜欢 我喜欢我 喜欢 喜欢你             匹配"喜欢"两字，要求后面有"你"，但不匹配"你"。
正则：喜欢(?=你)

可用于检测包含至少一个大写和小写字母：(?=.*?[a-z])(?=.*?[A-Z]).+ 


#反向先行断言
(?!表达式)，作用是保证右边不能出现某字符

实例：我喜欢你 我喜欢 我喜欢我 喜欢 喜欢你             匹配"喜欢"两字，且后面没有"你"。
正则：喜欢(?!你)

可用于排除邮箱、标签等。


#正向后行断言
(?<=表达式)，指在某个位置向左看，表示所在位置左侧必须能匹配表达式

实例：我喜欢你，喜欢你，我喜欢我自己，我喜欢你，我不喜欢你           匹配"喜欢"两字，要求前面有"我"并且后面有"你"
正则：(?<=我)喜欢(?=你)                

#反向后行断言
(?<!表达式)，指在某个位置向左看，表示所在位置左侧不能匹配表达式

实例：我喜欢你，喜欢你，我喜欢我自己，我喜欢你                       匹配"喜欢"两字，要求前面没有"我"并且后面没有"你"
正则：(?<!我)喜欢(?!你)



