('''********************'''机器学习'''************************************************************'''
机器学习的基本原理是从数据中学习模式和规律，然后利用这些模式和规律来进行预测和决策。

#基本流程
收集数据、数据预处理、特征提取、模型训练、模型评估以及模型应用。

#机器学习分类
监督学习（Supervised Learning）指我们给机器的训练数据有 标记 或者 答案
无监督学习（Unsupervised Learning）指给机器的训练数据没有任何 标记 或者 答案
半监督学习（Semi-Supervised Learning）指给机器的训练数据以部分有 标记 或者 答案，另一部分没有
强化学习（Reinforcement Learning）根据周围环境的情况，采取行动，根据采取行动的结果学习行动方式


'''********************'''监督学习'''************************************************************'''
#回归算法
回归是连续值（样本）到连续值（输出），例如价格、温度、分数等。
线性回归（Linear Regression）
岭回归（Ridge Regression）
套索回归（Lasso Regression）
多项式回归（Polynomial Regression）
决策树回归（Decision Tree Regression）
随机森林回归（Random Forest Regression）
神经网络回归

#分类算法
分类是离散值（样本）到离散值（输出），如判断垃圾邮件、识别图片中的动物种类、预测一个肿瘤是良性还是恶性等
逻辑回归（Logistic Regression，尽管名为“回归”，但实际上是用于分类）
朴素贝叶斯（Naive Bayes）
策树（Decision Tree）
支持向量机（Support Vector Machine，SVM）
随机森林（Random Forest）
梯度提升机（Gradient Boosting Machine）
K近邻（K-Nearest Neighbors，KNN）
神经网络（如卷积神经网络CNN）


'''********************'''无监督学习'''************************************************************'''
#聚类算法
将数据集分成若干个互不相交的子集，每个子集被称为一个簇。
这些算法能够根据数据点之间的相似性进行分组，使得同一簇内的数据点尽可能相似，而不同簇之间的数据点尽可能不同。
K-Means
层次聚类
DBSCAN

#降维算法
通过降低数据的维度来揭示数据的内在结构，从而有助于后续的分类或聚类任务。
这些算法可以将高维数据映射到低维空间，以便更好地进行可视化或者加快计算速度。
主成分分析（PCA）
独立成分分析（ICA）

#异常检测算法
用于检测数据集中的异常点或异常数据。


'''********************'''代价函数'''************************************************************'''
代价函数（Cost Function） 是在机器学习和优化问题中用来量化模型预测结果与真实值之间的差异的函数。
它衡量了模型对训练样本的预测能力，即模型的好坏。
在训练过程中，我们的目标是使代价函数最小化，以便模型能够更好地拟合训练数据。

#常见代价函数
均方误差（Mean Squared Error, MSE）：用于回归问题，计算预测值与真实值之间差的平方的平均值。
交叉熵（Cross Entropy）：用于分类问题，特别是当输出是概率分布时。它衡量了预测概率分布与真实概率分布之间的差异。
对数似然损失（Log-likelihood Loss）：常用于概率模型，如逻辑回归或神经网络。它衡量了模型给出的概率与真实标签之间的似然性。

