('''********************'''Python编译器'''************************************************************'''

（1）Linux下 Python 解释器路径
#!/usr/bin/python3          指定解释器的路径。
#!/usr/bin/env python3      这种用法先在 env（环境变量）设置里查找 python 的安装路径，再调用对应路径下的解释器程序完成操作。

（2）编码格式
# coding=utf-8			注意：= 号两边不要空格。

（3）查看 Python 版本
python -V
python --version

（4）在给定的python文件执行python脚本
python file.py

（5）Python 的标准库提供了一个 keyword 模块，可以输出当前版本的所有关键字：
>>>import keyword
>>>keyword.kwlist
['False', 'None', 'True', 'and', 'as', 'assert', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else','except', 'finally', 'for',
 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 'with', 'yield']

（6）help() 函数
如：help(print) 可以打印 print 函数的说明

（7）dir() 函数
内置的函数 dir() 可以找到模块、函数、类内定义的所有名称，以一个字符串列表的形式返回。
如果没有给定参数，那么 dir() 函数会罗列出当前定义的所有名称。

（8）win11右键菜单新建Python文件方法
1、Win+R 打开 regedit
2、在 计算机\HKEY_CLASSES_ROOT\.py 中新建项 ShellNew
3、在 ShellNew 中新建字符串值，名称为 Filename
4、在 计算机\HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Explorer\Discardable\PostSetup\ShellNew 中，
在Classes数据的最后一行添加 .py



'''********************'''基础语法'''************************************************************'''
（1）多行注释可以用多个 # 号，还有 ''' 和 """：
'''
第1注释
第2注释
'''
 
"""
第3注释
第4注释
"""

（2）Python 中单引号 ' 和双引号 " 使用完全相同。使用三引号(''' 或 """)可以指定一个多行字符串。如下                           """
>>>temp='''asda
asda
asda
'''
>>>print(temp)
asda
asda
asda

（3）转义符 \：反斜杠可以用来转义，使用 r 可以让反斜杠不发生转义。 如 print(r"this is a line with \n") 则 \n 会显示，并不是换行。

（4）Python最具特色的就是使用缩进来表示代码块，不需要使用大括号 {} ,缩进的空格数是可变的，但是同一个代码块的语句必须包含相同的缩进空格数。

（5）Python 通常是一行写完一条语句，但如果语句很长，我们可以使用反斜杠 \ 来实现多行语句，但在 [], {}, 或 () 中的多行语句，不需要使用反斜杠 \

（6）Python 可以在同一行中使用多条语句，语句之间使用分号 ; 分割

（7）
input()     输入函数，等待用户输入，输入值以字符串类型返回
print()     输出函数，默认输出是换行的，如果要实现不换行需要在变量末尾加上 end=""。如 print( x, end=" " )
    格式化输出
    print("100 + 200 = %d" % 300)   #左边的%d被替换成右边的300
    print("A的小写是%s" % "a")      #左边的%s被替换成右边的a
    得到的结果是：100 + 200 = 300A的小写是a
    #多个参数，需要使用 ()
    print("%d + %d = %d" % (100,200,300))
    print("%s %s" % ("world","hello"))
    得到的结果是：100 + 200 = 300world hello

print函数的打印输出多个变量，默认是以空格隔开。如果想改成其它的分隔符，可设置sep参数。
>>>a = 1
>>>b = 2
>>>print(a, b, sep="%")
1%2



'''********************'''变量'''************************************************************'''
（1）在 Python3 中，可以用中文作为变量名，非 ASCII 标识符也是允许的了。

（2）变量
    Python 中的变量不需要声明。每个变量在定义时必须初始化。
    Python 中的变量没有类型，我们所说的"类型"是变量所指的内存中数据对象的类型。一个变量可以通过赋值指向不同类型的对象。
    Python 中允许你同时为多个变量赋值。例如：a = b = c = 1  或者  a, b, c = 1, 2, "runoob"
    Python 中交换两变量的值允许此写法：x, y=y, x

（3）del + 变量名（,变量名...）      删除变量对象

（4）在Python中，每个不可变对象如 字符串、数字、键 等都有一个固定内存地址
创建一个变量=这个不可变对象，相当于为这个不可变对象起别名
>>>a=1
>>>b=1
>>>a==b
True
>>>id(a)
140713361531688
>>>id(b)
140713361531688
>>>id(1)
140713361531688

每个可变对象的变量在创建时，即使变量所指的可变对象的值相同，也会创建新的可变对象，具有不同的内存地址。



'''********************'''模块和包'''************************************************************'''
模块是一个包含所有你定义的函数和变量的文件，其后缀名是.py，一个模块只会被导入一次。

模块搜索路径被存储在 sys 模块中的 path 变量，在交互式解释器中，输入以下代码可以查看搜索路径：
>>>import sys
>>>sys.path
['', '/usr/lib/python3.4', '/usr/lib/python3.4/plat-x86_64-linux-gnu', '/usr/lib/python3/dist-packages']

sys.path 输出是一个列表，其中第一项是空串 ''，代表当前目录，亦即我们执行python解释器的目录（对于脚本的话就是运行的脚本所在的目录）。
可以在脚本中修改sys.path来添加模块路径。


模块：
import 语句类似于C语言include语句

import 模块名                                导入整个模块，使用时以 模块名.对象名 的方式访问
import 模块名 as 关联名称                    导入整个模块，并使用新的名称，使用时以 新名称.对象名 的方式访问
from 模块名 import 对象名(,对象名...)        从该模块中导入这些对象 
from 模块名 import *                         导入该模块的全部对象，以该方式导入多个模块有同名对象时，后导入的模块对象会覆盖先导入的模块对象。

在导入整个模块时，模块中的代码也会被执行一遍。
当一个模块被作为脚本独立执行时，它的__name__属性就会被赋值为"__main__"，而被导入使用时__name__的值是其模块名。
因此只要在模块代码运行前执行
if __name__=="__main__":
    然后将模块内的代码至于此处，就可以阻值模块代码的执行。


Python 本身带着一些标准的模块库。
有些模块直接被构建在解析器里，这些虽然不是一些语言内置的功能，但是他却能很高效的使用，甚至是系统级调用也没问题。
有一个特别的模块 sys ，它内置在每一个 Python 解析器中。变量 sys.ps1 和 sys.ps2 定义了主提示符和副提示符所对应的字符串:

>>>import sys
>>>sys.ps1              #主提示符
'>>> '
>>>sys.ps2              #副提示符
'... '
>>>sys.ps1 = 'C> '      #可以修改
C> print('Runoob!')
Runoob!
C> 


# Python 标准库
标准库随着Python解释器，一起安装在你的电脑中的，它是Python的一个组成部分。

标准库模块
os 模块：os 模块提供了许多与操作系统交互的函数，例如创建、移动和删除文件和目录，以及访问环境变量等。

sys 模块：sys 模块提供了与 Python 解释器和系统相关的功能，例如解释器的版本和路径，以及与 stdin、stdout 和 stderr 相关的信息。

time 模块：time 模块提供了处理时间的函数，例如获取当前时间、格式化日期和时间、计时等。

datetime 模块：datetime 模块提供了更高级的日期和时间处理函数，例如处理时区、计算时间差、计算日期差等。

random 模块：random 模块提供了生成随机数的函数，例如生成随机整数、浮点数、序列等。

math 模块：math 模块提供了数学函数，例如三角函数、对数函数、指数函数、常数等。

re 模块：re 模块提供了正则表达式处理函数，可以用于文本搜索、替换、分割等。

json 模块：json 模块提供了 JSON 编码和解码函数，可以将 Python 对象转换为 JSON 格式，并从 JSON 格式中解析出 Python 对象。

urllib 模块：urllib 模块提供了访问网页和处理 URL 的功能，包括下载文件、发送 POST 请求、处理 cookies 等。


'''************************************************************'''
#包
包是放了多个Python模块的文件夹。
python3.3版本以前，包里需要有一个__init__.py的源文件(即便是空的)，用以识别该文件夹是包。
之后的版本引入了命名空间包的概念，因此就不需要了。

导入模块时使用点号(.)将包与文件夹分隔，例如：
文件夹名TC   模块名mk   对象名dx
导入：import TC.mk
访问：TC.mk.dx
__name__的值为：TC.mk


__init__.py文件可以用于对包的初始化，在包被导入时优先执行该文件的代码，也可以在此设置包的全局对象。

包中的模块访问其它模块或包也需要导入，不能直接访问。


#__all__属性
在源模块中使用__all__属性修饰对象，其它使未被修饰的对象无法被导入其它文件，防止变量污染，如：
__all__ = [ "func", 'x' ]   #func和x以外的对象无法被导入其它文件

在包的构造文件中使用__all__属性修饰包中模块名，可以在使用 from 包名 import * 导入包的同时导入这些模块，否则该语句将不导入任何模块。