('''********************'''数据类型'''************************************************************'''

Python3 的六个标准数据类型中：
不可变数据（3 个）：Number（数字）、String（字符串）、Tuple（元组）；
可变数据（3 个）：List（列表）、Dictionary（字典）、Set（集合）。

此外还有一些高级的数据类型，如: 字节数组类型(bytes)。



'''********************'''数字（Number）'''************************************************************'''
Python中 数字Number 有四种类型：整数、布尔型、浮点数和复数。

int     (整数), 如 1, 只有一种整数类型 int，表示为长整型，没有 python2 中的 Long。
bool    (布尔), 如 True。
float   (浮点数), 如 1.23、3E-2
complex (复数), 如 1+2j、 1.1+2.2j

Python 支持复数，复数由实数部分和虚数部分构成，可以用 a + bj，或者 complex(a,b) 表示， 复数的实部 a 和虚部 b 都是浮点型。
实例
>>>x=1+2j       #python是面向对象的语言，因此x其实是Number对象
>>>x.real       #获取实部
1.0
>>>x.imag       #获取虚部
2.0


# type() 函数
内置的 type() 函数可以用来查询变量所指的对象类型。
>>>a, b= 20, True
>>>print(type(a), type(b))
<class 'int'> <class 'bool'> 

此外还可以用 isinstance 来判断：
>>>a = 111
>>>isinstance(a, int)
True

isinstance 和 type 的区别在于：
type()不会认为子类是一种父类类型。
isinstance()会认为子类是一种父类类型。

>>>type(b) is int
False
>>>isinstance(b, int)
True



'''********************'''数值运算'''************************************************************'''
数值的除法包含两个运算符：/ 返回一个浮点数，// 返回一个整数（结果向下取整）。
在混合计算时，Python会把整型转换成为浮点数。

精度问题：浮点数运算有可能出现精度丢失的问题，如0.1+0.2=0.30000000000000004
解决方法 
>>>import decimal  #十进制模块
>>>a = decimal.Decimal('0.1')
>>>b = decimal.Decimal('0.2')
>>>print(a+b)
0.3

complex(a,b)        返回一个复数，a为实部，b为虚部
c.conjugate()       返回c的共轭复数
divmod(x,y)         返回(x//y,x%y)
x ** y              返回x的y次方
pow(x,y)            返回x的y次方
pow(x,y,z)          返回x的y次方%z
abs(x)              若x为实数则返回x的绝对值，若x为复数则返回x的模



'''********************'''运算符'''************************************************************'''
逻辑运算
and     即与运算&&
or      即或运算||
not     即非运算!

优先级：非 > 与 > 或

短路逻辑
与运算判断前项为 True 的情况下才会判断后项，其返回值也是后项值。
或运算判断判断前项为 True 的时候会直接返回前项值。
如：
3 and 4         返回4
3 or 4          返回3


Python3.8 版本新增运算符：（:=）海象运算符，可在表达式内部为变量赋值，如下：
if (n := len(a)) > 10:
    print(f"List is too long ({n} elements, expected <= 10)")


'''************************************************************'''
#位运算
bin()函数：获取一个整数的二进制形式
&：按位与
|：按位或
~：按位非
^：按位异或（不同为一）

#移位运算
10 >> 3 == 10 // pow(2, 3)          右移n位相当于地板除以2的n次方
25 << 4 == 25 * (2 ** 4)            左移n位相当于乘以2的n次方


'''************************************************************'''
成员运算符	  描述
in	          如果在指定的序列中找到值返回 True，否则返回 False。
not in	      如果在指定的序列中没有找到值返回 True，否则返回 False。

实例：
a = 10
list = [1, 2, 3, 4, 5 ]

if ( a in list ):
   print ("变量 a 在给定的列表中 list 中")
else:
   print ("变量 a 不在给定的列表中 list 中")


'''************************************************************'''
身份运算符	描述	                                       实例
is	        is 是判断两个标识符是不是引用自一个对象	       x is y，类似 id(x) == id(y)，如果引用的是同一个对象则返回 True，否则返回 False
is not	    is not 是判断两个标识符是不是引用自不同对象	   x is not y ，类似 id(x) != id(y)。如果引用的不是同一个对象则返回结果 True，否则返回 False。

实例：
注： id() 函数用于获取对象内存地址。

>>>b = 5  
>>>a = 5  
>>>id(a)  
162334512 
>>>id(b)  
162334512  
>>>a is b  
True

可以看出， Python 中，变量是以内容为基准而不是像 c 中以变量名为基准，
所以只要你的数字内容是5，不管你起什么名字，这个变量的 ID 是相同的，同时也就说明了 python 中一个变量可以以多个名称访问。

这样的设计逻辑决定了 python 中数字类型的值是不可变的，因为如果如上例，a 和 b 都是 5，当你改变了 a 时，b 也会跟着变，这当然不是我们希望的。
因此，正确的自增操作应该 a = a + 1 或者 a += 1，当此 a 自增后，通过 id() 观察可知，id 值变化了，即 a 已经是新值的名称。

以上观点在脚本式编程环境中没有问题。但是在交互式环境中，编译器会有一个小整数池的概念，会把（-5，256）间的数预先创建好，
而当a和b超过这个范围的时候，两个变量就会指向不同的对象了，因此地址也会不一样，比如下例：

>>>a=1000
>>>b=1000
>>>id(a);id(b)
2236612366224
2236617350384


is 与 == 区别：is 用于判断两个变量引用对象是否为同一个， == 用于判断引用变量的值是否相等。

>>>a = [1, 2, 3]
>>>b = a
>>>b is a 
True
>>>b == a
True
>>>b = a[:]
>>>b is a
False
>>>b == a
True


'''************************************************************'''
运算符（优先级）                            描述

(expr),[expr],{expr}                        圆括号的表达式

x[index], x[idx:idx], x(*args), x.attr      读取，切片，调用，属性引用

await x                                     await 表达式

**                                          乘方(指数)

+x, -x, ~x                                  正，负，按位非 NOT

*, @, /, //, %                              乘，矩阵乘，除，整除，取余

+, -                                        加和减

<<, >>                                      移位

&                                           按位与 AND

^                                           按位异或 XOR

|                                           按位或 OR

in,not in, is,is not, <, <=, >, >=, !=, ==  比较运算，包括成员检测和身份检测

not x                                       逻辑非 NOT

and                                         逻辑与 AND

or                                          逻辑或 OR

if -- else                                  条件表达式

lambda                                      lambda 表达式

=, :=, +=, -=, *=, /=                       赋值表达式



'''********************'''数据类型转换'''************************************************************'''
数据类型的转换，你只需要将数据类型作为函数名即可，这些内置函数返回一个新的对象，表示转换的值。

函数	                描述
int(x [,base])          将x转换为一个整数，如果是带参数base的话，x要以字符串的形式进行输入，x 为 16进制

float(x)                将x转换到一个浮点数

complex(real [,imag])   创建一个复数

str(x)                  将对象 x 转换为字符串

repr(x)                 将对象 x 转换为表达式字符串

eval(str)               用来计算在字符串中的有效Python表达式,并返回一个对象

tuple(s)                将序列 s 转换为一个元组

list(s)                 将序列 s 转换为一个列表

set(s)                  转换为可变集合

dict(d)                 创建一个字典。d 必须是一个 (key, value)元组序列。

frozenset(s)            转换为不可变集合

chr(x)                  将一个整数转换为一个字符

ord(x)                  将一个字符转换为它的整数值

hex(x)                  将一个整数转换为一个十六进制字符串

oct(x)                  将一个整数转换为一个八进制字符串


