('''********************'''序列'''************************************************************'''
序列是 Python 中最基本的数据结构，属于可迭代对象。
str、list 和 tuple 都属于 sequence（序列）。

基本特点：
1、序列中的每个值都有对应的位置值，称之为索引，第一个索引是 0，第二个索引是 1，倒数第一个为-1，以此类推。
2、可以通过切片获取范围元素。
3、可以用 + 运算符连接在一起，用 * 运算符重复。仅当列表(list)运算后使用同一变量名，其内存地址不变，其它情况则会申请新的内存。


迭代器：迭代器是一个可以记住遍历的位置的对象。迭代器对象从集合的第一个元素开始访问，直到所有的元素被访问完结束。

迭代器属于可迭代对象
可迭代对象可以重复使用，而迭代器是一次性的，迭代器访问后其元素会消失。


序列 函数&方法：   #适用于任何可迭代对象，包括字典、集合等

序号	函数
1   str(seq)            将序列转换为字符串

2	list(seq)           将序列转换为列表

3   tuple(seq)          将序列转换为元组

4	len(seq)            返回元素个数

5	max(seq)            返回元素最大值

6	min(seq)            返回元素最小值

7   sum(seq)            返回元素总和

8   sorted(seq, key=None, reverse=False)     返回从小到大排序后的新序列，key：对每个元素进行处理的函数；reverse：是否翻转。

9   reversed(seq)       返回反转后的迭代器

10  all(seq)            判断序列中是否所有元素的值都为真，返回 True 或 False

11  any(seq)            判断序列中是否存在任意元素值为真，返回 True 或 False

12  enumerate(seq, start=0)      返回一个枚举对象，可以将序列中的每一个元素以及从0开始的序号共同构成一个二元组的列表。start:起始标号。
>>>x = [one, two, three]
>>>list(enumerate(x))
[(0, one), (1, two), (2, three)]

13  zip(seq)            返回一个聚合多个可迭代对象的迭代器，它会将传入的每个序列的每个元素依次组合成元组，即每个参数的第i个元素组合成第i个元组。
>>>x = [1, 2, 3]
>>>y = [4, 5, 6]
>>>list(zip(x,y))
[(1, 4), (2, 5), (3, 6)]

14  map(key, seq)       调用函数对序列的每个元素进行处理，并返回处理结果的迭代器。key:处理函数。
#单参数函数
>>>list(map(ord, "FishC"))
[70, 105, 115, 104, 67]
#多参数函数
>>>list(map(pow, [2, 3, 10], [5, 2, 3]))
[32, 9, 1000]

15  filter(key, seq)   调用函数对序列的每个元素进行处理，并返回处理结果为真的元素序列的迭代器。key:处理函数。
>>>list(filter(str.islower, "FishC"))
['i', 's', 'h']

16  iter(seq)           返回创建的迭代器
>>>x = [1, 2, 3, 4, 5]
>>>y = iter(x)          #调用 iter() 函数创建迭代器y
>>>type(x)              #查看 x 类型
<class 'list'>
>>>type(y)              #查看 y 类型
<class 'list_iterator'>
>>>next(y)              #next() 函数可以提取迭代器元素，可添加第二个参数在迭代器为空时将此参数返回替代异常信息
1
>>>next(y)
2


#打包与解包
>>>A = [1, 2, 3]
>>>x, y, z = A
>>>x
1
>>>y
2
>>>z 
3



'''********************'''列表（list）'''************************************************************'''
 list（列表） 是 Python 中使用最频繁的数据类型，可以完成大多数集合类的数据结构实现。
 list = [ 'abcd', 786 , 2.23, 'runoob', 70.2 ]

列表的特点：
1、列表是写在方括号 [] 之间、用逗号分隔开的元素列表。
2、列表中元素的类型可以不相同，它支持数字，字符串甚至可以包含列表（所谓嵌套）。
3、和字符串一样，列表可以被索引和截取，列表被截取后返回一个包含所求元素的新列表。
4、语法规则与字符串相似，与Python字符串不一样的是，列表中的元素是可以改变的。


 实例：
 >>>print(list[1])          #索引
786
>>>print(list[-2])          #反向索引
runoob
>>>list[-2]
'runoob'
>>>print(list[1:3])         #截取
[786, 2.23]
>>>print(list[1,-2])        #从第二位开始（包含）截取到倒数第二位（不包含）
[786, 2.23, 'runoob']
>>>print(list[1:])
[ 786 , 2.23, 'runoob', 70.2 ]
>>>print(list[0:5:2])       #跨步
['abcd', 2.23, 70.2]
>>>print(list[::-1])        #倒序
[70.2, 'runoob', 2.23, 786, 'abcd']

>>>list[2] = 2              #对列表的数据项进行修改，可以使用切片连续替换多个（实现过程：先删除再插入）
>>>print(list[2])
2

>>>del list[3]
>>>list
[ 'abcd', 786 , 2, 70.2 ]

#append() 方法向队列的末尾添加一个元素。
#pop() 方法从队列的开头删除一个元素并返回它，下标参数为指定元素。
>>>list.append('micah')
>>>print(list)
[ 'abcd', 786 , 2, 70.2, 'micah']
>>>list.extend(1, 'end')
[ 'abcd', 786 , 2, 70.2, 'micah', 1, 'end']
>>>print(list.pop(0))
abcd
>>>list
[ 786 , 2, 70.2, 'micah', 1, 'end']


'''************************************************************'''
Python 表达式	                    结果	                描述
len([1, 2, 3])	                    3	                    长度
[1, 2, 3] + [4, 5, 6]	            [1, 2, 3, 4, 5, 6]	    组合
['Hi!'] * 3	                        ['Hi!', 'Hi!', 'Hi!']	重复
3 in [1, 2, 3]	                    True	                元素是否存在于列表中
for x in [1,2,3]:print(x,end=" ")	1 2 3	                迭代


列表还支持拼接操作：
>>>squares = [1, 4, 9]
>>>squares += [16, 25]
>>>squares
[1, 4, 9, 16, 25]


使用嵌套列表即在列表里创建其它列表，类似二维数组，例如：
>>>a = ['a', 'b', 'c']
>>>n = [1, 2, 3]
>>>x = [a, n]
>>>x
[['a', 'b', 'c'], [1, 2, 3]]
>>>x[0]
['a', 'b', 'c']
>>>x[0][1]
'b'


'''************************************************************'''
列表比较需要引入 operator 模块的 eq 方法：
import operator

a = [1, 2]
b = [2, 3]
c = [2, 3]
print("operator.eq(a,b): ", operator.eq(a,b))
print("operator.eq(c,b): ", operator.eq(c,b))
以上代码输出结果为：

operator.eq(a,b):  False
operator.eq(c,b):  True


'''************************************************************'''
Python包含以下方法:

序号	方法
1	list.append(obj)                #obj:元素名
在列表末尾添加新的对象
2	list.count(obj)
统计某个元素出现的次数
3	list.extend(seq)                #seq:列表名
在列表末尾一次性追加另一个序列中的多个值（用新列表扩展原来的列表）
4	list.index(obj, start=0, stop=len(list))    #start:开始查找的位置  stop:结束位置
获取指定元素名的索引下标
5	list.insert(index, obj)         #index:下标
将对象插入列表
6	list.pop([index=-1])
移除列表中的一个元素（默认最后一个元素），并且返回该元素的值
7	list.remove(obj)
移除列表中某个值的第一个匹配项
8	list.reverse()
反向列表中元素
9	list.sort( key=None, reverse=False)     #key:元素处理函数   reverse:结果倒序
对原列表进行从小到大排序
10	list.clear()
清空列表
11	list.copy()                 #使用=来复制新列表为列表的引用，两个变量是同一个对象。而copy()函数是浅拷贝，创建了新的对象。
复制列表                        #对于多维列表，copy()只能创建第一维列表的内存，列表的列仍然为引用。
                                #此时需要调用 import copy 模块的 deepcopy 函数实现深拷贝。


'''************************************************************'''
多维列表创建
>>>A = [0] * 3                  #正确创建
>>>for i in range(3):
       A[i] = [0] * 3
>>>A
[[0, 0, 0],[0, 0, 0],[0, 0, 0]]

>>>B = [[0] * 3] * 3            #错误创建
>>>B 
[[0, 0, 0],[0, 0, 0],[0, 0, 0]]

修改
>>>A[1][1] = 1
>>>A
[[0, 0, 0],[0, 1, 0],[0, 0, 0]]     #三个子列表为不同对象，创建时是对一个子列表的拷贝
>>>B[1][1] = 1
>>>B
[[0, 1, 0],[0, 1, 0],[0, 1, 0]]     #三个子列表为同一对象，创建时是对一个子列表的引用


'''************************************************************'''
列表推导式   #列表推导式，使用C语言编译，速度更快
             #循环是通过迭代修改各个元素值，列表推导式是创建了新的列表存放处理过的元素值。
列表名 = [表达式 for 元素 in 序列 if 条件表达式]
列表名 = [表达式 for 元素 in 序列 if 条件表达式 for 元素 in 序列 if 条件表达式 ...]      #嵌套
#执行顺序：for语句 if语句 表达式 

>>>C = [1, 2, 3, 4, 5]
>>>C = [i * 2 for i in C]
>>>C
[2, 4, 6, 8, 10]

>>>D = [i * 3 for i in range(4)]
>>>D
[0, 3, 6, 9]

>>>E = [i * 2 for i in 'FishC']
>>>E 
['FF', 'ii', 'ss', 'hh', 'CC']

>>>F = [[0] * 3 for i in range(3)]      #正确创建多维列表
>>>F 
[[0, 0, 0],[0, 0, 0],[0, 0, 0]]
>>>F[1][1] = 1
>>>F
[[0, 0, 0],[0, 1, 0],[0, 0, 0]]




