('''********************'''元组（tuple）'''************************************************************'''
tuple（元组）写在小括号 () 里，元素之间用逗号隔开。也可以不要小括号。
tuple = ( 'abcd', 786 , 2.23, 'runoob', 70.2  )

构造包含 0 个或 1 个元素的元组比较特殊，有一些额外的语法规则：
tup1 = ()    # 创建空元组
tup2 = (20,) # 只有一个元素，需要在元素后添加逗号，否则括号会被当成运算符（普通的括号）使用，创建的变量不会是元组类型


总结：
1、与列表一样，可以容纳不同类型的数据。
2、与字符串一样，元组的元素不能修改。
3、注意构造包含 0 或 1 个元素的元组的特殊语法规则。
4、元组也可以使用 + 操作符进行拼接。也可以进行索引和切片。
5、元组中的元素值是不允许删除的，但可以使用 del 语句来删除整个元组。
6、虽然 tuple 的元素不可改变，但它可以包含可变的对象，比如 list 列表，其包含的可变对象中的值可以修改。
7、元组可以使用列表推导式，但生成结果为列表。
8、元组可以使用元组推导式，使用(),但生成结果为生成器，也叫生成器表达式。

序号	方法
1	tuple.count(obj)                              #obj:元素名
统计某个元素出现的次数
2	tuple.index(obj, start=0, stop=len(tuple))    #start:开始查找的位置  stop:结束位置
获取指定元素名的索引下标



'''********************'''字符串（str）'''************************************************************'''
Python 没有单独的字符类型，一个字符就是长度为 1 的字符串。
与 C 字符串不同的是，Python 字符串不能被改变。向一个索引位置赋值，比如 word[0] = 'm' 会导致错误。

str='123456789'
 
print(str)                 # 输出字符串
print(str[0:-1])           # 输出第一个到倒数第二个的所有字符
print(str[0])              # 输出字符串第一个字符
print(str[2:5])            # 输出从第三个开始到第六个的字符（不包含）
print(str[2:])             # 输出从第三个开始后的所有字符
print(str[1:5:2])          # 输出从第二个开始到第五个且每隔一个的字符（步长为2）  #语法：变量[头下标:尾下标:步长]
print(str * 2)             # 输出字符串str两次，也可以写成 print (2 * str)
print(str + '你好')        # 连接字符串


'''************************************************************'''
转义字符	描述

\(在行尾时)	续行符	

\\	        反斜杠符号	

\'	        单引号	

\"	        双引号	

\a	        响铃，执行后电脑有响声

\b	        退格(Backspace)	

\000	    空	

\n	        换行	

\v	        纵向制表符	

\t	        横向制表符	

\r	        回车，将 \r 后面的内容移到字符串开头，并逐一替换开头部分的字符，直至将 \r 后面的内容完全替换完成。	

\f	        换页	

\yyy	    八进制数，y 代表 0~7 的字符，例如：\012 代表换行。	

\xyy	    十六进制数，以 \x 开头，y 代表的字符，例如：\x0a 代表换行	

\other	    其它的字符以普通格式输出


'''************************************************************'''
字符串格式化使用与 C 中 sprintf 函数一样的语法。
>>>print ("我叫 %s 今年 %d 岁!" % ('小明', 10))
我叫 小明 今年 10 岁!

     符号	 描述
      %c	 格式化字符及其ASCII码
      %s	 格式化字符串
      %d	 格式化整数
      %u	 格式化无符号整型
      %o	 格式化无符号八进制数
      %x	 格式化无符号十六进制数
      %X	 格式化无符号十六进制数（大写）
      %f	 格式化浮点数字，可指定小数点后的精度
      %e	 用科学计数法格式化浮点数
      %E	 作用同%e，用科学计数法格式化浮点数
      %g	 %f和%e的简写
      %G	 %f 和 %E 的简写
      %p	 用十六进制数格式化变量的地址

格式化操作符辅助指令:
符号	功能
*	    定义宽度或者小数点精度
-	    用做左对齐
+	    在正数前面显示加号( + )
<sp>	在正数前面显示空格
#	    在八进制数前面显示零('0')，在十六进制前面显示'0x'或者'0X'(取决于用的是'x'还是'X')
0	    显示的数字前面填充'0'而不是默认的空格
%	    '%%'输出一个单一的'%'
(var)	映射变量(字典参数)
m.n.	m 是显示的最小总宽度,n 是小数点后的位数(如果可用的话)


'''************************************************************'''
f-string 是 python3.6 之后版本添加的，称之为字面量格式化字符串，是新的格式化字符串的语法。

之前我们习惯用百分号 (%):
实例
>>>name = 'Runoob'
>>>'Hello %s' % name
'Hello Runoob'

f-string 格式化字符串以 f 开头，后面跟着字符串，字符串中的表达式用大括号 {} 包起来，它会将变量或表达式计算后的值替换进去：
实例
>>>name = 'Runoob'
>>>f'Hello {name}'  # 替换变量
'Hello Runoob'
>>>f'{1+2}'         # 使用表达式
'3'

>>>w = {'name': 'Runoob', 'url': 'www.runoob.com'}
>>>f'{w["name"]}: {w["url"]}'
'Runoob: www.runoob.com'
用了这种方式明显更简单了，不用再去判断使用 %s，还是 %d。

在 Python 3.8 的版本中可以使用 = 符号来拼接运算表达式与结果：
实例
>>>x = 1
>>>print(f'{x+1}')   # Python 3.6
2

>>>x = 1
>>>print(f'{x+1=}')   # Python 3.8
x+1=2


'''************************************************************'''
format()方法

>>>"今天是{}年{}月{}日".format(2023, 6, 21)       #参数可以是变量或表达式 
今天是2023年6月21日

>>>"今天是{1}年{0}月{2}日".format(2023, 6, 21)    #在大括号中的数字用于指向传入对象在 format() 中的索引值，同一参数可以多次引用
今天是6年2023月21日

>>>"今天是{year}年{month}月{day}日".format(year=2023, month=6, day=21) #使用关键字参数, 它们的值会指向使用该名字的参数.位置及关键字参数可以任意的结合
今天是2023年6月21日

>>>table = {'year':2023, 'month':6, 'day':21}       #传入一个字典, 然后使用方括号 [] 来访问键值
>>>"今天是{0[year]:d}年{0[month]:d}月{0[day]:d}日".format(table)
今天是2023年6月21日

>>>table = {'year':2023, 'month':6, 'day':21}       #也可以通过在 table 变量前使用 ** 来实现相同的功能
>>>"今天是{year:{year:2023}}年{month:{month:6}}月{day:{day:21}}日".format(**table)
今天是2023年6月21日

>>>import math
>>>'常量 PI 的值近似为： {!r}。'.format(math.pi)    #!a(使用 ascii()),!s(使用 str())和!r(使用 repr())可以用于在格式化某个值之前对其进行转化
常量 PI 的值近似为： 3.141592653589793。

#可选项":"和格式标识符可以跟着字段名,相当于C语言中的"%"。
索引下标或关键字参数写在":"的前面

格式（严格顺序）(适用于f字符串)
{[[fill] align] [sign] ['#'] [0] [width] [grouping_option] [.precision] [type]}
参数

fill:   align的填充字符，默认为空格

align:  
值       含义
'<'     字符串左对齐
'>'     字符串右对齐
'='     将填充放置在符号之后但数字之前的位置（如：+0000120此类）
'^'     字符串居中

sign:
值       含义
'+'     在正数前添加正号(+)，在负数前添加负号(-)
'-'     只在负数前添加负号(-)，默认为此参数
空格    在正数前添加一个空格，在负数前添加负号(-)

'#':    添加井号，则为输出的二进制、八进制、十六进制等字符添加对应前缀0b、0o、0x等。

0:      感知正负号的填充，只对数字有效

widget: 填写数字，指定字符宽度，使用空格填充

grouping_option:千位的分隔符，参数为','和'_'，选择哪个参数就用哪个参数作为千分符。

precision:精度，与下条type参数搭配使用，填写'.'加数字，表示位数。非数字类型表示的是最大字段长度，整数类型不允许使用此参数。

type:
     参数：'e'/'E'科学计数法、'f'/'F'限定小数点后的位数(默认精度为6)、'g'/'G'限定小数点前后一共多少位
     参数：'b'/'c'/'d'/'o'/'x'/'X'/'n'/None 表示输出进制
     参数：'n'与'g'类似，不同之处在于会使用当前语言环境设置的分隔符插入到适当位置、'%'百分比形式输出
     

>>>import math
>>>'常量 PI 的值近似为 {0:.3f}。'.format(math.pi)   #此例为保留到小数点后三位。
常量 PI 的值近似为 3.142。


'''************************************************************'''
Unicode 字符串是16位的字符串，能够表示更多的字符集。
在Python2中，普通字符串是以8位ASCII码进行存储的，使用Unicode字符串需要在字符串前面加上前缀 u。
在Python3中，所有字符串都是以16位Unicode字符串存储的。


'''************************************************************'''
Python 的字符串常用内建函数如下：

大小写转换
1	    capitalize()                        将字符串的第一个字符转换为大写，剩下的都小写
2	    title()                             返回"标题化"的字符串,就是将所有单词的首字母大写，其余字母均为小写(见 istitle()
3	    lower()                             转换字符串中所有大写字符为小写。
4	    upper()                             转换字符串中的小写字母为大写
5	    swapcase()                          将字符串中大写转换为小写，小写转换为大写

左中右对齐      #参数width应大于源字符串长度
6	    center(width[, fillchar])           返回一个指定的宽度 width 居中的字符串，fillchar 为填充的字符，默认为空格。
7	    ljust(width[, fillchar])            返回一个原字符串左对齐,并使用fillchar(默认空格）填充至长度 width 的新字符串。
8	    rjust(width,[, fillchar])           返回一个原字符串右对齐,并使用fillchar(默认空格）填充至长度 width 的新字符串。
9	    zfill (width)                       返回长度为 width 的字符串，原字符串右对齐，前面填充0

查找
10   	count(str, beg= 0,end=len(string))      返回 str 出现的次数， beg 和 end 为起止范围
11	    find(str, beg=0, end=len(string))       检测 str 是否包含在字符串中，beg 和 end 为起止范围，如果包含返回索引值，否则返回-1
12	    rfind(str, beg=0,end=len(string))       类似于 find()函数，不过是从右边开始查找.
13   	index(str, beg=0, end=len(string))      跟find()方法一样，只不过如果str不在字符串中会报一个异常。
14	    rindex(str, beg=0, end=len(string))     类似于 index()，不过是从右边开始。

替换
15	    expandtabs(tabsize=8)                   把字符串中的每个 tab 符号转换为 tabsize 个空格，tabsize 默认为8，然后返回这个新字符串。
16	    replace(old, new [, max])               将字符串中的所有 old 替换成 new，如果 max 指定，则替换不超过 max 次。
17	    translate(table, deletechars="")        根据 table 给出的表(包含 256 个字符)转换 string 的字符, 要过滤掉的字符放到 deletechars 参数中
18	    maketrans(src, dst[, ignore])           创建字符映射的转换表，第一个参数是需要转换的字符组成的字符串，第二个参数也是对应的转换目标，第三个参数表示剔除的字符。
>>>"I love FishC".translate(str.maketrans("ABCDEFG","1234567","love"))
'I 6ish3'

判断和检测   #返回值为True或False
19	    startswith(substr, beg=0,end=len(string))   检查字符串是否是以指定子字符串 substr 开头，beg 和 end 为起止范围，是则返回 True，否则返回 False。
20	    endswith(suffix, beg=0, end=len(string))    检查字符串是否以 suffix 结束，beg 和 end 为起止范围，如果是，返回 True,否则返回 False。
21	    isupper()                                   如果字符串中包含至少一个区分大小写的字符，并且所有这些(区分大小写的)字符都是大写，则返回 True，否则返回 False
22	    islower()                                   如果字符串中包含至少一个区分大小写的字符，并且所有这些(区分大小写的)字符都是小写，则返回 True，否则返回 False
23	    istitle()                                   如果字符串是标题化的(见 title())则返回 True，否则返回 False
24	    isalpha()                                   如果字符串至少有一个字符并且所有字符都是字母或中文字则返回 True, 否则返回 False
25      isprintable()                               如果字符串中的字符均可打印则返回 True, 否则返回 False.#如：转义字符是不可打印的
26	    isspace()                                   如果字符串中只包含空白，则返回 True，否则返回 False.
27	    isdecimal()                                 如果字符串中只包含十进制字符，则返回 True，否则返回 False。
28	    isdigit()                                   如果字符串只包含数字则返回 True 否则返回 False.
29	    isnumeric()                                 如果字符串中只包含数字字符（可以判断中文或罗马等非阿拉伯数字）则返回 True，否则返回 False
30	    isalnum()                                   如果字符串至少有一个字符并且所有字符都是字母或数字则返回 True，否则返回 False

截取
31	    lstrip(chars="")                            删除字符串左边的空格或指定字符。
32	    rstrip(chars="")                            删除字符串右边的空格或指定字符。
33	    strip(chars="")                             在字符串上执行 lstrip()和 rstrip()

拆分和拼接
34      partition(sep)                              将字符串分割成三个字符串，分别为参数左侧字符串，参数sep，参数右侧字符串，并组合成元组返回。
35      rpartition(sep)                             和上面相反，这是将从右向左寻得的第一个匹配字符串为基础进行分割。
36	    split(str="", num=string.count(str))        以 str 为分隔符截取字符串，如果 num 有指定值，则仅截取 num+1 个子字符串,默认以空格分割，移除参数字符串，返回列表
37	    splitlines([keepends])                      按照行('\r', '\r\n', '\n')分隔，返回一个包含各行作为元素的列表，如果参数 keepends 为 False，不包含换行符，如果为 True 则保留换行符。
38	    join(seq)                                   以指定字符串作为分隔符，将 seq 中所有的元素(的字符串表示)合并为一个新的字符串  #比起+运算符拼接字符串，join方法速度更快

其它
39	    bytes.decode(encoding="utf-8", errors="strict")   Python3 中没有 decode 方法，但可以使用 bytes 对象的 decode() 方法来解码给定的 bytes 对象，这个 bytes 对象可以由 str.encode() 来编码返回。
40   	encode(encoding='UTF-8',errors='strict')    以 encoding 指定的编码格式编码字符串，如果出错默认报一个 ValueError 的异常，除非 errors 指定的是'ignore'或者'replace'
41	    len(string)                                 返回字符串长度
42	    max(str)                                    返回字符串 str 中最大的字母。
43	    min(str)                                    返回字符串 str 中最小的字母。


