('''********************'''函数'''************************************************************'''
语法格式如下：

def 函数名（参数列表）:
    函数体


实例：
def max(a, b):
    if a > b:
        return a
    else:
        return b

a = 4
b = 5
print(max(a, b))
输出结果：5


return 语句
1、return [表达式] 语句用于退出函数，选择性地向调用方返回一个表达式。
2、不带表达式的 return 或者根本没有 return 语句，默认返回 None。
3、不同于 C 语言，Python 函数可以返回多个值，多个值以元组的方式返回。



'''********************'''参数'''************************************************************'''

*关键字和默认参数必须从右往左连续

#位置参数
def printme( str ):
   print (str)

printme("hello")                        #必须传入参数对应的参数，否则报错


#关键字参数
def printinfo( name, age ):
   print ("名字: ", name)
   print ("年龄: ", age)
 
printinfo( age=50, name="runoob" )      #在传入参数时将形参与实参一一对应，顺序可以不一致


#默认参数
def printme( str="hello" ):
   print (str)

printme()                               #若不传入对应的参数，则使用声明时所给的默认参数


#不定长参数
def printinfo( arg1, *vartuple ):       #加了星号 * 的参数会以元组(tuple)的形式导入，存放所有未命名的变量参数，实际传参数量可以为0。
   print (arg1)
   print (vartuple)
 
printinfo( 70, 60, 50 )                 


def printinfo( arg1, **vardict ):       #加了两个星号 ** 的参数会以字典的形式导入。
   print (arg1)
   print (vardict)
 
printinfo(1, a=2,b=3)                   #以关键字参数的形式传入键值对


#强制位置参数符号（Python3.8 新增语法）

def fun(a, b, /, c, d):         #斜杠 / 之前的参数必须用位置参数传入，符号本身位置不传递参数。
    print(a, b, c, d)

fun(10, 20, 30, d=40)


#强制关键字参数符号
def func(a,b,*,c):              #星号 * 之后的参数必须用关键字参数传入，符号本身位置不传递参数。
    return a+b+c

func(1, 2, c=3)


#解包参数
>>>args = (1, 2, 3, 4)
>>>kwargs = {'a':1, 'b':2, 'c':3, 'd':4}
>>>def myfunc(a, b, c, d)
...    print(a, b, c, d)
...
>>>myfunc(*args)                #在实参中使用星号即可解包元组，进行分别传参
1 2 3 4
>>>myfunc(**kwargs)             #使用两个星号则可以解包字典，进行分别传参
1 2 3 4


#可变对象 与 不可变对象 的传参
在 python 中，str, tuple, 和 number 类型的对象是不可变对象，而 list,dict 等则是可变对象。

不可变类型：变量赋值 a=5 后再赋值 a=10，这里实际是新生成一个 int 值对象10，再让 a 指向它，而 5 被丢弃。并非改变 a 的值，相当于新生成了 a。
可变类型：变量赋值 la=[1,2,3,4] 后再赋值 la[2]=5 则只是将 list la 的第三个元素值更改。

不可变类型传参：类似 C++ 的值传递。如 fun(a)，传递的只是 a 的值，没有影响 a 对象本身。如果在 fun(a) 内部修改 a 的值，则是新生成一个 a 的形参对象。
可变类型传参：类似 C++ 的引用传递。如 fun(la)，则是将 la 真正的传过去，修改后 fun 外部的 la 也会受影响。

python 中一切都是对象，严格意义我们不能说值传递还是引用传递，我们应该说传不可变对象和传可变对象。

#不可变对象传参实例
>>>def change(b):       #为数字1创建形参变量b
...   print(id(b))     #打印数字1的地址
...   b=10
...   print(id(b))     #打印数字10的地址
...
>>>a=1                  #创建一个变量a，指向数字1
>>>print(id(a))         #打印数字1的地址
140713361531688
>>>change(a)            #传入变量a的值，也就是数字1
140713361531688
140713361531976
>>>a
1                       #原本的a值并不因在函数中改变而变化

#可变对象传参实例
>>>def change2(y):      #为列表x创建形参变量y
...    print(id(y))     #打印列表x的地址
...    y[0]=4
...    print(id(y))     #打印列表x的地址
...
>>>x=[1,2,3]            #创建一个列表x，申请了新内存。
>>>print(id(x)          #打印列表x的地址
2666119629440
>>>change2(x)           #传入列表x
2666119629440
2666119629440
>>>x
[4, 2, 3]               #原本的列表x的值被改变



'''********************'''作用域'''************************************************************'''
Python 中只有模块（module），类（class）以及函数（def、lambda）才会引入新的作用域，
其它的代码块（如 if/elif/else/、try/except、for/while 等）是不会引入新的作用域的，也就是说这些语句内定义的变量，外部也可以访问。


global 关键字
使用 global 可以在函数中修改全局变量的值
>>>x = 880
>>>def myfunc(x):
...    global x         #如果没有这句global语句声明，下句的x将会定义一个新的局部变量。
...    x = 520
...    print(x)
...
>>>myfunc()
520
>>>x
520


函数的嵌套
不同于C语言，Python中的函数可以嵌套定义，但在函数中定义的函数只能在该函数中调用，
并且内层的函数中的变量作用域仅限于该内层函数。
类似于 global 关键字，内层函数可以使用 nonlocal 关键字对外层函数的变量进行声明，从而使用。
nonlocal 关键字作用域嵌套作用域，即可以对外层的函数、类、模块中的对象进行声明和使用。


作用域LEGB法则
Local       局部作用域
Enclosed    嵌套函数的外层函数作用域
Global      全局作用域
Build-in    内置作用域

优先级从上到下，优先级高的可以直接访问优先级低的作用域内的对象，当有同名变量或函数被创建时，低优先级会被高优先级所覆盖。
实例：
>>>str = "str函数被字符串变量覆盖！"       #内置函数名str被创建的全局字符串变量名所覆盖，无法再使用该函数
>>>str(520)                                #试图使用str()函数将数字转换为字符串
Traceback (most recent call last):         #报错
  File "<stdin>", line 1, in <module>
TypeError: 'str' object is not callable



'''********************'''生成器'''************************************************************'''
创建生成器对象有两种方法：yield 关键字 和 生成器表达式

关键字 yield
在函数中使用 yield 声明变量可以保存变量状态

与迭代器类似，生成器也是一个可迭代对象，访问后的数据消失，且可以使用 next() 函数访问数据。

>>>def counter():
...    i = 1
...    while i<= 5:
...        yield i 
...        i += 1
...
>>>c = counter()
>>>next(c)
1
>>>next(c)
2


生成器表达式：
>>>t = (i ** 2 for i in range(10))
>>>next(t)
0
>>>next(t)
1
>>>next(t)
4



'''********************'''函数文档、类型注释、内省'''************************************************************'''
#函数文档
>>>def exchange(dollar, rate=6.32):
...    """
...    功能：汇率转换，美元 -> 人民币
...    参数：
...    - dollar 美元数量
...    - rate 汇率，默认值是 6.32 （2022-03-08）
...    返回值：
...    -人民币的数量
...    """
...    return dollar * rate
...
>>>exchage(20)
126.4
>>>help(exchange)
Help on function exchange in module _main_:

exchange(dollar, rate=6.32)
   功能：汇率转换，美元 -> 人民币
   参数：
   - dollar 美元数量
   - rate 汇率，默认值是 6.32 （2022-03-08）
   返回值：
   -人民币的数量


#类型注释
>>>def times(s:str, n:int) -> str:       #对参数类型和返回值类型进行提示
...    return s * n
...
>>>times("Fish", 5)
'FishFishFishFishFish'
>>>times(5, 5)                           #与提示类型不符，但仍然可以执行
25


#内省
内置方法，获取自身相关信息，函数名前后各两条下划线，如：
>>>times.__name__           #查看函数名
'times'
>>>times.__annotations__    #查看类型注释
{'s': <class 'str'>, 'n': <class 'int'>, 'return': <class 'str'>}
>>>print(exchange.__doc__)  #查看函数文档

       功能：汇率转换，美元 -> 人民币
       参数：
       - dollar 美元数量
       - rate 汇率，默认值是 6.32 （2022-03-08）
       返回值：
       -人民币的数量

