('''********************'''random 随机数模块'''************************************************************'''
 #伪随机结果复现
 >>>import random
 >>>x=random.getstate()        获取状态（随机数种子）
 >>>random.randint(1,10)       生成1~10的随机整数
 7
 >>>random.randint(1,10)
 2eand
 >>>random.setstate(x)         设置状态
 >>>random.randint(1,10)
 7
 >>>random.randint(1,10)
 2


 random()	    返回 [0.0, 1.0) 范围内的下一个随机浮点数。
 choice(seq)	从非空序列 seq 返回一个随机元素。 如果 seq 为空，则引发 IndexError。



 '''********************''' bytes 类型'''************************************************************'''
在 Python3 中，bytes 类型表示的是不可变的二进制序列（byte sequence）。
与字符串类型不同的是，bytes 类型中的元素是整数值（0 到 255 之间的整数），而不是 Unicode 字符。
bytes 类型通常用于处理二进制数据，比如图像文件、音频文件、视频文件等等。在网络编程中，也经常使用 bytes 类型来传输二进制数据。
创建 bytes 对象的方式有多种，最常见的方式是使用 b 前缀：
此外，也可以使用 bytes() 函数将其他类型的对象转换为 bytes 类型。bytes() 函数的第一个参数是要转换的对象，第二个参数是编码方式，如果省略第二个参数，则默认使用 UTF-8 编码：
x = bytes("hello", encoding="utf-8")
与字符串类型类似，bytes 类型也支持许多操作和方法，如切片、拼接、查找、替换等等。同时，由于 bytes 类型是不可变的，因此在进行修改操作时需要创建一个新的 bytes 对象。例如：

实例
x = b"hello"
y = x[1:3]          # 切片操作，得到 b"el"
z = x + b"world"    # 拼接操作，得到 b"helloworld"
需要注意的是，bytes 类型中的元素是整数值，因此在进行比较操作时需要使用相应的整数值。例如：

实例
x = b"hello"
if x[0] == ord("h"):        # ord() 函数用于将字符转换为相应的整数值。
    print("The first element is 'h'")




 '''********************'''哈希'''************************************************************'''

 特点：
1、整数的哈希值是其本身。
2、两个不同对象的值相等，那么他们的哈希值也相等。
3、Python中大多数不可变对象的值是可哈希的，可变对象是不可哈希的。
4、可哈希的对象才有哈希值，不可哈希对象没有哈希值。
5、可哈希对象的哈希值在其整个程序的生命周期中保持不变。


 hash() 函数用于获取一个对象的哈希值

 >>>hash(1)
 1
 >>>hash(1.0)
 1
 >>>hash(1.01)
23058430092136961


创建字典和集合对象的一个条件是 字典的键 和 集合的元素 必须是可哈希的，也就是不可变的对象。




